{
  "data": [
    {
      "county": "Albany County",
      "service_area": "TOWNSHIPS OF NEW SCOTLAND, COEYMANS, KNOX, WESTERLO, BERNE, RENSSELAERVILLE, VILLAGE OF GREEN ISLAND AND CITY OF COHOES",
      "name": "Albany County Rural Housing Alliance, Inc.",
      "website url": "http://www.acrha.org",
      "phone no.": "(518) 765-2425",
      "contact person": "JUDITH A. EISGRUBER",
      "service area": "TOWNSHIPS OF NEW SCOTLAND, COEYMANS, KNOX, WESTERLO, BERNE, RENSSELAERVILLE, VILLAGE OF GREEN ISLAND AND CITY OF COHOES",
      "address": "407 24 MARTIN RD VOORHEESVILLE, NY 12186",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=261",
      "email": "jeisgruber@acrha.org",
      "description": "The Albany County Rural Housing Alliance (ACRHA) is a HUD certified housing counseling agency offering education and individual assistance to anyone in need of housing or housing related services.  The main office is located in Voorheesville and our satellite offices are located in Ravena and Cohoes."
    },
    {
      "county": "Albany County",
      "service_area": "ARBOR HILL AND WEST HILL",
      "name": "Albany Housing Coalition, Inc.",
      "website url": "",
      "phone no.": "(518) 465-5251",
      "contact person": "JOSEPH SLUSZKA",
      "service area": "ARBOR HILL AND WEST HILL",
      "address": "278 CLINTON AVE ALBANY, NY 12210",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=99",
      "email": "admin@ahcvets.org",
      "description": "The Albany Housing Coalition, Inc. provides a continuum of housing and support services to veterans, low-income individuals and families in the Capital Region."
    },
    {
      "county": "Albany County",
      "service_area": "ARBOR HILL/NORTH ALBANY",
      "name": "Arbor Hill Development Corp.",
      "website url": "http://www.arborhilldc.org",
      "phone no.": "(518) 463-9993",
      "contact person": "ARLENE C. WAY",
      "service area": "ARBOR HILL/NORTH ALBANY",
      "address": "241 CLINTON AVE ALBANY, NY 12210",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=648",
      "email": "away@arborhilldc.org",
      "description": "Arbor Hill Development Corporation (AHDC), a community-based not-for-profit organization, was founded in 1981 to promote neighborhood revitalization through individual grants and technical assistance.   Covering two distinct areas of Albany, AHDC assists residents with  home maintenance, home ownership counseling and grants,  rental subsidies, community streetscape efforts, neighborhood association support, referrals and general technical assistance.   AHDC also manages rental units and non-profit office space, leveraging over 2 million dollars of  state, federal, and private dollars annually."
    },
    {
      "county": "Albany County",
      "service_area": "SOUTH END OF CITY OF ALBANY",
      "name": "South End Improvement Corp.",
      "website url": "http://www.seicny.org",
      "phone no.": "(518) 436-8777",
      "contact person": "MONIQUE WAHBA",
      "service area": "SOUTH END OF CITY OF ALBANY",
      "address": "38 CATHERINE ST ALBANY, NY 12202",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=227",
      "email": "southendimprovementcorp@gmail.com",
      "description": "The South End Improvement Corporation (SEIC) has been in business since 1978. The mission of SEIC is to aid, assist and foster the planning, development, renewal and improvement of housing conditions in the South End Environs area in the City of Albany, New York;  thereby encouraging city living and the preservation of the residential and commercial character of the area. The service area encompasses approximately 10% of the entire population of Albany, which Albany's population is nearly 95,000 residents. SEIC supports several active neighborhood associations/groups, such as: South End Neighborhood Association (SENA), Delaware Avenue Neighborhood Association (DANA), Lincoln Park, Mt. Hope Townhouse, Krank Park, the Pastures and the Mansion association. These groups conduct regular meetings, organize community activities which promote social interaction, support the improvement of quality of life issues for the South End residents and work in conjunction with SEIC to improve, preserve and stabilize the neighborhoods of its community. SEIC also provides assistance through its Home Maintenance and Security program (\"SHIP aka HMS\"). This assistance is offered to low-moderate income homeowners, as established by HUD income guidelines. The SHIP program affords homeowners up to $1,000 for repairs to their owner occupied houses. In addition, SEIC provides home buyer education and support for tenants with an active interest in purchasing a home as a first time home buyer in the South End. SEIC was the marketing agent for the Frederick Douglass Affordable Housing Program, which was offered through the Albany Housing Authority as the lead agency, and Charles Touhey's company as the developer. Through the collaborative efforts of these two organizations, 15 new homes were built in the South End, placing families of modest means into home ownership for the first time! In addition, SEIC has nearly completed its second RESTORE program. Through RESTORE, 14 Senior owner occupied houses in the community were assisted with emergency repairs. SEIC, through its OUTREACH program provided assistance (and follow-up communication) with its Senior Citizens and other community members. This service includes, but is not limited to, home maintenance assistance, social services support which ensures that senior homeowners, low income homeowners, senior tenants and low income tenants, are receiving all eligible services available to them through programs such as: Home Energy Assistance Program (HEAP), heath care assistance, and the Meals on Wheels  food program. Last, but not least, SEIC has a new homeowner rehabilition program called HARP. Through HARP, SEIC will rehabilitate 13 units for folks of  modest means who own and occupy their homes. The maximum assistance is $19,156.00 per unit. One unit  was completed during this program year."
    },
    {
      "county": "Albany County",
      "service_area": "SECTIONS OF ALBANY: SOUTH END, DELAWARE AVE, ARBOR HILL, NORTH ALBANY, WEST HILL, PINE HILLS, CENTER SQUARE, MANSION, HUDSON PARK, PARK SOUTH",
      "name": "United Tenants Of Albany, Inc.",
      "website url": "http://www.unitedtenantsalbany.org",
      "phone no.": "(518) 436-8997",
      "contact person": "MARIA MARKOVICS",
      "service area": "SECTIONS OF ALBANY: SOUTH END, DELAWARE AVE, ARBOR HILL, NORTH ALBANY, WEST HILL, PINE HILLS, CENTER SQUARE, MANSION, HUDSON PARK, PARK SOUTH",
      "address": "33 CLINTON AVE ALBANY, NY 12207",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=245",
      "email": "utalb@verizon.net",
      "description": "For over thirty years, United Tenants of Albany (UTA) has provided housing services to the Albany community.  UTA's crisis hot-line responds annually to over 5,000 requests for information and housing counseling.  The homeless prevention and the mortgage default counseling programs are directed at assisting low- and moderate-income tenants and homeowners remain in their homes through a combination of intensive counseling, advocacy, mediation, and, in some situations, emergency financial assistance to prevent the eviction or mortgage foreclosure.  UTA staff conducts workshops for various human service organizations on such topics as how to look for apartments, landlord/tenants rights and responsibilities, eviction procedures, and other issues of importance to tenancy.  Pre-purchase counseling is provided to tenants interested in becoming homeowners.  United Tenants of Albany works closely with the Albany Community Land Trust, the Capital District Community Loan Fund, Albany Area Housing Opportunities, and the Affordable Housing Partnership in an effort to increase and maintain the availability of low-income housing in the City of Albany."
    },
    {
      "county": "Bronx County",
      "service_area": "MORRISANIA",
      "name": "163Rd Street Improvement Council, Inc.",
      "website url": "",
      "phone no.": "(718) 620-6007",
      "contact person": "STEPHEN HUNTLEY",
      "service area": "MORRISANIA",
      "address": "490 E 167TH ST BRONX, NY 10456",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=95",
      "email": "shuntley@163council.org",
      "description": "The mission of the 163rd Street Improvement Council, Inc. is to plan, design, develop and implement affordable housing and support services that focus on meeting the housing and human services needs of the residents of the Southeast Bronx.  A majority of our clients have incomes below the median level.  The Council offers an integrated program designed to create the empowerment of its residents.  The Council's history of three-plus decades is rooted in providing quality and affordable housing through direct assistance that includes support services, education, information, advocacy, placement and referral. The Council has also expanded its scope to include special needs housing with support services."
    },
    {
      "county": "Bronx County",
      "service_area": "BELMONT",
      "name": "Belmont Arthur Avenue Local Development Corp.",
      "website url": "http://www.belmontarthurldc.com",
      "phone no.": "(718) 295-2882",
      "contact person": "CONSOLATO CICCIU",
      "service area": "BELMONT",
      "address": "660 E 183RD ST BRONX, NY 10458",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=109",
      "email": "belmontldc@aol.com",
      "description": "The Belmont Arthur Avenue Local Development Corporation (LDC) was founded on 08/18/81 to serve as the official economic development agency for the Belmont Community.  The LDC was created to complement and expand commercial initiatives and to preserve housing stock for moderate- and low-income families.  The LDC also provides the important link to the City of New York in obtaining funding for community projects to foster long range planning.  Housing services provided by the LDC include the development of subsidized housing for low- and moderate-income families, the elderly on fixed incomes, persons with special needs and the homeless.  In addition, they assist landlords in obtaining low interest government loans to upgrade housing stock primarily occupied by low- and moderate-income families.  Low- and moderate-income tenants can also get assistance in accessing social services."
    },
    {
      "county": "Bronx County",
      "service_area": "MORRISANIA",
      "name": "Bronx Shepherds Restoration Corp.",
      "website url": "http://www.bronxshepherds.org",
      "phone no.": "(718) 299-0500",
      "contact person": "SUSAN MCPHERSON",
      "service area": "MORRISANIA",
      "address": "1590 E 172ND ST BRONX, NY 10472",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=115",
      "email": "info@bronxshepherds.org",
      "description": "Bronx Shepherds Restoration Corporation (BSRC) was organized 23 years ago by pastors and lay persons who chose to remain in the South Bronx after major institutions had abandoned the area.  A major thrust of the organization has been the upgrading of existing housing through rehabilitation or new construction. BSRC owns and manages 340 E. 184 St., a 64 unit building, a 46 unit building at 1590 E. 172 St. and an 8 unit building at 942 Leggett Avenue.  They have also sponsored 139 new 2-3 family homes and 267 units of condominium housing; rehabilitated over 140 units of low-income affordable housing; gut rehabilitated 69 units, currently 100% occupied; and have been selected to gut rehabilitate 2 buildings at 932 E 173 St and 937 E 172 St, a total of 48 units.  Under the Neighborhood Small Homes Program, BSRC will rehabilitate 12 1-3 family homes and then sell them to community residents.  A new frail and elderly building located at 171 St. and Park Avenue has been accepting residents since September, 2002.  BSRC is a community consultant in Community Board # 3 for the HPD Anti-Abandonment Program and has retrofitted their building at 1932 Washington Ave. to include use for additional community space.  Bronx Shepherds continues to organize tenants associations and security patrols and provide orientation for all tenants as well as assisting with social services as needed.  A community survey with UDAP of Columbia University will be used to plan additional housing and commercial revitalization."
    },
    {
      "county": "Bronx County",
      "service_area": "FORDHAM-BEDFORD",
      "name": "Fordham Bedford Housing Corporation",
      "website url": "http://www.fordham-bedford.org",
      "phone no.": "(718) 367-3200",
      "contact person": "JOHN M. REILLY",
      "service area": "FORDHAM-BEDFORD",
      "address": "2751 GRAND CONCOURSE BRONX, NY 10468",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=146",
      "email": "rviera@fbhcnet.org",
      "description": "Fordham Bedford Housing Corporation was created in 1980 by community leaders to combat prevalent housing deterioration and abandonment spreading from the South Bronx.  Its mission has always been to improve its Bronx community by providing community-run housing that is safe, sound, and affordable.  Presently, the housing corporation is providing assistance to tenants in more than 70 community-run apartment buildings and to tenants and owners of privately run buildings. Altogether, it serves and assists more than 2000 low-income households annually. To make housing safe, sound, and affordable, the housing corporation assists with building security, energy efficiency, tax exemptions, controlling water charges, providing low-interest repair loans, obtaining rental subsidies, resolving code violations, and addressing lead paint issues.  In addition to housing concerns, the Housing Corporation sponsors and supports youth activities, creates and maintains recreational space, sponsors programs for new immigrants, fights for increased security and city services, and provides meeting space for numerous community improvement activities."
    },
    {
      "county": "Bronx County",
      "service_area": "CROTONA PARK EAST",
      "name": "Mbd Community Housing Corporation",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Bronx County",
      "service_area": "GRAND CONCOURSE",
      "name": "Mid-Bronx Senior Citizens Council, Inc.",
      "website url": "",
      "phone no.": "(718) 588-8200",
      "contact person": "JEANETTE PURYEAR",
      "service area": "GRAND CONCOURSE",
      "address": "900 GRAND CONCOURSE BRONX, NY 10451",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=182",
      "email": "mbsccgen@aol.com",
      "description": "The Mid-Bronx Senior Citizens Council, Inc. (MBSCC) continues to provide service required by residents of the community. MBSCC has identified the provision of quality job development/job placement as one of the greatest service needs of our residents. MBSCC's Job Resource Center has two full time employees and an additional Job/Business Development position was funded. As more community residents become employed, the need for child care service have greatly increased.  MBSCC has been able to increase child care service by securing funding from the Board of Education for the provision of Universal Pre-Kindergarten services to 80 children.  This program began in September of 1999.  Also four new day care classrooms have been completed that will house a total of 68 children.  Additional funding has been secured from the NYC Board of Education to provide Universal Pre-Kindergarten to serve 56 children. During the past three years,  MBSCC has involved community residents through it's Neighborhood Advisory Council (NAC) in negotiating with NYC Department of Design Construction for the construction of a community friendly Bronx Supreme Court building.  As a result of the negotiating, a High School of Law and Justice and a day care center for 140 children will be built adjacent to the new Supreme Court Building. The construction of the Family Preservation Center (FPC) at the Andrew Freedman Home is near completion.  The FPC will house a number of programs offering job development, social services, day care, pediatric serviced, etc. to community residents.  Also, a number of other social service agencies will be housed at the FPC on a rotating basis to ensure that the greatest variety of services can be provided to community residents. The provision  of qualify housing to community residents of Bronx Planning #4 continues to be a very important goal of MBSCC."
    },
    {
      "county": "Bronx County",
      "service_area": "MORRISANIA",
      "name": "Morrisania Revitalization Corporation, Inc.",
      "website url": "",
      "phone no.": "(718) 589-7858",
      "contact person": "CLAUDIA NESBETT",
      "service area": "MORRISANIA",
      "address": "576B E 165TH ST BRONX, NY 10456",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=185",
      "email": "cnisbett.mrcmlkbx@verizon.net",
      "description": "Morrisania Revitalization Corporation (MRC) is a community housing development organization founded almost 20 years ago to develop programs and activities designed to enhance the quality of life for the residents of the Morrisania community.  MRC's primary goals are to improve housing and economic opportunities within the community and to provide supportive social services where needed.  MRC's programs include marketing for the City Home - South Bronx program, operating the Ella Baker/Cleveland Robinson Leadership Academy, and  the Peace Academy Tutorial Program.  MRC also provides technical assistance to the Harriet Tubman Charter School.  Working closely with Community Board 3, MRC provides a comprehensive array of programs and services to the community including  research and planning, housing management, tenant/homeowner assistance, loan/grant application assistance, youth education and leadership development, and housing rehab/development."
    },
    {
      "county": "Bronx County",
      "service_area": "MOUNT HOPE",
      "name": "Mount Hope Housing Co, Inc.",
      "website url": "http://www.mounthopehousing.org",
      "phone no.": "(718) 299-2051",
      "contact person": "JEAN FRITZ",
      "service area": "MOUNT HOPE",
      "address": "2003-05 WALTON AVE BRONX, NY 10453",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=741",
      "email": "fritz_jean@mounthopehousing.org",
      "description": "Mount Hope Housing Company is a community development corporation with affordable housing expertise at its beginnings and a strong track record of multifaceted service delivery.  The mission of the Mount Hope Housing Company, Inc. is to revitalize the communities served by providing safe, decent, affordable housing, economic development, youth, human and educational services.   Since 1986, Mount Hope has been in the \"business\" of community development stemming from a commitment to the South Bronx that has generated sustainable structures for physical space, personal development, and economic regeneration that nurture and grow with community need.  Created, led, and driven by community interests, Mount Hope has responded to the needs of a challenged community through a $100 million investment in real estate development, program management, and initiatives for area families.  For 19 years, Mount Hope has operated with the conviction that quality, safe housing lends to household stability; stable households with opportunities for employment, financial management and wealth building tools are less prone to incidence of family crisis; household strife kept at bay lends to a sense of possibility beyond a family's current circumstance - for both adult caregivers and their children.  Multifaceted in its programs for low-income residents, Mount Hope offers a number of opportunities for families with one integrated objective - to bring high-level resources where they are needed most.  This objective is among the organization's highest priorities."
    },
    {
      "county": "Bronx County",
      "service_area": "MORRISANIA/HIGH BRIDGE",
      "name": "Neighborhood Association For Intercultural Affairs",
      "website url": "",
      "phone no.": "(718) 538-3344",
      "contact person": "EDWARDO LAGUERRE",
      "service area": "MORRISANIA/HIGH BRIDGE",
      "address": "SUITE 1B 1075 GRAND CONCOURSE BRONX, NY 10452",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=194",
      "email": "naica981@cs.com",
      "description": "The overall mission of the Neighborhood Association for Inter-Cultural Affairs, Inc. (NAICA) is dedicated to the economic, social and cultural resurgence of our Bronx neighborhoods. We seek to serve as a catalyst for self-realization that transforms and uplifts the lives of community residents. NAICA was founded on the principle that people need an affordable solution to dealing with their housing problems. Our goal is to build and maintain affordable housing, to provide housing mediation and legal representation to low income area tenants, to help residents become active and contributing citizens, and to provide educational-cultural programs aimed at bringing together the myriad of cultures that make up the Bronx. It is our objective to create an environment in our community that engages us in partnerships with residents, business leaders, and elected governmental officials in the creation of a living environment that is safe, nurturing, and affordable to low and moderate income individuals and families."
    },
    {
      "county": "Bronx County",
      "service_area": "WILLIAMSBRIDGE",
      "name": "Neighborhood Housing Services Of North Bronx, Inc.",
      "website url": "",
      "phone no.": "(718) 881-1180",
      "contact person": "OSCAR J. MORILLO",
      "service area": "WILLIAMSBRIDGE",
      "address": "2ND FLOOR 1451 E GUNHILL RD BRONX, NY 10469",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=192",
      "email": "oscar_morillo@nhsnyc.org",
      "description": "Neighborhood Housing Services of the North Bronx, Inc.,  is a not for profit community housing/development corporation created with the purpose of stimulating reinvestment in the North Bronx's neighborhoods and to stop redlining practices of the 1980s against homeowners and residents of our community who were predominantly Latinos and African American. Today, we continue to facilitate lending for low and moderate income residents, provide homeownership  education, counseling and affordable housing development opportunities.  As as ressult"
    },
    {
      "county": "Bronx County",
      "service_area": "NORTHEAST BRONX",
      "name": "Neighborhood Initiatives Development Corp.",
      "website url": "http://www.nidcny.org",
      "phone no.": "(718) 231-9800",
      "contact person": "WILLIAM FOSTER",
      "service area": "NORTHEAST BRONX",
      "address": "2523 OLINVILLE AVE BRONX, NY 10467",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=195",
      "email": "wfoster@nidcny.org",
      "description": "Neighborhood Initiatives Development Corporation (N.I.D.C.) is a non-profit organization that was formed in 1982 to stabilize the neighborhoods within Bronx Community Board 11 and to ensure the provision of safe, decent, affordable housing for low to moderate income residents.  N.I.D.C. has grown as an agency and now has an annual budget of more than $900,000, which comes from both government and private sources.  Our services have expanded to include commercial revitalization, job readiness, and a full range of youth programs.  N.I.D.C.'s housing services include assistance to individual tenants, organizing of tenant associations, helping with loans and subsidy programs, informational workshops and newsletters for tenants and building owners, and addressing crime problems and quality of life issues in apartment buildings and throughout the community."
    },
    {
      "county": "Bronx County",
      "service_area": "NORTHWEST BRONX",
      "name": "Northwest Bronx Community & Clergy Coalition",
      "website url": "http://www.northwestbronx.org",
      "phone no.": "(718) 584-0515",
      "contact person": "CLAY SMITH",
      "service area": "NORTHWEST BRONX",
      "address": "103 E 196TH ST BRONX, NY 10468",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=202",
      "email": "clay@northwestbronx.org",
      "description": "Northwest Bronx Community and Clergy Coalition (NWBCCC) is a coalition of 10 neighborhood-based organizations in the Northwest Bronx.  The NWBCCC was formed in 1984. The chief services provided by the Coalition and its affiliates are organizing assistance to parents of school children, tenants, community residents through our Safe Streets program, and to students through the Youth Program.  NWBCCC works on area-wide campaigns that benefit the community.  Combating school overcrowding is our most important such campaign at the moment.  The Education Committee's work contributed to the opening of seven new school buildings last fall.  Other current activities include working to keep the North Central Bronx Hospital from reducing its services or even closing; fighting the location of the federally mandated water filtration plant in Van Cortlandt Park; and working for the implementation of \"community policing\" in cooperation with the police leadership in the Northwest Bronx."
    },
    {
      "county": "Bronx County",
      "service_area": "HUNTS POINT/ALDUS/LONGWOOD",
      "name": "South East Bronx Community Development Corp.",
      "website url": "http://www.sebcodevelopment.org",
      "phone no.": "(718) 617-2800",
      "contact person": "JOHN CALDERONE",
      "service area": "HUNTS POINT/ALDUS/LONGWOOD",
      "address": "885 BRUCKNER BLVD BRONX, NY 10459",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=221",
      "email": "jcalderone@sebcodevelopment.org",
      "description": "The South East Bronx Community Organization (SEBCO) was formed in the fall of 1968, under the visionary leadership of Father Louis R. Gigante. The mission of SEBCO is to provide both affordable housing and to improve the quality of life for the residents of Hunts Point. SEBCO works with urban planners and political leaders to develop schools, recreational facilities, and to redevelop the infrastructure, in order to pave the way for the reinvigoration of the neighborhood's housing stock. Through its development efforts, SEBCO has obtained extensive experience undertaking renovation and rehabilitation work in occupied multi-family buildings and is consistently recognized as one of New York City's top subsidized housing developers.  While the majority of the housing developed has been for low-income families, seniors and the formerly homeless, SEBCO also sponsors the construction and renovation of private houses, coops, and condos. As of June 2000, SEBCO has been involved in the creation of 63 apartment buildings and 358 private homes, coops, and condos. This represents a total of 2,991 housing units. Close to 3,000 families are living in permanent housing that SEBCO has developed over the past 32 years. SEBCO's focus is not limited to physical housing but in improving all aspects of the community. We provide over 130 hot meals in our Department for the Aging sponsored senior center; our computer learning center prepares community residents for the workplace. Over 2,000 residents receive our newsletter six times per year. Five after-school programs provide tutoring for over 80 children. Another social service mission of SEBCO Development is to provide quality transitional housing for homeless families. SEBCO operates two TIER II shelters composed of 96 units for New York City Department of Homeless Services. An important goal is not only providing temporary housing for the homeless, but locating quality permanent housing and preparing families for that important next step."
    },
    {
      "county": "Bronx County",
      "service_area": "COMMUNITY DISTRICTS 5 & 7",
      "name": "West Bronx Housing And Neighborhood Resources Center, Inc.",
      "website url": "",
      "phone no.": "(718) 798-0929",
      "contact person": "SALLY BARKER DUNFORD",
      "service area": "COMMUNITY DISTRICTS 5 & 7",
      "address": "220 E 204TH ST BRONX, NY 10467",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=251",
      "email": "sdunford15@aol.com",
      "description": "West Bronx Housing and Neighborhood Resource Center (WBHNRC) provides technical assistance to owners and tenants in the north west quadrant of the Bronx.  A small agency, dedicated to making change one tenant or owner at a time, WBHNRC views itself as neither pro-tenant or pro-owner, but rather as a problem-solver.  The agency approaches each situation as unique and consciously tailors solutions to individual problems utilizing a wide menu of proven tactics and strategies, ranging from (and beginning with) a friendly phone call to court action."
    },
    {
      "county": "Erie County",
      "service_area": "BLACK ROCK/RIVERSIDE/GRANT-AMHERST",
      "name": "Black Rock-Riverside Neighborhood Housing Services, Inc.",
      "website url": "http://www.brrnhs.org",
      "phone no.": "(716) 877-3910",
      "contact person": "WILLIAM BUZAK",
      "service area": "BLACK ROCK/RIVERSIDE/GRANT-AMHERST",
      "address": "203 MILITARY RD BUFFALO, NY 14207",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=112",
      "email": "bbuzak@brrnhs.org",
      "description": "Black Rock-Riverside Neighborhood Housing Services (NHS) is a non-profit lender and developer dedicated to improving the housing, commercial districts, and public spaces in the Black Rock and Riverside neighborhoods.  NHS is a HUD-certified counseling agency  NHS provides financing for home improvements to households who cannot qualify for conventional financing, counsels and assists renters who wish to become home owners, and provides affordable housing to those who wish to rent. NHS provides assistance to small businesses who wish to locate or expand in the area. NHS acquires and  develops properties that private investors shun, and coordinates efforts to enhance public facilities that enrich the neighborhood.  Whenever possible NHS undertakes civic projects that enhance the quality of life and resident pride in our neighborhoods.  An urban park (approx 15,000 sq ft) to serve as a gateway to the Black Rock neighborhood was developed, and previous projects include a little league football field in the Riverside neighborhood."
    },
    {
      "county": "Erie County",
      "service_area": "FILLMORE",
      "name": "Broadway-Fillmore Neighborhood Housing Services Inc.",
      "website url": "http://www.780fillmore.org",
      "phone no.": "(716) 852-3130",
      "contact person": "STEPHEN KARNATH",
      "service area": "FILLMORE",
      "address": "780 FILLMORE AVE BUFFALO, NY 14212",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=113",
      "email": "skarnath@780fillmore.org",
      "description": "Broadway-Fillmore NHS serves three housing populations - the renter, homeowner, and the prospective homeowner.  This three-pronged approach targets low-to-moderate income persons and assures that the housing needs of the Fillmore Councilmatic District are addressed.  BFNHS accomplishes this through the use of its Revolving Loan Fund, Mortgage Fund, and other available resources i.e., Affordable Housing Corporation, the City of Buffalo, and DHCR."
    },
    {
      "county": "Erie County",
      "service_area": "DELEVAN-GRIDER",
      "name": "Citizens Alliance, Inc.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Erie County",
      "service_area": "EMSLIE-JOHNSON",
      "name": "Ellicott District Community Development, Inc.",
      "website url": "",
      "phone no.": "(716) 856-3262",
      "contact person": "ERMA BROWN",
      "service area": "EMSLIE-JOHNSON",
      "address": "644 WILLIAM ST BUFFALO, NY 14206",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=141",
      "email": "ellicottcdc644@aol.com",
      "description": "Ellicott District Community Development, Inc. (EDCD) was formed in 1973 to advance the cause of affordable housing and neighborhood revitalization.   The overall  mission of EDCD is to  stabilize the neighborhoods it serves by increasing home ownership opportunities; promoting  home improvement efforts for owner occupants; and empowering residents to get involved.  A strong and healthy community is one which: looks appealing; has decent affordable housing; has potential for growth; values neighborhood owned enterprises and initiatives; and is a place where people feel safe and want to raise a family.  EDCD provides services to four distinct areas: Emslie/Johnson Neighborhood Statistical Area (NSA; Pratt/Willert NSA; Fruitbelt NSA; and Cold Spring NSA.  These neighborhoods (with special regards to Emslie/Johnson) contain the oldest housing stock in the City.   The  demolition of the existing housing stock and the large number of absentee owners continues to be a major hurdle in stabilizing the community.  Although Ellicott NSA has seen an increase in new housing over the past few years, the existing housing stock continues to be in various stages of deterioration and in great need of repair.  The Ellicott District continues to rank among the lowest on all social and economic scales, with incomes for the residents far below the county and city median."
    },
    {
      "county": "Erie County",
      "service_area": "FILLMORE-LEROY",
      "name": "Fillmore-Leroy Area Residents, Inc.",
      "website url": "",
      "phone no.": "(716) 838-6740",
      "contact person": "WENDY H. ANDERSON",
      "service area": "FILLMORE-LEROY",
      "address": "307 LEROY AVE BUFFALO, NY 14214",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=143",
      "email": "cpa898@hotmail.com",
      "description": "Fillmore-Leroy Area Residents, Inc. (FLARE)  was established by concerned residents in the Fillmore-Leroy area of Buffalo over 20 years ago.  Its services are focused both on housing and human service issues.  As a result of their efforts, FLARE was able to establish the following: 17 rental units that are available to low income people, home improvement grants and low interest loans for low income residents, an acquistion rehabilitation sale program, beautification projects, new construction projects, a food pantry, senior nutrition program, senior transportation, and youth services program. Recently, FLARE was awarded additional funds from the Federal Home Loan Bank of New York to provide subsidies for the acquisition rehabilitation sale program and funds from the NYS Affordable Housing Corporation to increase the pool of funds available for home improvements."
    },
    {
      "county": "Erie County",
      "service_area": "DOWNTOWN AREA, NEAR EAST SIDE, & LOWER WEST SIDE OF BUFFALO",
      "name": "Heart Of The City Neighborhoods, Inc.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Erie County",
      "service_area": "LOWER WESTSIDE",
      "name": "Hispanos Unidos De Buffalo, Inc.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Erie County",
      "service_area": "FIRST AND SECOND WARDS",
      "name": "Lackawanna Housing Development Corporation",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Erie County",
      "service_area": "BROADWAY-FILLMORE",
      "name": "Lt. Col. Matt Urban Human Services Center Of Wny",
      "website url": "http://www.urbanctr.org",
      "phone no.": "(716) 893-7222",
      "contact person": "MARLIES WESOLOWSKI",
      "service area": "BROADWAY-FILLMORE",
      "address": "1081 BROADWAY BUFFALO, NY 14212",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=211",
      "email": "lvishwanath@urbanctr.org",
      "description": "The Center provides a wide range of services to the population of the Broadway Fillmore District of the East Side of Buffalo."
    },
    {
      "county": "Erie County",
      "service_area": "SOUTH BUFFALO",
      "name": "Neighborhood Housing Services Of South Buffalo, Inc.",
      "website url": "http://www.nhssouthbuffalo.org",
      "phone no.": "(716) 837-0071",
      "contact person": "SHYRL L. DUDERWICK",
      "service area": "SOUTH BUFFALO",
      "address": "1937 SOUTH PARK AVE BUFFALO, NY 14220",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=190",
      "email": "info@nhssouthbuffalo.org",
      "description": "Neighborhood Housing Services of South Buffalo, Inc. provides financial assistance to homeowners for rehabilitation; financing for commercial facades; weatherization programs; and supporting fiscal services for neighborhood block clubs and faith based initiatives."
    },
    {
      "county": "Erie County",
      "service_area": "ALL CATTARAUGUS CO., SOUTHERN ERIE, SOUTHWESTERN WYOMING",
      "name": "Neighborworks Home Resources",
      "website url": "http://www.nwhomeresources.org",
      "phone no.": "(716) 373-4100",
      "contact person": "DAVID TRENT",
      "service area": "ALL CATTARAUGUS CO., SOUTHERN ERIE, SOUTHWESTERN WYOMING",
      "address": "209 NORTH UNION ST OLEAN, NY 14760",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=413",
      "email": "dgtrent@nwhomeresources.org",
      "description": "Rural Revitalization Corporation is a community-based not for profit dedicated to the mission of providing clean, safe, affordable housing for the residents of Cattaraugus County and the Towns of Collins, Concord, and Sardinia in Erie County and the Towns of Java and Arcade in Wyoming County. Rural Revitalization Corp. offers programs in home buyer education, homeownership counseling, affordable rental units, low-interest home rehabilitation loans, and mortgage assistance through a network of lenders and our Revolving Loan Fund."
    },
    {
      "county": "Erie County",
      "service_area": "OLD FIRST WARD",
      "name": "Old 1St Ward Community Association, Inc.",
      "website url": "",
      "phone no.": "(716) 856-8613",
      "contact person": "LAURA KELLY LAWTON",
      "service area": "OLD FIRST WARD",
      "address": "62 REPUBLIC ST BUFFALO, NY 14204",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=541",
      "email": "lkelly@old1stward.org",
      "description": "The Old 1st Ward Community Association offers the following:  owner occupied rehab, first time homebuyer assistance, acquisition/rehab/resale, new single family construction, senior rental units at the Buffalo River Apartments, commercial/economic development activities, Housing Court Assistance, drug/crime prevention programs, neighborhood beautification programs, ongoing strategic planning initiatives."
    },
    {
      "county": "Erie County",
      "service_area": "SOUTH ERIE COUNTY",
      "name": "Southtowns Rural Preservation Company, Inc.",
      "website url": "",
      "phone no.": "(716) 941-5787",
      "contact person": "KAREN M. DIEMUNSCH",
      "service area": "SOUTH ERIE COUNTY",
      "address": "153 9441 BOSTON STATE RD BOSTON, NY 14025",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=324",
      "email": "southtownsrpc@aol.com",
      "description": "Southtowns Rural Preservation Company, Inc. is a local, non-profit community development corporation serving the rural towns and villages of Southern Erie County.  The SRPC has established a core of basic services available to eligible residents within the service area.  These services include loan and grant application assistance, housing rehabilitation, and housing counseling and referral services. The long term goals of the corporation are to effect a stabilizing influence in the communities served through the rehabilitation of individual housing units and the coordination and/or delivery of supporting services."
    },
    {
      "county": "Erie County",
      "service_area": "WEST SIDE",
      "name": "West Side Neighborhood Housing Services, Inc.",
      "website url": "http://www.wsnhs.org",
      "phone no.": "(716) 885-2344",
      "contact person": "LINDA CHIARENZA",
      "service area": "WEST SIDE",
      "address": "359 CONNECTICUT ST BUFFALO, NY 14213",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=796",
      "email": "lchiarenza@wsnhs.org",
      "description": "West Side Neighborhood Housing Services, Inc. is a non-profit lender dedicated to promoting home ownership, improving the housing stock, and addressing quality of life issues in the City of Buffalo, west of Main Street through our agency and various collaborations.  Due to the increased demand for our services, we have signed Memorandum of Understanding (MOU) with housing agencies outside of our immediate area.  They include but are not limited to Heart of the City and Hispanics United of Buffalo.  Under this agreement, their staff does the application intake and we underwrite and fund the loan. WSNHS is also administering a $485,000.00 grant from the Federal Home Loan Bank for exterior repairs thru out the City.  We have received numerous requests for partner loans to complete projects. For example, if a roof needs repair and the maximum grant is $4,850.00, but the cost of the repair is $8,000.00, we are funding the difference from our NeighborWorks® America revolving loan fund. These loans have been extended throughout the City limits. West Side Neighborhood Housing Services, Inc. is a HUD certified counseling agency, and we are the only agency certified to give secondary financing to FHA mortgages. Our homeownership education prepares potential first-time home buyers with classes explaining the process of obtaining a mortgage and how to avoid predatory lenders. We offer credit counseling to correct outstanding financial issues that may hinder their getting a conventional mortgage. We also provide technical advice and rehabilitation loans to encourage families to stay in their homes. West Side Neighborhood Housing Services, Inc. does this by inspecting the property and then processing a loan application. The loan would cover any and all City of Buffalo building code violations. On a smaller scale, we have instituted a Minor Home Repair program. The guidelines for this program are that the homeowner purchases the supplies and we pay a repair person to do the labor. West Side Neighborhood Housing Services, Inc. also has an Emergency Program to address an immediate need such as a broken furnace or water line. Due to a lack of funding, we no longer offer a security program. We are aggressive in offering first mortgages to families that are working to become homeowners, but their credit scores are too low, or the value of the house is not enough to go to a regular lending institution. Our Executive Director is still an active member of the Save Our Streets Committee to help rid absentee landlord properties of drug activity."
    },
    {
      "county": "Kings County",
      "service_area": "CONEY ISLAND",
      "name": "Astella Development Corporation",
      "website url": "http://www.astelladevelopment.org",
      "phone no.": "(718) 266-4653",
      "contact person": "JUDITH ORLANDO",
      "service area": "CONEY ISLAND",
      "address": "1618 MERMAID AVE BROOKLYN, NY 11224",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=106",
      "email": "astellaci@aol.com",
      "description": "Astella Development Corporation is dedicated to providing affordable housing, commercial revitalization and economic development, and to improving the quality of life in Coney Island, Brooklyn.  Astella was established in 1975 by concerned tenants, landlords and dedicated residents whose primary goal was to stem the tide of neighborhood deterioration. Astella offers the following services: assist potential home buyers in purchasing a house; inform homeowners and landlords of loan programs; market affordable single family homes; work with homeowners  associations; coordinate educational workshops; counsel tenants and landlords; prepare tenants and landlords for housing court; mediate between tenants and landlords; assist with Housing Authority, HEAP, and SCRIE applications; assist in filing DHCR complaint forms; provide social service referrals; rehabilitate properties; publish home ownership booklet on how to buy a house; coordinate business seminars and promotion; provide technical assistance to merchants; work with the Coney Island Board of Trade; assist potential and established business owners; construct retail space; post job opportunities; type and fax resumes; market mixed use buildings; interface with the city agencies; organize community events; publish community newsletter; publish Coney Island Service Directory."
    },
    {
      "county": "Kings County",
      "service_area": "BRIGHTON BEACH",
      "name": "Brighton Neighborhood Association Inc.",
      "website url": "http://www.brightonbeach.com",
      "phone no.": "(718) 891-0800",
      "contact person": "PAT SINGER",
      "service area": "BRIGHTON BEACH",
      "address": "1121 BRIGHTON BEACH AVE BROOKLYN, NY 11235",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=9",
      "email": "bnapsinger@aol.com",
      "description": "The Brighton Neighborhood Association (BNA) evolved from a grassroots movement to declare war against neighborhood deterioration. Since 1979, BNA has been instrumental in expediting the assimilation of multiple immigrant populations through advocacy and education. Current activities include tenant advocacy, crime prevention, encouragement of commercial revitalization, and advocacy for all segments of the Brighton community."
    },
    {
      "county": "Kings County",
      "service_area": "OCEAN PARKWAY/MIDWOOD JUNCTION",
      "name": "Brooklyn Housing And Family Services, Inc.",
      "website url": "http://brooklynhousing.org",
      "phone no.": "(718) 435-7585",
      "contact person": "LARRY JAYSON",
      "service area": "OCEAN PARKWAY/MIDWOOD JUNCTION",
      "address": "415 ALBEMARLE RD BROOKLYN, NY 11218",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=30",
      "email": "carol@brooklynhousing.org",
      "description": "The mission of Brooklyn Housing & Family Services is:"
    },
    {
      "county": "Kings County",
      "service_area": "CROWN HEIGHTS/PROSPECT HEIGHTS",
      "name": "Brooklyn Neighborhood Improvement Association Inc.",
      "website url": "",
      "phone no.": "(718) 773-4116",
      "contact person": "YAHYA O. RAJI",
      "service area": "CROWN HEIGHTS/PROSPECT HEIGHTS",
      "address": "ROOM #1F 1482 ST JOHNS PL BROOKLYN, NY 11213",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=925",
      "email": "raj162@juno.com",
      "description": "Brooklyn Neighborhood Improvement Association, Inc. (BNIA) is a 501 (c) (3) neighborhood preservation organization dedicated to serving the housing and community development needs of residents and businesses in Central Brooklyn and East New York.  The organization was founded in 1978 by community residents, merchants and church leaders in an effort to save the neighborhood from decay and destruction.  BNIA is a certified United States Department of Housing and Urban Development (HUD) counseling agency and promotes home ownership in Community Boards #8 and #16.  The need for safe, decent affordable housing is critical for the community area which BNIA serves.  BNIA currently provides housing counseling, housing development and other community development services for residents of Central Brooklyn.   Most of the clients served have household incomes below 60 percent of the area median household income.  BNIA brings together public and private sectors to produce efficient management systems for this large resource of publicly-owned housing."
    },
    {
      "county": "Kings County",
      "service_area": "REDHOOK/CARROLL GARDENS/COLUMBIA STREET/WATERFRONT",
      "name": "Carroll Gardens Association, Inc.",
      "website url": "http://www.carrollgardensassociation.com",
      "phone no.": "(718) 243-9301",
      "contact person": "VILMA HERAMIA",
      "service area": "REDHOOK/CARROLL GARDENS/COLUMBIA STREET/WATERFRONT",
      "address": "201 COLUMBIA ST BROOKLYN, NY 11231",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=122",
      "email": "vvheramia@carrollgardensassociation.com",
      "description": "In May, 1971 the Carroll Gardens Association, Inc. (CGA) was incorporated as a not-for-profit organization to assist the disadvantaged regardless of race or religion and to create a spirit of community. The new not-for-profit began by leveraging federal and state funds into the community and developing service programs in education, cultural awareness, employment counseling and job placement. CGA has developed programs that have addressed the needs of the working class neighborhoods of South Brooklyn. Programs benefitting low- and moderate-income individuals and families include landlord/tenant counseling and assistance in filing applications for assisted housing (Section 8 and Housing Authority.) CGA offers assistance and technical services to small property owners and rehabilitation funds for property management. When Carroll Gardens began experiencing its first wave of gentrification, they began to explore the need for affordable housing to ease displacement of long time residents because of exorbitant rent increases. CGA is the recipient of two John Heinz Neighborhood Demonstration Program Awards totaling $125,000. This award has a highly competitive application process and is funded through HUD. CGA is funded yearly by the Department of Youth and Community Development to operate an after school computer training program. Collaborative work with other non-profits and community groups includes projects with the Enterprise Foundation, National Equity Fund, National Low Income Housing Coalition, National Puerto Rican Coalition and the Statewide Hispanic Corp. CGA is rehabilitating and refurbishing 62 units of housing in Red Hook and developing a HomeWork housing program."
    },
    {
      "county": "Kings County",
      "service_area": "BOROUGH PARK",
      "name": "Community Organization Of Southern Brooklyn, Inc.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Kings County",
      "service_area": "CROWN HEIGHTS",
      "name": "Crown Heights Jewish Community Council, Inc.",
      "website url": "http://www.chcentral.org",
      "phone no.": "(718) 771-9000",
      "contact person": "RABBI ELI COHEN",
      "service area": "CROWN HEIGHTS",
      "address": "392 KINGSTON AVE BROOKLYN, NY 11225",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=22",
      "email": "ecohen@chjcc.org",
      "description": "Crown Heights Jewish Community Council (CHJCC) is a private, nonprofit social service agency serving one of the most diverse and challenging neighborhoods in New York City. The agency was formed in 1969 in response to deteriorating social and economic conditions in the neighborhood. The population of the 116-city block cache area known as Crown Heights is comprised of persons of many cultures and includes new immigrants.  According to the 1990 census, incomes tend to be low - often below poverty levels.  Housing is mostly old (circa 1900 - 1930) and at a premium. CHJCC administers programs, advocates for clients, and provides referrals on issues of housing, employment, economic development, entitlements, problems of the aging, aid to crime victims, assistance for indigent residents. CHJCC has created multi-racial, faith, and community-based programs such as Project Care, which unites civic and religious leaders from every segment of the community in a funded program to promote efforts in social and economic development. Creative initiatives such as Project Care have addressed areas of common concern, and new avenues of communication and cooperation have emerged. One of the major goals of the CHJCC is to promote an atmosphere of understanding and cooperation in the community.  Areas of common concern, including housing, poverty, crime, employment, education and economic development, are being addressed through new programs."
    },
    {
      "county": "Kings County",
      "service_area": "CYPRESS HILLS/HIGHLAND",
      "name": "Cypress Hills Local Development Corporation",
      "website url": "http://www.cypresshills.org",
      "phone no.": "(718) 647-2800",
      "contact person": "MICHELLE NEUGEBAUER",
      "service area": "CYPRESS HILLS/HIGHLAND",
      "address": "625 JAMAICA AVE BROOKLYN, NY 11208",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=136",
      "email": "michellen@cypresshills.org",
      "description": "Cypress Hills Local Development Corporation (CHLDC) provides comprehensive housing counseling and development, youth and human services, and economic development programs to the low and moderate income community of Cypress Hills in northeast Brooklyn.  CHLDC serves over 7,000 residents annually through its multi-faceted programming.  Housing counseling services offered include: mortgage counseling, tenant organizing, fire safety education, home repair loan packaging, and mortgage foreclosure prevention.  The organization has developed 200 units of affordable housing and a day care center.  CHLDC is also working towards the development of a mini-mall on the neighborhood shopping street and a community-owned school building."
    },
    {
      "county": "Kings County",
      "service_area": "EAST NEW YORK",
      "name": "East New York Urban Youth Corps Inc.",
      "website url": "",
      "phone no.": "(718) 922-2229",
      "contact person": "ROMEO LAZARRO",
      "service area": "EAST NEW YORK",
      "address": "539 ALABAMA AVE BROOKLYN, NY 11207",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=602",
      "email": "romeolazarro@usa.com",
      "description": "East New York Urban Youth Corps, Inc. ( ENYUYC ) was established in 1987 to promote and facilitate neighborhood controlled revitalization, growth, development, and empowerment in East New York. ENYUYC is involved in construction, development, and management of affordable housing, youth programs,  crime prevention programs, social services programs, and ENYUYC acts as a springboard for employment capacitation and training for under-served residents( i.e the youth and very low income head of households). ENYUYC  has completed 12 construction development projects resulting in the creation of 583 units of affordable housing.  Currently ENYUYC manages over 650 units of affordable housing in 70 buildings, including a Tier II shelter. In addition, ENYUYC has a resident advocacy and tenant organizing component. The Youth Development Program consists of after-school programs, the PACT - ( Police and Community Together ) truancy program, and summer camp program.  Our major sources of funding are: NYS - DHS, Department of Justice, DHCR, Development Fees, other government agencies, and private fund raising."
    },
    {
      "county": "Kings County",
      "service_area": "EAST FLATBUSH",
      "name": "Erasmus Neighborhood Federation, Inc.",
      "website url": "",
      "phone no.": "(718) 462-7700",
      "contact person": "YVES VILUS",
      "service area": "EAST FLATBUSH",
      "address": "814 ROGERS AVE BROOKLYN, NY 11226",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=26",
      "email": "yves.vilus@erasmusfederation.org",
      "description": "Our organization has in place a two-year outside-funded self-development program to reinforce our community organizing capability-and as part of this funded effort we have been conducting community outreach to identify problems and opportunities for future effort.  These efforts give us a new, broader means of continual community assessment."
    },
    {
      "county": "Kings County",
      "service_area": "LOWER PARK SLOPE",
      "name": "Fifth Avenue Committee, Inc.",
      "website url": "http://www.fifthave.org",
      "phone no.": "(718) 237-2017",
      "contact person": "MICHELLE DE LA UZ",
      "service area": "LOWER PARK SLOPE",
      "address": "621 DEGRAW ST BROOKLYN, NY 11217",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=28",
      "email": "mdelauz@fifthave.org",
      "description": "Fifth Avenue Committee, Inc. (FAC) is a not-for-profit, community-based organization in lower Park Slope and South Brooklyn. Our mission is to advance social and economic justice in South Brooklyn, principally by developing and managing affordable housing, creating employment opportunities, organizing residents and workers, and combating displacement caused by gentrification. Our programs in the area of housing include: developing, managing, and preserving affordable housing for lower-income families and helping tenants achieve resident ownership.  In the category of community economic development, we create \"community enterprises\" that provide employment, training, and career development opportunities; help people with job searches; and assist area merchants and entrepreneurs. As organizers and advocates, we help tenants, workers, and residents understand their rights and  how to organize to improve their opportunities.  In the area of criminal justice, our programs help ex-offenders reintegrate into the community through job and housing assistance, counseling, training, and leadership development programs. FAC is funded by over 50 different entities including private foundations, banks, corporations, and local, state, and federal government agencies.  In addition we have over 300 individual donors."
    },
    {
      "county": "Kings County",
      "service_area": "FLATBUSH",
      "name": "Flatbush Development Corp.",
      "website url": "http://www.fdconline.org",
      "phone no.": "(718) 859-3800",
      "contact person": "ROBIN REDMOND",
      "service area": "FLATBUSH",
      "address": "1616 NEWKIRK AVE BROOKLYN, NY 11226",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=29",
      "email": "rredmond@fdconline.org",
      "description": "Flatbush Development Corporation's (FDC) primary mission is to improve the quality of life for all residents of Flatbush. By counseling individual tenants and organizing tenant associations, FDC helps to stabilize the parts of the neighborhood that are dense with apartment buildings. The organization works with low-to-moderate income owners of small homes, providing them with critical information on the importance of proper maintenance and financial planning, ensuring that they remain in their homes as strong, sound homeowners. FDC also reaches out to shareholders in the many troubled, over-leveraged co-operative apartment buildings in Flatbush and works with them to help stabilize management and financial operations of their buildings, explain rights and responsibilities, and teach home maintenance and repair courses. FDC also plays a role in the larger community; facilitating the overall growth and development of the Flatbush community by developing a 5-year strategic plan, in coordination with local residents and government officials to provide workshops, seminars and a regular newsletter about issues of concern to residents. In addition, FDC works to revitalize the area's commercial strips by advocating for filling of vacant commercial space, convincing new businesses to expand or relocate to Flatbush, and by convincing other businesses to remain by advocating on behalf of existing local businesses and working with local merchant associations to improve the business climate on retail strips."
    },
    {
      "county": "Kings County",
      "service_area": "GOWANUS CANAL",
      "name": "Gowanus Canal Community Development Corporation",
      "website url": "http://www.gowanus.org",
      "phone no.": "(718) 858-0557",
      "contact person": "JOSEPH MESSINEO",
      "service area": "GOWANUS CANAL",
      "address": "201 COLUMBIA ST BROOKLYN, NY 11231",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=35",
      "email": "jmessineo@gowanus.org",
      "description": "Gowanus Canal Community Development Corporation of the Carroll Gardens area of Brooklyn was founded in 1979 to provide stable, healthy, and affordable living environments for low and moderate income households.  During the last twenty years, the organization has assisted and sponsored development of several buildings in the community including a 100-unit senior citizen residence. Our most recent project was a 90-unit gut rehab converting a vacant parochial school into below-market rentals. Gowanus Canal CDC performs the following activities: tenant/client assistance, loan program assistance, homeownership counseling, research/outreach, organizational development, and environmental clean-up activities to promote the development of economic, housing, and recreational projects. We have also added a Computer Training Center for single parents recently taken off the welfare rolls."
    },
    {
      "county": "Kings County",
      "service_area": "SHEEPSHEAD BAY",
      "name": "Greater Sheepshead Bay Development Corp.",
      "website url": "",
      "phone no.": "(718) 332-0582",
      "contact person": "ELLEN SUSNOW",
      "service area": "SHEEPSHEAD BAY",
      "address": "2107 EAST 22ND ST BROOKLYN, NY 11229",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=151",
      "email": "gsbdcorp@aol.com",
      "description": "Greater Sheepshead Bay Development Corporation (GSBDC) is a non profit, non-government, 501(c)(3) community based development corporation founded in 1978 who dedicates itself to aid in the development and coordination of programs for the preservation and redevelopment of the Greater Sheepshead Bay area of Kings Country for the purpose of improving the physical, economic and social environment of its geographic area with particular attention to the needs of low and moderate income community residents. GSBDC provides multifaceted services to its communities with areas of responsibility that include home improvement loans, housing exemption applications for tenants, coop and homeowners, commercial revitalization, homeownership education,  foreclosure prevention, senior citizen services and immigrant services."
    },
    {
      "county": "Kings County",
      "service_area": "CROWN HEIGHTS",
      "name": "Ldc Of Crown Heights",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Kings County",
      "service_area": "SOUTHSIDE/WILLIAMSBURG",
      "name": "Los Sures Community Development Company, Inc.",
      "website url": "http://www.lossures.org",
      "phone no.": "(718) 387-3600",
      "contact person": "DAVID D. PAGAN",
      "service area": "SOUTHSIDE/WILLIAMSBURG",
      "address": "213 S 4TH ST BROOKLYN, NY 11211",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=172",
      "email": "ddpagan@aol.com",
      "description": "Los Sures Community Development Company, Inc. also known as Southside United HDFC is a community development corporation serving the Southside of Williamsburg, a predominantly Latin community.  The original impetus came from three Roman Catholic priests who came together in the late 1960's to stop further deterioration of the Southside of Williamsburg.  At that time, entire buildings, even entire blocks of the neighborhood were abandoned, sometimes as a result of suspected arson.  The first work of the largely volunteer organization was to organize tenants to collect their own rent and to run their own buildings.  In 1972 Southside United HDFC was incorporated and in 1979 Los Sures Community Development was incorporated to further the work and goals of the organization."
    },
    {
      "county": "Kings County",
      "service_area": "MIDWOOD",
      "name": "Midwood Development Corp.",
      "website url": "",
      "phone no.": "(718) 376-0999",
      "contact person": "LINDA S. GOODMAN",
      "service area": "MIDWOOD",
      "address": "1416 AVENUE M BROOKLYN, NY 11230",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=183",
      "email": "lgoodman@middev.org",
      "description": "Midwood Development Corporation (MDC) is a multifaceted nonprofit community-based organization.  The agency's mission is to stabilize, develop, and enhance the community by providing a comprehensive range of services for all those who live, work, and shop in the area.  These services include a supported employment program employing more than sixty individuals with developmental disabilities. MDC's commercial revitalization programs aim to promote the local shopping streets. MDC also operates an English As a Second Language (ESL) class.   We also provide general assistance and counseling to New Americans.  In addition, we facilitate the NYC Board of Education's ESL classes at the local high school. With funding from OMRDD and NYC DYCD, MDC provides after-school activities for elementary school youngsters.  GED classes and evening recreational programs for individuals with developmental disabilities are also offered.  MDC also operates the Midwood Youth Council, a community service and leadership training program for junior and senior high school students.  Each year, MDC organizes four community wide events, the Annual J Students Art Show (in collaboration with the Midwood Board of Trade), the Midwood Mardi Gras street fair, Neighborhood Entertainment Day in Kolbert Park, and the MDC Annual Meeting at Murrow H.S."
    },
    {
      "county": "Kings County",
      "service_area": "SUNSET PARK/SOUTH SLOPE",
      "name": "Neighbors Helping Neighbors, Inc.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Kings County",
      "service_area": "EAST FLATBUSH",
      "name": "Nhs Of East Flatbush",
      "website url": "",
      "phone no.": "(718) 469-4679",
      "contact person": "TONYA ORES",
      "service area": "EAST FLATBUSH",
      "address": "2806 CHURCH AVE BROOKLYN, NY 11226",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=187",
      "email": "tonya_ores@nhsnyc.org",
      "description": "Neighborhood Housing Services of East Flatbush, Inc. is a not-for-profit, citywide organization working to:"
    },
    {
      "county": "Kings County",
      "service_area": "GREENPOINT",
      "name": "North Brooklyn Development Corp.",
      "website url": "",
      "phone no.": "(718) 389-4078",
      "contact person": "RICHARD MAZUR",
      "service area": "GREENPOINT",
      "address": "148-50 HURON ST BROOKLYN, NY 11222",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=58",
      "email": "nbdc126@aol.com",
      "description": "North Brooklyn Development Corporation (NBDC), was organized in 1979 by civic and business leaders of Greenpoint for the purpose of promoting neighborhood stability, improving economic climate in the community, and building affordable housing. Guided by this mission and a firm understanding of Greenpoint's needs and character, NBDC has developed a strategy that includes programs in housing development and preservation, commercial and industrial development, and employment and education. NBDC has leveraged millions of dollars of public and private funds; it has worked successfully to establish public-private partnerships in community development; and has cooperated with other community groups and organizations who work to meet similar goals in Greenpoint. The purpose of NBDC's housing program is twofold: to preserve the existing housing stock and promote a stable and invested citizenry in Greenpoint and to develop affordable housing for the area's lowest income residents and through thus induce economic development. The former is achieved through the on-going services for homeowners and tenants that includes securing low-interest property rehabilitation loans; rent regulation education; property management and maintenance; landlord/tenant disputes; affordable housing referrals; and securing other housing entitlements. The latter is addressed by constantly looking for sites and means for developing new affordable housing units for the most needy residents. NBDC has also invested heavily into educating Greenpoint's youngsters. Annual After School Programs are run in five local schools providing warm and structured environment for over 450 children with supplemental tutoring in math and reading, arts& crafts workshops, sports and active recreation. NBDC's Community Achievement Project in Schools (CAPS) confronts truancy in schools, improves students' attendance and develops a closer level of communication between schools and families. Such diversified scope of services in addressing community needs allow NBDC to be a leader and promoter in positive change in Greenpoint community."
    },
    {
      "county": "Kings County",
      "service_area": "OCEANHILL/BROWNSVILLE/CROWN HEIGHTS/BEDFORD STUYVESANT",
      "name": "Northeast Brooklyn Housing Development Corp.",
      "website url": "",
      "phone no.": "(718) 453-9490",
      "contact person": "JEFFREY DUNSTON",
      "service area": "OCEANHILL/BROWNSVILLE/CROWN HEIGHTS/BEDFORD STUYVESANT",
      "address": "132 RALPH AVE BROOKLYN, NY 11233",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=593",
      "email": "jdunston@nebhdco.org",
      "description": "Northeast Brooklyn Housing Development Corporation is a not-for-profit preservation company located in the Stuyvesant Heights Neighborhood of Bedford-Stuyvesant, Brooklyn, New York , serving three Community Boards: 3, 16, and part of 8.  The service's provided are: seminars for homebuyers, tenant/client counseling, tenant organizing, housing and mortgage counseling, vacant lots and garden clean-up, and after-school tutorial programs funded by Banker's Trust and The Enterprise Foundation."
    },
    {
      "county": "Kings County",
      "service_area": "KENSINGTON/OCEAN PARKWAY",
      "name": "Ocean Parkway Community Development Corp.",
      "website url": "",
      "phone no.": "(718) 435-1300",
      "contact person": "TOM BAUER",
      "service area": "KENSINGTON/OCEAN PARKWAY",
      "address": "4006 18TH AVE BROOKLYN, NY 11218",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=66",
      "email": "tbauer@sbcony.org",
      "description": "Ocean Parkway Community Development Corp. (OPCDC) is a grass-roots, multi-ethnic organization incorporated in 1979 to address the deterioration of housing in Kensington and along the Ocean Parkway corridor.  A diverse group of professionals and business people came together to create an agency that would focus its activities on neighborhood stabilization, revitalization, and improvement. The purpose of the Corporation is to aid in the development, rehabilitation, and preservation of local housing and make same available to low and moderate-income families. OPCDC's activities comprise a multi-faceted community-based approach that includes housing development, preservation, strengthening of neighborhoods by developing strong neighborhood associations, and assisting tenants and property owners with a variety of their housing needs."
    },
    {
      "county": "Kings County",
      "service_area": "CLINTON HILL/FORT GREENE",
      "name": "Pratt Area Community Council",
      "website url": "http://www.prattarea.org",
      "phone no.": "(718) 522-2613",
      "contact person": "NAILA MOORE",
      "service area": "CLINTON HILL/FORT GREENE",
      "address": "201 DEKALB AVE BROOKLYN, NY 11205",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=69",
      "email": "naila_moore@prattarea.org",
      "description": "Pratt Area Community Council (PACC) helps residents achieve self-sufficiency, create a sense of community, and realize overall neighborhood stabilization through community organizing; homeowner and tenant services; affordable housing development, commercial revitalization and responsible property management. We offer a wide range of programs designed to ensure that tenants, merchants and homeowners receive the support they need to rehabilitate vacant units, prevent building deterioration, access needed resources and avoid displacement. PACC counsels and mediates between tenants and landlords and organizes tenant and block associations.  As a HUD certified counseling agency, PACC counsels homeowners facing default and foreclosure, provides mortgage counseling, affordable mortgages and workshops to prospective homebuyers, and packages repair loan and grant applications for homeowners and small landlords.  Through our Healthy Homes Initiative, PACC educates tenants, homeowners and small landlords to the dangers of lead poisoning and other environmental hazards in the home.  Our economic development and commercial revitalization efforts on the Fulton Street corridor have brought grant dollars and business retention resources to small merchants, streetscape improvements, and through merchant organizing we have coordinated marketing efforts and led the way to the formation of a Business Improvement District.  Lastly, our affordable housing development provides apartments and homeownership opportunities to low and moderate income residents in the community and our asset and property management preserve and maintain the affordable housing we have produced."
    },
    {
      "county": "Kings County",
      "service_area": "BUSHWICK",
      "name": "Ridgewood Bushwick Senior Citizens Council, Inc.",
      "website url": "http://www.rbscc.org",
      "phone no.": "(718) 366-3800",
      "contact person": "SCOTT SHORT",
      "service area": "BUSHWICK",
      "address": "555 BUSHWICK AVE BROOKLYN, NY 11206",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=76",
      "email": "sshort@rbscc.org",
      "description": "During this contract year,  Ridgewood Bushwick Senior Citizens Council, Inc. has progressed in our activities in several areas. First, we completed a 42-unit new building with HTF LIHTF tax credits. Second, another LIHTF project of 40 units went to closing and construction and neared 50% completion by the end of this contract. Third, we prepared an application for a third such project of 60 units and received notice of credits. Fourth, our Section 202 development of 82 units moved toward a final closing and construction. Finally, we completed rehabilitation of a 35-unit existing building that will preserve its surrounding area. On other fronts, we continued representing tenants and informing them of their legal rights. We also organized our community around a series of alleged arson incidents. We also completed sale of 19 two-family homes and moved forward to market an additional 150 homes."
    },
    {
      "county": "Kings County",
      "service_area": "CENTRAL WILLIAMSBURG/GREEN POINT",
      "name": "St. Nicks Alliance Corp.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "New York County",
      "service_area": "EAST HARLEM AND EL BARRIO",
      "name": "116 Street Block Association, Inc.",
      "website url": "",
      "phone no.": "(212) 860-4100",
      "contact person": "HILDA C. VIVES-VASQUEZ",
      "service area": "EAST HARLEM AND EL BARRIO",
      "address": "55 E 115TH ST NEW YORK, NY 10029",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=94",
      "email": "candy10029@aol.com",
      "description": "116th STREET BLOCK ASSOCIATION, INC. is a nonprofit community based organization located in East Harlem and serving residents of Community Board 11.  The association was organized in 1976 and incorporated under the laws of the State of New York in 1979 by a group of community leaders who were concerned about the negative effects of crime, drugs, lack of employment opportunities, abandonment, poor quality of housing, and bank disinvestment in the area. The Association was created with the view of collaborating in a recuperating strategy for the community; aspiring to develop tenants potential through meaningful workshops in leadership; to organize tenants; secure housing from negligent landlords; promote neighborhood stability; and provide low-income housing. The services and activities are based upon the conviction that in order to effectively control housing problems, the neighborhood residents themselves must become involved. The Association promotes a self-help approach in attending other needs arising from poverty levels characterizing vast sectors of the community. The examination of the issues of the community and the individual person in a holistic way has led to a web of interrelations with other community organizations in order to improve the quality assistance offered to housing, schools, churches, hospitals, police, fire departments and other service providers in the area. The organizational relationship avoids repetitive efforts and economic redundancy. The Association provides independent living skills workshops to the community on various topics such as: Lead Awareness-Local Law 1, management, crime prevention (trespassing program), arson awareness, the operation of tenants associations and health issues.  Through NYC HPD's  Anti-Abandonment Unit- Community Consultant Program, the association offers walk-in services for: case management, counseling services, tenant counseling on apartment maintenance, referrals to suitable housing, employment and education, assistance with applications for Public Housing, Section 8 and Public Assistance, rent arrears application, DRIE (Disability Rent Increase Exempt), Con Edison /Heartshare (grant for individuals who are in distress and in arrears with electrical/gas bill, this program is seasonal), and protecting their legal rights. The association's most recent contract with NYC HPD's Anti-Abandonment Unit as an NPC provides surveys to buildings in housing code violations; assists landlords to get into voluntary repair agreements, repair loans, building maintenance and other programs to be eligible for tax breaks; mediation with both landlord and tenant dispossession and evictions; technical assistance to residents of city owned buildings; and management and financial services assistance to buildings already converted to Cooperatives. Services are provided to Seniors to motivate them to secure and maintain entitlement benefits and assist with their physical, psychological and social well being. The organization assists with various programs accessible for seniors such as referral to suitable housing placement, SCRIE, HEAP, IT210 & IT214 tax rebates, Medicare/Medicaid, Home care referral and social cultural/ recreational programs."
    },
    {
      "county": "New York County",
      "service_area": "CLINTON",
      "name": "Clinton Housing Development Co. Inc.",
      "website url": "",
      "phone no.": "(212) 967-1644",
      "contact person": "JOHN SCOTT R. JOHNSON",
      "service area": "CLINTON",
      "address": "403 W 40TH ST NEW YORK, NY 10018",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=128",
      "email": "info@clintonhousing.org",
      "description": "Clinton Housing Development Company, Inc. (CHDC), established in 1973 as a voluntary organization, was incorporated in 1974. Its original mission was to combat community deterioration, assist the community in meeting and solving its housing needs, and improve the living conditions for senior citizens, families of limited income, and other disadvantaged persons by sponsoring and promoting the renovation, rehabilitation, and tenant ownership of housing in the borough of Manhattan. Housing is planned, renovated or built with people as the first concern. Tenants are an integral part of the development and construction process. By putting people first, our staff creates affordable apartments which are well-maintained years after renovation. Many buildings have been converted to tenant ownership as low- and moderate-income coops. Ownership empowers tenants and builds a stable community."
    },
    {
      "county": "New York County",
      "service_area": "WASHINGTON HEIGHTS",
      "name": "Community League Of The Heights",
      "website url": "http://www.cloth159.org",
      "phone no.": "(212) 795-4779",
      "contact person": "YVONNE STENNETT",
      "service area": "WASHINGTON HEIGHTS",
      "address": "500 W 159TH ST NEW YORK, NY 10032",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=132",
      "email": "ystennett@cloth159.org",
      "description": "The Community League of the Heights ( CLOTH) is a community based organization that was founded in 1952.  From its origins as a volunteer organization formed to serve the needs of the youth of Southern Washington Heights, CLOTH today is a dynamic community development organization working to strengthen and empower the neighborhoods of Southern Washington Heights and Hamilton Heights.  What began as a coalition of neighborhood parents, CLOTH (formerly the Community League of West 159th Street) has evolved into a professional and multi-dimensional organization whose comprehensive mission now encompasses advocacy, organizing and the provision of services as they relate to affordable housing; education; health; youth and neighborhood improvement.  Our enduring philosophy is that our doors are always open to neighbors in need. CLOTH has been and continues to be dedicated to the improvement of the quality of life for residents of the Southern Washington Heights area."
    },
    {
      "county": "New York County",
      "service_area": "LOWER EAST SIDE",
      "name": "Cooper Square Cd Committee & Businessmen'S Association, Inc.",
      "website url": "http://www.coopersquare.org",
      "phone no.": "(212) 228-8210",
      "contact person": "STEVE HERRICK",
      "service area": "LOWER EAST SIDE",
      "address": "61 E 4TH ST NEW YORK, NY 10003",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=134",
      "email": "steveh@coopersquare.org",
      "description": "The Cooper Square Committee's mission is to preserve and develop affordable housing and community/cultural spaces in order to prevent displacement of low/moderate income tenants and to maintain the racial, economic and cultural diversity of the Lower East Side in our service area from the Bowery to the East River and from E. 14th Street to Delancey Street."
    },
    {
      "county": "New York County",
      "service_area": "CHINATOWN/LOWER EASTSIDE",
      "name": "Downtown Manhattan Community Development Corp.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "New York County",
      "service_area": "WEST AND CENTRAL HARLEM",
      "name": "Ecumenical Community Development Organization",
      "website url": "http://www.ecdo.org",
      "phone no.": "(212) 678-0037",
      "contact person": "JANICE C. BERTHOUD",
      "service area": "WEST AND CENTRAL HARLEM",
      "address": "443 W 125TH ST NEW YORK, NY 10027",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=537",
      "email": "jberthoud@ecdo.org",
      "description": "Recently, we reached the 3nd year anniversary of the opening a new state of art educational center for children. The  development of the ECDO Headstart/Early Childhood Development Day Care Center at 249 W. 144th Street is offering the highest quality of early childhood educational activities to low to moderate income residents of the community. The ECDO/Headstart Early Childhood Development Center provides full day care to infants, toddlers and preschoolers."
    },
    {
      "county": "New York County",
      "service_area": "EAST HARLEM/EL BARRIO",
      "name": "El Barrio'S Operation Fight-Back",
      "website url": "",
      "phone no.": "(212) 410-7900",
      "contact person": "GUSTAVO ROSADO",
      "service area": "EAST HARLEM/EL BARRIO",
      "address": "SUITE 403 413 E 120TH ST NEW YORK, NY 10035",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=140",
      "email": "john.arenas@ebof.org",
      "description": "Incorporated in January 1986, El Barrio's Operation Fightback (EBOF) continues to work against the deterioration of housing, the displacement of families, and the declining availability of affordable housing in East Harlem. EBOF manages 259 rental units with another 42 units slated for completion by the Fall 2000.  In addition EBOF has sponsored 102 units of two and three-family homes and 77 SRO units for formally drug dependent individuals. EBOF also offers an array of tenant and community services to improve the quality of life for East Harlem's children and families.  Specifically, Operation Fightback provides housing information and assistance regarding tenant code enforcement; assists tenants with housing court actions; organizes neighborhood improvement activities; serves as tenant liaison for Neighborhood Entrepreneur Program; facilitates home ownership through the City Homes Program; rehabilitates neighborhood apartments and homes; sponsors the development of new homes in conjunction with NYC Housing Partnership; and provides guidance, recreational and educational services for the children of neighborhood tenants.  These efforts are the product of a broad public, private, and non-profit partnership funded through city, state, and federal housing agencies, as well as private corporations and the foundation community."
    },
    {
      "county": "New York County",
      "service_area": "LOWER EAST SIDE",
      "name": "Good Old Lower East Side, Inc.",
      "website url": "",
      "phone no.": "(212) 358-1231",
      "contact person": "DAMARIS REYES",
      "service area": "LOWER EAST SIDE",
      "address": "169 AVENUE B NEW YORK, NY 10009",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=34",
      "email": "info@goles.org",
      "description": "GOLES is a non-profit housing advocacy organization committed to the preservation of low and moderate income housing. Affordable housing continues to shrink on the Lower East Side in every housing sector. This assault on housing is most conspicuous in the privately owned rent regulated stock where the conversion to market rate luxury housing is happening at an alarming rate leading to more homelessness and displacement.  According to GOLES' in house intake survey, there has been a 15% increase since the same period last year in the litigation activity against tenants in the form of non-payment, holdover, and nuisance cases."
    },
    {
      "county": "New York County",
      "service_area": "EAST HARLEM",
      "name": "Hellgate Management Corp.",
      "website url": "",
      "phone no.": "(212) 410-7707",
      "contact person": "MARTIN REYES",
      "service area": "EAST HARLEM",
      "address": "SUITE 306 413 E 120TH ST NEW YORK, NY 10035",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=154",
      "email": "rrodriguez@promesa.org",
      "description": "Hellgate Management Corporation was incorporated in the State of New York as a non-for-profit organization in 1979. Its mission for the last twenty-nine years has been to develop and implement plans, projects and activities that would eliminate the abandonment of housing stock in East Harlem. The agency also strives to aid, assist, and foster planning, development, and rebuilding through activities geared towards the preservation of our community."
    },
    {
      "county": "New York County",
      "service_area": "EAST HARLEM/EL BARRIO",
      "name": "Hope Community, Inc.",
      "website url": "http://www.hopeci.org",
      "phone no.": "(212) 860-8821",
      "contact person": "WALTER M. ROBERTS",
      "service area": "EAST HARLEM/EL BARRIO",
      "address": "174 E 104TH ST NEW YORK, NY 10029",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=157",
      "email": "wroberts@hopeci.org",
      "description": "As a community based developer of housing, Hope Community, Inc. is committed to building a better community and enriching the lives of the people who live and work within East Harlem. We sponsor, construct, and operate attractive and high quality housing primarily for low- and moderate-income families. Hope Community believes that personal responsibility combined with collected action is the key to establishing a lasting impact on the community. Working in partnership with other organizations, private businesses, government, and the constituents of East Harlem, Hope Community forges ties that bind people together into economically, ethnically, and culturally diverse neighborhoods creating healthy environments where families can grow and prosper. In addition to providing quality housing, Hope Community seeks to foster an enriched community through restructuring the vacant lots that plague East Harlem's blocks. These properties are viable sites to develop into parks and gardens under Hope Community's Urban Landscaping program. Hope Community has successfully converted 15 vacant lots throughout East Harlem into five parks and ten gardens. Work on the restoration of the Modesto Tin Flores Garden, where Hope Community holds its Poetas Con Cafe, has already begun."
    },
    {
      "county": "New York County",
      "service_area": "CLINTON",
      "name": "Housing Conservation Coordinators, Inc.",
      "website url": "http://www.hcc-nyc.org",
      "phone no.": "(212) 541-5996",
      "contact person": "SARAH DESMOND",
      "service area": "CLINTON",
      "address": "777 TENTH AVE NEW YORK, NY 10019",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=42",
      "email": "sdesmond@hcc-nyc.org",
      "description": "Housing Conservation Coordinators, Inc. (HCC) is a not-for-profit housing advocacy agency serving the Clinton neighborhood of Manhattan.  HCC was formed in 1972 to promote safe, decent and affordable housing for low and moderate income tenants.  We provide comprehensive housing services to prevent homelessness, improve standards of living, and increase the availability of permanent, affordable housing.  HCC works collaboratively with a variety of neighborhood non-profits to better provide these services and to help residents access a wide range of social services.  Each year, we assist over 1,500 tenants through our five programs: homelessness prevention program, NYC HPD'S 7a administration program, weatherization assistance program, technical training classes, and  revolving loan program."
    },
    {
      "county": "New York County",
      "service_area": "LOWER EAST SIDE",
      "name": "Lower East Side Coalition Housing Development, Inc.",
      "website url": "",
      "phone no.": "(212) 677-4772",
      "contact person": "KIM O'NEALE",
      "service area": "LOWER EAST SIDE",
      "address": "GROUND FLOOR 308 E 8TH ST NEW YORK, NY 10009",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=173",
      "email": "leschdc@aol.com",
      "description": "Established in 1967 as the Coalition for Human Housing, Lower East Side Coalition Housing Development, Inc. (COALITION) is the only Latino, community-based, housing development organization in the Lower East Side.  Since its inception, the purpose of the Coalition has been to give the community a strong voice in creating a fair and balanced policy of housing development and land use.  COALITION has provided a model for, and participated in, numerous collaborative efforts to improve the quality of life throughout the lower east side, inviting community input and encouraging community leadership in the delivery of a full range of human service.  COALITION established and spun off a senior center and developed and sponsored a day care center.  COALITION has acted as fiscal conduit for The Girls Club of the Lower East Side and the Lower East Side Latino Human Services Consortium. Funds received from DHCR have leveraged over $28 million for the new construction of 80 HUD Section 202 apartments and the gut rehab of 19 buildings encompassing 212 apartments and 10 commercial spaces under HHAP, Enterprise/LISC/HPD, and HPD Capital Program.  Coalition is also the proud sponsor of 98 units of housing under the auspices of NYC Partnership Housing."
    },
    {
      "county": "New York County",
      "service_area": "MANHATTAN VALLEY",
      "name": "Manhattan Valley Development Corporation",
      "website url": "http://www.mvdc.org",
      "phone no.": "(212) 678-4410",
      "contact person": "SANDRA B. POWERS",
      "service area": "MANHATTAN VALLEY",
      "address": "73 W 108TH ST NEW YORK, NY 10025",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=176",
      "email": "sandra.b.powers@gmail.com",
      "description": "The mission of Manhattan Valley Development Corporation (MVDC) is geared toward the rehabilitation of the existing housing stock, building maintenance, and the preservation and revitalization of the neighborhood by coordinating its physical, social, and economic initiatives.  By sustaining the mission of providing affordable housing to the predominantly low income, ethnically diverse population and relocation within the community, MVDC is making every effort to tailor construction costs to rent levels community residents can afford or to secure rent subsidies in cases where construction costs exceed their income. Another important aspect of MVDC's mission is to provide jobs and job training to local unemployed or underemployed workers, support local businesses and other enterprises, provide human services, and improve quality of life.  In more recent years, MVDC extended its mission to house homeless families and individuals in its projects, including individuals living with HIV. It has always been an important part of MVDC's mission to create a viable housing services and rehabilitation capability, while simultaneously improving Manhattan Valley buildings in a manner that would preserve the integrity of the community as a viable neighborhood for low income and working class families from diverse racial, social, ethnic, and economic backgrounds."
    },
    {
      "county": "New York County",
      "service_area": "LOWER EAST SIDE",
      "name": "Mfy Legal Services, Inc.",
      "website url": "http://www.mfy.org",
      "phone no.": "(212) 417-3766",
      "contact person": "CHRISTOPHER SCHWARTZ",
      "service area": "LOWER EAST SIDE",
      "address": "299 BROADWAY NEW YORK, NY 10007",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=175",
      "email": "cschwartz@mfy.org",
      "description": "MFY Legal Services, Inc. is a not-for-profit legal services program providing legal counseling, social services, community legal education, and legal representation to low income tenants and tenant groups residing in many at-risk neighborhoods in Manhattan including the Lower East Side, East Harlem, Chinatown, Clinton, and Manhattan Valley.  Funding sources include federal, state, and local grants as well as private foundations, corporations, and individuals.  MFY's Neighborhood Preservation Program funding supports assistance to low-income tenants in Single Room Occupancy (SRO) hotels, rooming houses, and lodging houses in the rapidly changing neighborhoods of Manhattan's East Side.  During State Fiscal Year 99-00, MFY provided tenant assistance."
    },
    {
      "county": "New York County",
      "service_area": "WASHINGTON HEIGHTS/INWOOD",
      "name": "Northern Manhattan Improvement Corp.",
      "website url": "http://www.nmic.org",
      "phone no.": "(212) 822-8300",
      "contact person": "MARIA LIZARDO",
      "service area": "WASHINGTON HEIGHTS/INWOOD",
      "address": "4TH FLOOR 76 WADSWORTH AVE NEW YORK, NY 10033",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=887",
      "email": "marializardo@nmic.org",
      "description": "Northern Manhattan Improvement Corporation is a not-for-profit community based housing organization established in 1979 and serving the Washington Heights/Inwood section of Upper Manhattan. The agency's client population is comprised mostly of very low income immigrants from the Dominican Republic. In addition to its housing activities, which include anti-eviction services, community tenant and block organizing, and housing development, the agency offers social services (including domestic violence prevention) and a range of workforce development services for low income residents, including English classes. There is a great demand in the community for all of NMIC's services, especially those related to housing."
    },
    {
      "county": "New York County",
      "service_area": "EAST HARLEM",
      "name": "Nuevo El Barrio Para La Rehab De La Vivienda Y La Economia",
      "website url": "",
      "phone no.": "(212) 427-0555",
      "contact person": "ROBERTO C. ANAZAGASTI",
      "service area": "EAST HARLEM",
      "address": "SUITE 2R 18 E 116TH ST NEW YORK, NY 10029",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=186",
      "email": "ranerve1@aol.com",
      "description": "Nuevo El barrio para la Rehabilitation.de la Vivienda y la Economia, Inc. (N.E.R.V.E, inc), was founded in 1975 to help meet the housing needs of residents in East Harlem (El Barrio). After two submissions to the NYSHTF we were unable to get the funds to develop housing for low income residents at 2249 2nd Avenue site. We have been forced to surrender the idea of developing low income housing, and are now in the process of developing moderate income condominiums ( 32 Units) at 2249 2nd Avenue (Block 1665, Lot 24 & 25) in order to support our low income buildings. In the past and current years we have supported and maintained our low income buildings with rent and funds generated from 119 East 102nd street, a section 8 project. Our future strategy is to build these condominiums in order to generate funds from the sales therefore allowing N.E.R.V.E Inc. to become more self sufficient."
    },
    {
      "county": "New York County",
      "service_area": "MANHATTAN VALLEY/CENTRAL AND EAST HARLEM",
      "name": "Sinergia, Inc.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "New York County",
      "service_area": "UPPER WEST SIDE",
      "name": "Strycker'S Bay Neighborhood Council",
      "website url": "http://www.stryckersbay.org",
      "phone no.": "(212) 874-7272",
      "contact person": "KELLEY WILLIAMS",
      "service area": "UPPER WEST SIDE",
      "address": "105 W 86TH ST NEW YORK, NY 10024",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=234",
      "email": "info@stryckersbay.org",
      "description": "For the past 50 years, the mission of the Strycker's Bay Neighborhood Council, Inc. (SBNC) has been to assist low-income residents of the Upper West Side to solve problems of inadequate housing and other related community services and to help empower them to improve their quality of life. Since our beginning, we have looked beyond housing problems to address the comprehensive range of issues that affect the welfare of our community residents including education, employment, youth development, and open space. Strycker's Bay serves as a door of opportunity for neighborhood people seeking to gain valuable leadership skills by volunteering, becoming a member of our staff, or participating in the development of neighborhood programs and projects."
    },
    {
      "county": "New York County",
      "service_area": "LOWER EASTSIDE",
      "name": "United Jewish Council Of The East Side, Inc.",
      "website url": "",
      "phone no.": "(212) 233-6037",
      "contact person": "JOEL KAPLAN",
      "service area": "LOWER EASTSIDE",
      "address": "235 E BROADWAY NEW YORK, NY 10002",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=244",
      "email": "joelkujc@aol.com",
      "description": "United Jewish Council of the East Side, Inc. (UJC) is committed to providing a variety of services to a multiethnic community.  Staff is able to make these services available to individuals speaking Spanish, Russian, Chinese, Yiddish, and Hebrew as well as English. Services and programs are provided at 10 sites throughout the Lower East Side and include 300 meals served to seniors daily at three sites, home delivered meals, housing for the high functioning mentally ill, senior, and low income housing.  UJC provides intensive social services including access to food stamps, Medicaid, and housing advocacy.  Through UJC's Home Attendants Corporation, the Council employs 1000 home attendants serving 600 households.  In addition, UJC provides mental health and immigration services.  The Council distributes food vouchers, food packages, weekend meals, and guidance related to Medicaid managed care.  Staff will appear with clients at fair hearings and court hearings and frequently has to provide translation services.  Advocacy is provided in tenant/landlord disputes. UJC runs a 14 passenger van service (wheelchair accessible) and makes it possible for seniors to get to doctors appointments, shop, etc. Through its Pharma program low-income individuals of any age are able to obtain prescription medications at no cost from pharmaceutical manufacturers. The Council, in partnership with the New York City Police Department, 7th Precinct, produces photo identification cards for seniors, a VIN etch program, home safety education, awareness about youth gangs, and child protection advice, among other activities. The Lower East Side VOICE, a 24-page newspaper, is published four times a year and is distributed throughout the neighborhood."
    },
    {
      "county": "New York County",
      "service_area": "WASHINGTON HEIGHTS/INWOOD",
      "name": "Washington Heights Inwood Preservation And Restoration Corp.",
      "website url": "",
      "phone no.": "(212) 795-7522",
      "contact person": "DEBORAH HES",
      "service area": "WASHINGTON HEIGHTS/INWOOD",
      "address": "SUITE 11A 121 BENNETT AVE NEW YORK, NY 10033",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=249",
      "email": "dhes@jccwhi.com",
      "description": "Washington Heights Inwood Preservation and Restoration Corporation (WHIPRC) was incorporated in 1977 as a not for profit 501(c)3 agency with a mission to preserve the neighborhood and improve the quality of life for its residents.  WHIPRC responds to the needs of the community by offering services in several languages including Russian, Hebrew, Yiddish, Spanish, German, as well as English.  This agency provides a broad spectrum of housing and social services to its clients, the majority of whom are low income, non-English speaking immigrants, vulnerable elderly, and the working poor.  WHIPRC's housing programs improve housing stock; assist its residents in acquiring and maintaining adequate, affordable, safe housing; help clients to secure and keep entitlements, such as Section 8, SCRIE, DRIE, HEAP, HEAT, etc.; negotiate with tenants and landlords regarding rent arrears and repairs; and prevent homelessness through eviction prevention.  WHIPRC's social services include benefits and entitlements assistance, case assistance and advocacy, crisis intervention, information and referral, friendly visiting, telephone reassurance, food pantry, and food vouchers.  Funding is received from city, state and private-sector sources. For over 30 years, WHIPRC has a proven track record for effective service delivery to the community.  In addition, WHIPRC coordinates multi-ethnic coalitions to address broader neighborhood issues and strengthen intercommunity relations."
    },
    {
      "county": "New York County",
      "service_area": "WEST HARLEM/HAMILTON HEIGHTS",
      "name": "West Harlem Group Assistance, Inc.",
      "website url": "",
      "phone no.": "(212) 862-1399",
      "contact person": "DONALD C. NOTICE",
      "service area": "WEST HARLEM/HAMILTON HEIGHTS",
      "address": "1652 AMSTERDAM AVE NEW YORK, NY 10031",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=253",
      "email": "dnotice@whgainc.org",
      "description": "West Harlem Group Assistance, Inc. (WHGA) serves the overwhelmingly minority communities of Central and West Harlem, located in Manhattan Community Districts 9 and 10. As more than 34% of the area's population is dependent upon some form of income support, and unemployment among all age groups is significantly higher than the national average, the importance of ensuring the availability of affordable housing, while improving access to economic opportunities, is crucial to the company  mission. The Company's mission builds on community capacities and assets, and engages positive and constructive action. WHGA's  mission is to:"
    },
    {
      "county": "New York County",
      "service_area": "UPPER WESTSIDE",
      "name": "West Side Federation For Senior And Supportive Housing, Inc.",
      "website url": "",
      "phone no.": "(212) 595-8983",
      "contact person": "LAURA R. JERVIS",
      "service area": "UPPER WESTSIDE",
      "address": "2345 BROADWAY NEW YORK, NY 10024",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=255",
      "email": "ljervis@wsfssh.org",
      "description": "West Side Federation for Senior  Housing, Inc. (WSFSH) is a community-based organization responding to the need for low-cost housing.  The mission of WSFSSH is to provide safe, affordable housing with supportive services within a residential setting that enhances the independence and dignity of each person.  WSFSSH develops, manages, and provides social services in housing for low income persons, especially the elderly, homeless, and those with mental illness. WSFSH operates 447 independent apartments; an 80 bed adult care facility for frail elderly persons; 493 Single Room Occupancy (SRO) units;  Valley Lodge, a transitional shelter for 92 homeless elderly, who are helped to move on to permanent housing; and Fleming House, an adult home for 47 mentally ill homeless elderly individuals; the Ben Michalski Residence, which provides 18 units of permanent housing for people with AIDS; and the West 129th Street Residence, an adult residence for 82 homeless individuals, many of whom face the challenges of mental illness and substance use."
    },
    {
      "county": "New York County",
      "service_area": "HAMILTON HEIGHTS",
      "name": "Wilson Major Morris Community Center, Inc.",
      "website url": "",
      "phone no.": "(212) 234-4661",
      "contact person": "PATRICIA WILSON",
      "service area": "HAMILTON HEIGHTS",
      "address": "459 W 152ND ST NEW YORK, NY 10031",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=415",
      "email": "wmmcc152@twcmetrobiz.com",
      "description": "The Wilson Major Morris Community Center (WMMCC) is a non-profit organization founded in 1970 to provide social and housing services for the residents of the Hamilton Heights and Community 9 & 12 Board Districts.  WMMCC, Inc. has 34 years of experience providing these  services to families, seniors and youth residents of Harlem.  WMMCC has provided congregate meals for senior citizens residents of Harlem and Northern Manhattan Neighborhoods for over 20 years; (16,000 meals were provided during the FY 2003 - 2004).  The Manhattan service catchment area for WMMCC is bound by West 155th Street to the North, West 133rd Street to the South, Edgecombe Avenue to the East and the Hudson River to the West.  WMMCC established a Neighborhood Preservation Program (NPP) in 1982, through funding support from the New York State Division of Housing and Community Renewal (DHCR).  The NPP is designed to stabilize, preserve and revitalize the housing, retail/commercial and community facilities in the Hamilton Heights Neighborhood.  It also provides assistance to community residents with housing and housing related problems including housing code enforcement, regulations and assistance with filling out applications for housing programs.  The NPP provides direct assistance to seniors with completing applications for the Senior-Citizen Rent Increase Exemption Program (SCRIE), the Home Energy Assistance Program (HEAP), the IT-214 and the  NYC - 210 applications.  WMMCC, Inc. works closely with owners of apartment buildings that house senior residents in the Hamilton Heights Neighborhood to provide the array of Housing Assistance, Repair & Rehabilitation Technical Assistance and Homeowners Assistance Services.  It also provides technical assistance to tenant associations through the HPD Tenant Interim Lease Program."
    },
    {
      "county": "Queens County",
      "service_area": "JAMAICA",
      "name": "Allen Ame Neighborhood Preservation And Development Corp.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Queens County",
      "service_area": "DITMARS/ASTORIA",
      "name": "Astoria Restoration Association, Inc.",
      "website url": "",
      "phone no.": "(718) 726-0034",
      "contact person": "CATHERINE PIECORA",
      "service area": "DITMARS/ASTORIA",
      "address": "31-28 DITMARS BLVD ASTORIA, NY 11105",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=107",
      "email": "cmpiecora@aol.com",
      "description": "The Astoria Restoration Association (ARA) was first organized in 1977 by a group of concerned merchants and residents who became increasingly aware that the viability of the Ditmars Boulevard-31st Street commercial strip was essential to the continued well-being of the entire neighborhood.  As the commercial revitalization activities of the Astoria Restoration Association continued, which included the completion of a 1.7 million dollar physical improvement project for the area, it soon became apparent that housing deterioration had to be addressed before it developed into a more serious problem.  Thus in 1981, the ARA began a comprehensive housing and neighborhood revitalization program aimed at strengthening the existing housing stock of the neighborhood.  The goals of the Astoria Restoration Association, as stated in the Articles of Incorporation are to \"preserve the stability of the residential and the commercial areas of the community; encourage landlords, homeowners, and businessmen to improve their property, stimulate public interest in the arts and cultural endeavors related to the preservation of the community; and to coordinate with government agencies to improve the community.\"  With these goals as a base, the ARA has and will continue to implement an on-going Neighborhood Preservation Program consisting of three majors components: 1) Housing 2) Neighborhood Economic Development 3) Neighborhood Employment Service."
    },
    {
      "county": "Queens County",
      "service_area": "CENTRAL ASTORIA",
      "name": "Central Astoria Local Development Coalition, Inc.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Queens County",
      "service_area": "FAR ROCKAWAY",
      "name": "Jewish Community Council Of The Rockaway Peninsula",
      "website url": "http://www.jccrp.org",
      "phone no.": "(718) 327-7755",
      "contact person": "NATHAN KRASNOVSKY",
      "service area": "FAR ROCKAWAY",
      "address": "1525 CENTRAL AVE FAR ROCKAWAY, NY 11691",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=165",
      "email": "nkrasnovsky@jccrp.org",
      "description": "Since the Jewish Community Council of the Rockaway Penninsula (JCCRP) was founded in 1972, it has been providing services on a non-sectarian basis to those in need and advocating for issues of concern to the community.  JCCRP provides social services to residents who live in the service area. JCCRP provides neighborhood preservation services and focuses on assisting  tenants and landlords of troubled buildings and is committed to improving the living conditions of area residents. It collaborates with community groups and individuals to attain improvements for the area."
    },
    {
      "county": "Queens County",
      "service_area": "FAR ROCKAWAY/EDGEMERE",
      "name": "Margert Community Corp.",
      "website url": "http://www.margert.org",
      "phone no.": "(718) 471-3724",
      "contact person": "JOSEPH G. BARDEN",
      "service area": "FAR ROCKAWAY/EDGEMERE",
      "address": "325 BEACH 37TH ST FAR ROCKAWAY, NY 11691",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=178",
      "email": "jgb@nyct.net",
      "description": "Margert Community Corporation is an independent, nonprofit, charitable, community-based housing organization that provides neighborhood preservation services; housing assistance; energy affordability analyses and retrofits; health & safety improvements; and client education and housing counseling to low to moderate income tenants, homeowners, the elderly, and persons with disabilities. While our primary service area is Far Rockaway, Queens, we also provide vital housing services to all of Queens County and the entire NYC Metro Area. These services are provided by leveraging a variety of public and private funds primarily designed to assist households at or below 90% of our area's medium income and/or in severe financial distress. These sources, leveraged through the core administrative budget provided by the NYS DHCR Neighborhood Preservation Program, include: the DHCR Energy Services Bureau Weatherization Assistance Program, the HTFC RESTORE Program LPA, the HTFC HOME Program LPA, the HTFC Access to Home Program LPA, the US Department of Housing and Urban Development (HUD) Housing Counseling Program, the NYC DFTA Last Resort and coordinated weatherization programs, the Long Island Fuel Fund's Project Warmth, new construction applications through the NYS DHCR Unified Funding Process, and NYSERDA funded energy efficiency programs. We also provide housing counseling services through the New York Mortgage Coalition and NYC HPD City Council Initiative programs, and first time home ownership opportunities through community sponsorship of affordable housing development."
    },
    {
      "county": "Queens County",
      "service_area": "CORONA, ELMHURST, & JACKSON HEIGHTS",
      "name": "Neighborhood Housing Services Of Northern Queens",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Queens County",
      "service_area": "JAMAICA",
      "name": "Nhs Of Jamaica, Inc.",
      "website url": "http://www.nhsj.org",
      "phone no.": "(718) 291-7400",
      "contact person": "CATHY MICKENS",
      "service area": "JAMAICA",
      "address": "89-70 162ND ST JAMAICA, NY 11432",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=188",
      "email": "cathy.mickens@nhsj.org",
      "description": "Neighborhood Housing Services of Jamaica (NHSJ) is a 34 year-old not-for-profit organization that's provided a cadre of housing services to residents in Southern Queens.  As the premier housing organization in Southern Queens, NHSJ provides quality and affordable homeownership services to low- and middle-income residents in communities known as:  South Jamaica, Ozone Park, Springfield Gardens, St. Albans and Hollis.   NHSJ strives to preserve neighborhoods in its service area by offering homeownership education, counseling, technical and financial assistance to community residents."
    },
    {
      "county": "Queens County",
      "service_area": "ASTORIA",
      "name": "Northwest Queens Housing Corp.",
      "website url": "",
      "phone no.": "(718) 728-6886",
      "contact person": "JOHN P. KAITERIS",
      "service area": "ASTORIA",
      "address": "GEORGE T DOURIS TOWER 27-40 HOYT AVE ASTORIA, NY 11102",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=204",
      "email": "zoeartemis@aol.com",
      "description": "Northwest Queens Housing Corp. is a non-profit neighborhood preservation company whose purpose is to revitalize our community.  We offer programs and services to create affordable housing and help our clients find affordable housing and other needed social services.  We assist clients in applying for a variety of economic relief programs, such as Section 8, IT-214 tax credits, HEAP, STAR, and public housing.  By providing the essential information and assisting the client in the application process, we are providing economic relief to low-middle income clients.  Many are seniors; many cannot speak English; and many would not be aware of their entitlements if it was not for Northwest Queens Housing Corp. We also provide assistance with landlord-tenant issues, such as filling out leases, recertifications, explanation of rent stabilization and rent control laws and act as an intermediary when there is a conflict between tenant and landlord. In this densely populated area with its slow vacancy rates, the services we provide are essential to our client population."
    },
    {
      "county": "Queens County",
      "service_area": "FOREST HILLS, REGO PARK, CORONA & ELMHURST",
      "name": "Queens Community House, Inc.",
      "website url": "http://www.queenscommunityhouse.org",
      "phone no.": "(718) 592-5757",
      "contact person": "IRMA RODRIGUEZ",
      "service area": "FOREST HILLS, REGO PARK, CORONA & ELMHURST",
      "address": "108-25 62ND DR FOREST HILLS, NY 11375",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=147",
      "email": "irodriguez@queenscommunityhouse.org",
      "description": "Queens Community House, Inc. is a multi-service settlement house with 25 years of social service experience.  We are committed to the personal growth of the diverse population we serve.  The Community House employs 267 people and utilizes a volunteer core of 200 Queens residents and social work interns to serve approximately 17,000 individuals annually. We provide 32 programs at 17 sites for Queens residents.  Community House programs include 4 senior centers, one which serves gay and lesbian seniors;  transportation services for the elderly; after-school programs throughout Community District 28; a teen outreach program; a substance abuse and prevention program targeting young women; adult literacy and computer classes; child health insurance enrollment; and comprehensive housing services including homelessness prevention, eviction prevention, rehousing assistance, and services to homeless families. Through our Neighborhood Preservation activities, tenants and property owners can obtain assistance to improve the quality of their housing environments. The Neighborhood Preservation Program also supports the activities of tenant association, block associations, and offers community education and community mediation services."
    },
    {
      "county": "Queens County",
      "service_area": "ROCKAWAY PENINSULA AND BROAD CHANNEL",
      "name": "Rockaway Development & Revitalization Corp.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Queens County",
      "service_area": "RIDGEWOOD/MASPETH/GLENDALE/MIDDLE VILLAGE",
      "name": "The Greater Ridgewood Restoration Corporation",
      "website url": "http://www.ridgewoodrestoration.org",
      "phone no.": "(718) 366-8721",
      "contact person": "ANGELA MIRABILE",
      "service area": "RIDGEWOOD/MASPETH/GLENDALE/MIDDLE VILLAGE",
      "address": "68-56 FOREST AVE RIDGEWOOD, NY 11385",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=36",
      "email": "angelam@ridgewoodrestoration.org",
      "description": "Greater Ridgewood Restoration Corporation was founded in 1975 by civic and community leaders who were concerned by the spread of deterioration from surrounding communities. Their goal was to stabilize, preserve, and upgrade the housing stock of Queens Community Board 5.  To insure neighborhood stability and improvement, GRRC provides the following services:  landlord/tenant counseling; identification and correction of in-rem/problem buildings, anti-graffiti cleaning program, and marketing of low-interest loans and grants.  All of our programs focus on neighborhood housing to stabilize and upgrade buildings and insure tenants live in well-maintained, affordable, and safe homes; that landlords get help to maintain and upgrade their properties to prevent abandonment; and that quality of life is improved."
    },
    {
      "county": "Queens County",
      "service_area": "WOODSIDE",
      "name": "Woodside On The Move, Inc.",
      "website url": "",
      "phone no.": "(718) 476-8449",
      "contact person": "ROSA REYES",
      "service area": "WOODSIDE",
      "address": "2ND FLOOR 39-42 59TH ST QUEENS, NY 11377",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=91",
      "email": "info@woodsideonthemove.org",
      "description": "Established in1978, Woodside On The Move, Inc. (WOTM) offers a diverse range of programs and services for the maintenance and improvement of the quality of life in Woodside, Queens.  Maintaining decent, affordable housing is an  important aspect of our mission.  WOTM has provided assistance to the community in housing, youth services, business, culture, and job placement programs that help both businesses and residents. WOTM's activities include: co-ownership of a 78-unit senior residence; serving as a local sponsor for the Sunnywood Partnership Homes; providing businesses and employment services; providing after-school and summer youth programs; and organizing community activities such as neighborhood clean-ups, a street fair, holiday tree lighting, and free concerts in schools and parks. WOTM also provides tenant and landlord assistance and homeowner financial counseling. During State FY '99-'00, the corporation performed the following NPC activities: tenant/client assistance, grants and program assistance, research/outreach/organizational development, and homeowner financial counseling. As a way to broadly inform the community about our services, WOTM opened a web-site giving the opportunity to tenants/clients to access information about our programs."
    },
    {
      "county": "Richmond County",
      "service_area": "WEST BRIGHTON",
      "name": "Nhs Of Staten Island, Inc.",
      "website url": "http://www.nhsofsi.org",
      "phone no.": "(718) 442-8080",
      "contact person": "ALFRED GILL",
      "service area": "WEST BRIGHTON",
      "address": "770 CASTLETON AVE STATEN ISLAND, NY 10310",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=191",
      "email": "agill@nhsofsi.org",
      "description": "For over 25 years NHSSI has been committed to revitalizing neighborhoods through education, counseling and financial services to enhance people's ability to access affordable housing on Staten Island.  During this time the agency has worked to increase and protect investment in underserved low- and moderate- income neighborhoods, helped build communities, which encourage and support neighborhood self-reliance, and improve the quality of community life.  Today that quality of life in those communities that we have worked so hard to preserve is being threatened by Foreclosure."
    },
    {
      "county": "Richmond County",
      "service_area": "PORT RICHMOND",
      "name": "Northfield Community Local Development Corporation",
      "website url": "http://www.northfieldldc.org",
      "phone no.": "(718) 442-7351",
      "contact person": "JOAN CATALANO",
      "service area": "PORT RICHMOND",
      "address": "160 HEBERTON AVE STATEN ISLAND, NY 10302",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=201",
      "email": "northfieldldc.jcat17@gmail.com",
      "description": "Northfield Community LDC provides services to the community through housing, weatherization, economic development,  and social services for seniors. Northfield strives to improve the housing conditions in the community by meeting regularly with  residents to discuss the needs of the community.  Housing services include developing housing to create homeownership opportunities for low- and moderate-income residents who might otherwise be excluded from the housing market.  To that end the organization administers a HOME subsidy grant; purchases and rehabilitates currently dilapidated houses; provides homebuyer workshops and one on one counseling; and pursues opportunities to develop new affordable homeownership units.  We assist property owners who wish to make repairs to their homes by providing rehabilitation loan information.  The organization provides referrals to rental housing management companies and maintains a listing of rent regulated apartments in our area. For tenants living in poor housing conditions, the organization provides referrals, processes code violation complaints, makes dispute resolution referrals, informs landlords regarding loans available to make repairs and training resources. Northfield LDC has been providing Weatherization services to the community for almost 20 years.  The organization also administers complementary programs which augment the repairs made under Weatherization. Economic development activities are targeted to the Port Richmond commercial district. Northfield administers a revolving loan fund for new and expanding businesses, works directly with merchants to promote the district, and brings educational resources to the business owners."
    },
    {
      "county": "Richmond County",
      "service_area": "NORTH SHORE",
      "name": "Richmond Senior Services, Inc.",
      "website url": "",
      "phone no.": "(718) 816-1811",
      "contact person": "BEVERLY V. NEUHAUS",
      "service area": "NORTH SHORE",
      "address": "729 DELAFIELD AVE STATEN ISLAND, NY 10310",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=545",
      "email": "rss500@con2.com",
      "description": "Richmond Senior Services, Inc. promotes and provides housing and housing-related services for older persons, persons with physical disabilities,  and developmentally disabled adults.  Project S.H.A.R.E. (Senior Housing at Reduced Expense) has provided safe and affordable shared housing opportunities for over 28 years for low-income seniors and disabled persons.  This program includes both agency-managed apartments in which three to four persons live cooperatively  in a residence maintained by Richmond Senior Services, and housing in the homes of senior homeowners who are willing to share their homes for the benefits of companionship and financial contribution to the household.  Both these opportunities are viable options in the ever-increasing costs of the rental market.  The Access to Home program provides home modifications  to low-income disabled persons to allow them safe access in, out and throughout their homes.  The addition of ramps, lifts, visual acuity and other modifications assures their full access to their community and needed services, and helps them to remain at home rather than in an institution.  The Senior Repair Program is a  home repair service that offers minor health and safety related home repairs for seniors and disabled persons.  This program covers the small, but otherwise costly, repairs that seniors cannot complete themselves due to lack of income or physical capabilities.    Hundreds of repairs are completed each year.  Our advocacy, information and referral,  entitlement counseling and application assistance also assist seniors and disabled persons in maintaining their independence in the community by accessing all possible services, including housing, adult education, emergency food supplies, and other housing repair services.  A senior food pantry provides emergency food to seniors and disabled persons each month who are experiencing difficulty in meeting household expenses.  Recipients of the food supplies also receive pre-screening for food stamps, entitlement screenings, housing and  job counseling, case assistance and information and referral.  The program encourages a nutritionally sound diet, while also alleviating some demands upon their financial resources."
    },
    {
      "county": "Rockland County",
      "service_area": "VILLAGES IN ROCKLAND COUNTY",
      "name": "Rcdc Housing, Inc.",
      "website url": "",
      "phone no.": "(845) 352-1400",
      "contact person": "EVA ENGLARD",
      "service area": "VILLAGES IN ROCKLAND COUNTY",
      "address": "22 MAIN ST MONSEY, NY 10952",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=928",
      "email": "rcdchousing@aol.com",
      "description": "Since 1978 the Rockland Community Development Council (RCDC) has been committed to improving the lives of low income local residents in Rockland County. RCDC specifically targets low to moderate income, disabled, frail, and elderly residents, offering a wide array of assistance programs in the areas of housing, human services, senior citizen programs, employment, and quality medical care. The shortage of suitable, affordable housing is a major concern in the community. RCDC helps residents locate appropriate housing and upgrade the condition of such housing through home improvement programs, weatherization, maintenance, and training. RCDC's social workers assist clients with applying for various government benefits, while providing training for families to become self sufficient through job placement and training. Senior centers are operated offering not just a reprieve from isolation, but health screening, educational lectures, recreation, and physical activity. Daily contact is maintained with homebound seniors, and visitation, meals, and medical care are provided. In summary, RCDC's aim is to improve life in the community by matching needs with available services."
    },
    {
      "county": "Rockland County",
      "service_area": "MONSEY",
      "name": "Rockland County Development Council, Inc.",
      "website url": "",
      "phone no.": "(845) 352-1400",
      "contact person": "SHULAMIS CHAIT",
      "service area": "MONSEY",
      "address": "22 MAIN ST MONSEY, NY 10952",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=217",
      "email": "rcdchousing@aol.com",
      "description": "Rockland County Development Council is committed to ensuring that residents in its service area are offered needed services so that they may enjoy safe, sanitary, affordable housing.  RCDC works towards increasing the number of available affordable housing units and assists with maintenance and repair of existing affordable units to help extend their useful life.  RCDC helps decrease monthly utility costs through weatherization and other energy efficiency programs.  Assistance is given to help lower utility expenses through HEAP and Neighbor Fund grants as well as private donations.  RCDC helps identify and resolve health and safety issues existing in Rockland's aging housing stock."
    },
    {
      "county": "Westchester County",
      "service_area": "PORT CHESTER",
      "name": "Human Development Services Of Westchester",
      "website url": "http://www.hdsw.org",
      "phone no.": "(914) 939-2005",
      "contact person": "ANDREA KOCSIS",
      "service area": "PORT CHESTER",
      "address": "930 MAMARONECK AVE MAMARONECK, NY 10543",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=160",
      "email": "blancalhds@aol.com",
      "description": "Human Development Services of Westchester, Inc. is a social service organization providing quality psychiatric, rehabilitative, residential and community stabilization in Westchester County.  The agency is dedicated to empowering the individuals and families we serve to achieve self sufficiency."
    },
    {
      "county": "Westchester County",
      "service_area": "OSSINING'S INNER VILLAGE",
      "name": "Interfaith Council For Action, Inc.",
      "website url": "http://www.ifcany.org",
      "phone no.": "(914) 941-5252",
      "contact person": "JUNE JARVIS",
      "service area": "OSSINING'S INNER VILLAGE",
      "address": "790 138 SPRING ST OSSINING, NY 10562",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=162",
      "email": "jjarvis@ifca.org",
      "description": "Interfaith Council for Action, Inc. (IFCA) was founded in 1968 to promote and sponsor better housing and to improve recreational, educational, and social conditions for low-and-moderate income members of the Ossining community.  Our mission is to \"sustain community, diversity and opportunity through affordable/workforce housing and vital social services.\""
    },
    {
      "county": "Westchester County",
      "service_area": "SOUTH MOUNT VERNON",
      "name": "Mount Vernon United Tenants",
      "website url": "",
      "phone no.": "(914) 699-1114",
      "contact person": "DENNIS HANRATTY",
      "service area": "SOUTH MOUNT VERNON",
      "address": "2107 40 SOUTH 4TH AVE MT VERNON, NY 10550",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=485",
      "email": "mvut@erols.com",
      "description": "MVUT is a city-wide, membership organization whose program efforts fall primarily under five (5) categories:"
    },
    {
      "county": "Westchester County",
      "service_area": "NORTHWEST YONKERS",
      "name": "North Yonkers Preservation & Development Corp.",
      "website url": "",
      "phone no.": "(914) 423-9754",
      "contact person": "ANGELA ASCOLILLO",
      "service area": "NORTHWEST YONKERS",
      "address": "219 RIDGE AVE YONKERS, NY 10703",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=61",
      "email": "northyonkerspreservation@yahoo.com",
      "description": "North Yonkers Preservation & Development Corporation is a not for profit community based organization.  The organization provides housing related assistance to residents of Northwest Yonkers.  We preserve and maintain the community by assisting tenants in upgrading their buildings, thereby stabilizing the neighborhood.  We inform residents in targeted areas through fliers, newspapers, church bulletins, and community events of their housing rights and guidelines.  Assistance is given to those who need help with housing problems due to lack of services such as heat, hot water, water leaks, evictions, and tenant/landlord problems. An annual meeting is held with public officials so that area residents may come and voice their concerns about housing conditions, problems, and needs in the neighborhood. To help stabilize the neighborhood, fire prevention, housing safety, crime prevention, recycling, and family health care seminars are conducted with local firefighters, public law officials, and city code enforcers. The organization also provides legal council and representation in housing court.  We provide individual counsel/referrals to tenants. A survey is now in progress to assess the needs of the community."
    },
    {
      "county": "Westchester County",
      "service_area": "CITY OF PEEKSKILL",
      "name": "The Preservation Company, Inc.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    },
    {
      "county": "Westchester County",
      "service_area": "SOUNDSHORE AREA OF MAMARONECK & MAMARONECK CENTRAL BUSINESS DISTRICT",
      "name": "Washingtonville Housing Alliance, Inc.",
      "website url": "http://www.washingtonvillehousing.org",
      "phone no.": "(914) 698-4299",
      "contact person": "RACHEL SPADARO",
      "service area": "SOUNDSHORE AREA OF MAMARONECK & MAMARONECK CENTRAL BUSINESS DISTRICT",
      "address": "136 LIBRARY LN MAMARONECK, NY 10543",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=250",
      "email": "rachel.spadaro@westhab.org",
      "description": "The Washingtonville Housing Alliance was formed in 1980 to improve the housing conditions of low and moderate-income residents in the Mamaroneck area. The Alliance constructs new housing, improves existing housing and undertakes other supportive activities designed to sustain a community that is culturally diverse, multi-generational and of mixed income.  Our organization is directed by a 17 person volunteer board of local residents who donate time and expertise to assist with public relations, legal, fundraising and other matters."
    },
    {
      "county": "Westchester County",
      "service_area": "SOUTHWEST YONKERS",
      "name": "Westhab In Yonkers, Inc.",
      "website url": null,
      "phone no.": null,
      "contact person": null,
      "service area": null,
      "address": null,
      "hcr_data_url": null,
      "email": null,
      "description": null
    }
  ],
  "report": {
    "diff": {
      "a": [
        "Albany County Rural Housing Alliance, Inc.",
        "Albany Housing Coalition, Inc.",
        "Arbor Hill Development Corp.",
        "South End Improvement Corp.",
        "United Tenants Of Albany, Inc.",
        "163Rd Street Improvement Council, Inc.",
        "Belmont Arthur Avenue Local Development Corp.",
        "Bronx Shepherds Restoration Corp.",
        "Fordham Bedford Housing Corporation",
        "Mbd Community Housing Corporation",
        "Mid-Bronx Senior Citizens Council, Inc.",
        "Morrisania Revitalization Corporation, Inc.",
        "Mount Hope Housing Co, Inc.",
        "Neighborhood Association For Intercultural Affairs",
        "Neighborhood Housing Services Of North Bronx, Inc.",
        "Neighborhood Initiatives Development Corp.",
        "Northwest Bronx Community & Clergy Coalition",
        "South East Bronx Community Development Corp.",
        "West Bronx Housing And Neighborhood Resources Center, Inc.",
        "Black Rock-Riverside Neighborhood Housing Services, Inc.",
        "Broadway-Fillmore Neighborhood Housing Services Inc.",
        "Citizens Alliance, Inc.",
        "Ellicott District Community Development, Inc.",
        "Fillmore-Leroy Area Residents, Inc.",
        "Heart Of The City Neighborhoods, Inc.",
        "Hispanos Unidos De Buffalo, Inc.",
        "Lackawanna Housing Development Corporation",
        "Lt. Col. Matt Urban Human Services Center Of Wny",
        "Neighborhood Housing Services Of South Buffalo, Inc.",
        "Neighborworks Home Resources",
        "Old 1St Ward Community Association, Inc.",
        "Southtowns Rural Preservation Company, Inc.",
        "West Side Neighborhood Housing Services, Inc.",
        "Astella Development Corporation",
        "Brighton Neighborhood Association Inc.",
        "Brooklyn Housing And Family Services, Inc.",
        "Brooklyn Neighborhood Improvement Association Inc.",
        "Carroll Gardens Association, Inc.",
        "Community Organization Of Southern Brooklyn, Inc.",
        "Crown Heights Jewish Community Council, Inc.",
        "Cypress Hills Local Development Corporation",
        "East New York Urban Youth Corps Inc.",
        "Erasmus Neighborhood Federation, Inc.",
        "Fifth Avenue Committee, Inc.",
        "Flatbush Development Corp.",
        "Gowanus Canal Community Development Corporation",
        "Greater Sheepshead Bay Development Corp.",
        "Ldc Of Crown Heights",
        "Los Sures Community Development Company, Inc.",
        "Midwood Development Corp.",
        "Neighbors Helping Neighbors, Inc.",
        "Nhs Of East Flatbush",
        "North Brooklyn Development Corp.",
        "Northeast Brooklyn Housing Development Corp.",
        "Ocean Parkway Community Development Corp.",
        "Pratt Area Community Council",
        "Ridgewood Bushwick Senior Citizens Council, Inc.",
        "St. Nicks Alliance Corp.",
        "116 Street Block Association, Inc.",
        "Clinton Housing Development Co. Inc.",
        "Community League Of The Heights",
        "Cooper Square Cd Committee & Businessmen'S Association, Inc.",
        "Downtown Manhattan Community Development Corp.",
        "Ecumenical Community Development Organization",
        "El Barrio'S Operation Fight-Back",
        "Good Old Lower East Side, Inc.",
        "Hellgate Management Corp.",
        "Hope Community, Inc.",
        "Housing Conservation Coordinators, Inc.",
        "Lower East Side Coalition Housing Development, Inc.",
        "Manhattan Valley Development Corporation",
        "Mfy Legal Services, Inc.",
        "Northern Manhattan Improvement Corp.",
        "Nuevo El Barrio Para La Rehab De La Vivienda Y La Economia",
        "Sinergia, Inc.",
        "Strycker'S Bay Neighborhood Council",
        "United Jewish Council Of The East Side, Inc.",
        "Washington Heights Inwood Preservation And Restoration Corp.",
        "West Harlem Group Assistance, Inc.",
        "West Side Federation For Senior And Supportive Housing, Inc.",
        "Wilson Major Morris Community Center, Inc.",
        "Allen Ame Neighborhood Preservation And Development Corp.",
        "Astoria Restoration Association, Inc.",
        "Central Astoria Local Development Coalition, Inc.",
        "Jewish Community Council Of The Rockaway Peninsula",
        "Margert Community Corp.",
        "Neighborhood Housing Services Of Northern Queens",
        "Nhs Of Jamaica, Inc.",
        "Northwest Queens Housing Corp.",
        "Queens Community House, Inc.",
        "Rockaway Development & Revitalization Corp.",
        "The Greater Ridgewood Restoration Corporation",
        "Woodside On The Move, Inc.",
        "Nhs Of Staten Island, Inc.",
        "Northfield Community Local Development Corporation",
        "Richmond Senior Services, Inc.",
        "Rcdc Housing, Inc.",
        "Rockland County Development Council, Inc.",
        "Human Development Services Of Westchester",
        "Interfaith Council For Action, Inc.",
        "Mount Vernon United Tenants",
        "North Yonkers Preservation & Development Corp.",
        "The Preservation Company, Inc.",
        "Washingtonville Housing Alliance, Inc.",
        "Westhab In Yonkers, Inc."
      ],
      "b": [
        "Brighton Neighborhood Association Inc.",
        "Crown Heights Jewish Community Council, Inc.",
        "Erasmus Neighborhood Federation, Inc.",
        "Fifth Avenue Committee, Inc.",
        "Flatbush Development Corp.",
        "Brooklyn Housing And Family Services, Inc.",
        "Good Old Lower East Side, Inc.",
        "Gowanus Canal Community Development Corporation",
        "The Greater Ridgewood Restoration Corporation",
        "Housing Conservation Coordinators, Inc.",
        "North Brooklyn Development Corp.",
        "North Yonkers Preservation & Development Corp.",
        "Ocean Parkway Community Development Corp.",
        "Pratt Area Community Council",
        "Ridgewood Bushwick Senior Citizens Council, Inc.",
        "New York State Rural Housing Coalition",
        "University District Community Development Association, Inc.",
        "Woodside On The Move, Inc.",
        "116 Street Block Association, Inc.",
        "163Rd Street Improvement Council, Inc.",
        "Albany Housing Coalition, Inc.",
        "Astella Development Corporation",
        "Astoria Restoration Association, Inc.",
        "Belmont Arthur Avenue Local Development Corp.",
        "Better Neighborhoods, Inc.",
        "Black Rock-Riverside Neighborhood Housing Services, Inc.",
        "Broadway-Fillmore Neighborhood Housing Services Inc.",
        "Bronx Shepherds Restoration Corp.",
        "Carroll Gardens Association, Inc.",
        "Center City Neighborhood Development Corporation",
        "Central Islip Civic Council, Inc.",
        "Clinton Housing Development Co. Inc.",
        "Coalition Of North East Associations Inc.",
        "Community League Of The Heights",
        "Cooper Square Cd Committee & Businessmen'S Association, Inc.",
        "Cypress Hills Local Development Corporation",
        "El Barrio'S Operation Fight-Back",
        "Ellicott District Community Development, Inc.",
        "Fillmore-Leroy Area Residents, Inc.",
        "First Ward Action Council, Inc.",
        "Fordham Bedford Housing Corporation",
        "Queens Community House, Inc.",
        "Greater Sheepshead Bay Development Corp.",
        "Hellgate Management Corp.",
        "The Hispanic Brotherhood Of Rockville Centre, Inc.",
        "Hope Community, Inc.",
        "Housing Help, Inc.",
        "Human Development Services Of Westchester",
        "Interfaith Council For Action, Inc.",
        "Ithaca Neighborhood Housing Services, Inc.",
        "Jewish Community Council Of The Rockaway Peninsula",
        "Los Sures Community Development Company, Inc.",
        "Lower East Side Coalition Housing Development, Inc.",
        "Mfy Legal Services, Inc.",
        "Manhattan Valley Development Corporation",
        "Margert Community Corp.",
        "Marketview Heights Association, Inc.",
        "Metro Interfaith Housing Management Corp.",
        "Mid-Bronx Senior Citizens Council, Inc.",
        "Midwood Development Corp.",
        "Montgomery Neighborhood Center, Inc.",
        "Morrisania Revitalization Corporation, Inc.",
        "Nuevo El Barrio Para La Rehab De La Vivienda Y La Economia",
        "Nhs Of East Flatbush",
        "Nhs Of Jamaica, Inc.",
        "Neighborhood Housing Services Of South Buffalo, Inc.",
        "Nhs Of Staten Island, Inc.",
        "Neighborhood Housing Services Of North Bronx, Inc.",
        "Near Westside Neighborhood Association, Inc.",
        "Neighborhood Association For Intercultural Affairs",
        "Neighborhood Initiatives Development Corp.",
        "North East Area Development, Inc.",
        "Northfield Community Local Development Corporation",
        "Northwest Bronx Community & Clergy Coalition",
        "Ncs Community Development Corp.",
        "Northwest Queens Housing Corp.",
        "Lt. Col. Matt Urban Human Services Center Of Wny",
        "Regional Economic Community Action Program, Inc.",
        "Rockland County Development Council, Inc.",
        "South East Bronx Community Development Corp.",
        "South East Area Coalition, Inc.",
        "South End Improvement Corp.",
        "South Wedge Planning Committee, Inc.",
        "Spanish Action League Of Onondaga County, Inc.",
        "Strycker'S Bay Neighborhood Council",
        "Suburban Housing Development & Research, Inc.",
        "Syracuse United Neighbors, Inc.",
        "Tap, Inc.",
        "United Jewish Council Of The East Side, Inc.",
        "United Tenants Of Albany, Inc.",
        "Utica Neighborhood Housing Services, Inc.",
        "Washington Heights Inwood Preservation And Restoration Corp.",
        "Washingtonville Housing Alliance, Inc.",
        "West Bronx Housing And Neighborhood Resources Center, Inc.",
        "West Harlem Group Assistance, Inc.",
        "West Side Federation For Senior And Supportive Housing, Inc.",
        "Wyandanch Community Development Corp.",
        "Albany County Rural Housing Alliance, Inc.",
        "Alfred Housing Committee, Inc.",
        "Allegany County Community Opportunity And Rural Development",
        "Andover Historic Preservation Corp.",
        "Bellport Hagerman East Patchogue Alliance, Inc.",
        "Better Housing For Tompkins County Inc.",
        "Bishop Sheen Ecumenical Housing Foundation, Inc.",
        "Catskill Mountain Housing Development Corp. Inc.",
        "Cayuga County Homsite Development Corp.",
        "Chautauqua Home Rehabilitation And Improvement Corp.",
        "Chautauqua Opportunities Inc.",
        "Clayton Improvement Association Ltd.",
        "Community Progress Inc.",
        "Cortland Housing Assistance Council Inc.",
        "Cuba Community Development Corporation",
        "Delaware Opportunities Inc.",
        "Franklin County Community Housing Council, Inc.",
        "Friends Of The North Country, Inc.",
        "Frontier Housing Corporation",
        "Genesee Valley Rural Preservation Council, Inc.",
        "Housing Assistance Program Of Essex County, Inc.",
        "Housing Resources Of Columbia County, Inc.",
        "Keuka Housing Council, Inc.",
        "M-Ark Project, Inc.",
        "Niagara Community Action Program, Inc.",
        "North Country Affordable Housing, Inc.",
        "Mohawk Valley Community Action Agency, Inc.",
        "Oswego Housing Development Council, Inc.",
        "Otsego Rural Housing Assistance, Inc.",
        "Putnam County Housing Corp.",
        "Rensselaer County Housing Resources",
        "Rural Sullivan Housing Corporation",
        "Rupco, Inc.",
        "Saratoga County Rural Preservation Co.",
        "Schoharie County Rural Preservation Corp.",
        "Sepp, Inc.",
        "Snow Belt Housing Company, Inc.",
        "Southern Hills Preservation Corp.",
        "Southtowns Rural Preservation Company, Inc.",
        "St Lawrence County Housing Council, Inc.",
        "Stoneleigh Housing, Inc.",
        "Community Services Programs Inc.",
        "Western Catskills Community Revitalization Council, Inc.",
        "Tioga Opportunities, Inc.",
        "Mohawk Indian Housing Corp.",
        "North Fork Housing Alliance, Inc.",
        "Scap D/B/A Arbor Development",
        "Neighborworks Home Resources",
        "Wilson Major Morris Community Center, Inc.",
        "Neighbors Of Watertown, Inc.",
        "Syracuse Model Neighborhood Corporation",
        "Community Action In Self-Help, Inc.",
        "Citizens Opportunity For Development & Equality Inc.",
        "Homsite Fund, Inc.",
        "Group 14621 Community Association, Inc.",
        "Mount Vernon United Tenants",
        "Hudson River Housing, Inc.",
        "Ecumenical Community Development Organization",
        "La Fuerza Unida, Inc",
        "Nhs Of Rochester Dba Neighborworks Rochester",
        "Old 1St Ward Community Association, Inc.",
        "Richmond Senior Services, Inc.",
        "Hempstead Hispanic Civic Association, Inc.",
        "Niagara Falls Neighborhood Housing Services, Inc.",
        "Orange County Rural Development Advisory Corp.",
        "Northeast Brooklyn Housing Development Corp.",
        "East New York Urban Youth Corps Inc.",
        "Fulton County Community Heritage Corp.",
        "Arbor Hill Development Corp.",
        "Mount Hope Housing Co, Inc.",
        "Nehda, Inc.",
        "Troy Rehabilitation And Improvement Program",
        "West Side Neighborhood Housing Services, Inc.",
        "Neighborhood Preservation Coalition Of Nys, Inc.",
        "Cattaraugus Community Action, Inc.",
        "Northern Manhattan Improvement Corp.",
        "Brooklyn Neighborhood Improvement Association Inc.",
        "Rcdc Housing, Inc.",
        "Pride Of Ticonderoga, Inc."
      ],
      "a_and_b": [
        "Albany County Rural Housing Alliance, Inc.",
        "Albany Housing Coalition, Inc.",
        "Arbor Hill Development Corp.",
        "South End Improvement Corp.",
        "United Tenants Of Albany, Inc.",
        "163Rd Street Improvement Council, Inc.",
        "Belmont Arthur Avenue Local Development Corp.",
        "Bronx Shepherds Restoration Corp.",
        "Fordham Bedford Housing Corporation",
        "Mid-Bronx Senior Citizens Council, Inc.",
        "Morrisania Revitalization Corporation, Inc.",
        "Mount Hope Housing Co, Inc.",
        "Neighborhood Association For Intercultural Affairs",
        "Neighborhood Housing Services Of North Bronx, Inc.",
        "Neighborhood Initiatives Development Corp.",
        "Northwest Bronx Community & Clergy Coalition",
        "South East Bronx Community Development Corp.",
        "West Bronx Housing And Neighborhood Resources Center, Inc.",
        "Black Rock-Riverside Neighborhood Housing Services, Inc.",
        "Broadway-Fillmore Neighborhood Housing Services Inc.",
        "Ellicott District Community Development, Inc.",
        "Fillmore-Leroy Area Residents, Inc.",
        "Lt. Col. Matt Urban Human Services Center Of Wny",
        "Neighborhood Housing Services Of South Buffalo, Inc.",
        "Neighborworks Home Resources",
        "Old 1St Ward Community Association, Inc.",
        "Southtowns Rural Preservation Company, Inc.",
        "West Side Neighborhood Housing Services, Inc.",
        "Astella Development Corporation",
        "Brighton Neighborhood Association Inc.",
        "Brooklyn Housing And Family Services, Inc.",
        "Brooklyn Neighborhood Improvement Association Inc.",
        "Carroll Gardens Association, Inc.",
        "Crown Heights Jewish Community Council, Inc.",
        "Cypress Hills Local Development Corporation",
        "East New York Urban Youth Corps Inc.",
        "Erasmus Neighborhood Federation, Inc.",
        "Fifth Avenue Committee, Inc.",
        "Flatbush Development Corp.",
        "Gowanus Canal Community Development Corporation",
        "Greater Sheepshead Bay Development Corp.",
        "Los Sures Community Development Company, Inc.",
        "Midwood Development Corp.",
        "Nhs Of East Flatbush",
        "North Brooklyn Development Corp.",
        "Northeast Brooklyn Housing Development Corp.",
        "Ocean Parkway Community Development Corp.",
        "Pratt Area Community Council",
        "Ridgewood Bushwick Senior Citizens Council, Inc.",
        "116 Street Block Association, Inc.",
        "Clinton Housing Development Co. Inc.",
        "Community League Of The Heights",
        "Cooper Square Cd Committee & Businessmen'S Association, Inc.",
        "Ecumenical Community Development Organization",
        "El Barrio'S Operation Fight-Back",
        "Good Old Lower East Side, Inc.",
        "Hellgate Management Corp.",
        "Hope Community, Inc.",
        "Housing Conservation Coordinators, Inc.",
        "Lower East Side Coalition Housing Development, Inc.",
        "Manhattan Valley Development Corporation",
        "Mfy Legal Services, Inc.",
        "Northern Manhattan Improvement Corp.",
        "Nuevo El Barrio Para La Rehab De La Vivienda Y La Economia",
        "Strycker'S Bay Neighborhood Council",
        "United Jewish Council Of The East Side, Inc.",
        "Washington Heights Inwood Preservation And Restoration Corp.",
        "West Harlem Group Assistance, Inc.",
        "West Side Federation For Senior And Supportive Housing, Inc.",
        "Wilson Major Morris Community Center, Inc.",
        "Astoria Restoration Association, Inc.",
        "Jewish Community Council Of The Rockaway Peninsula",
        "Margert Community Corp.",
        "Nhs Of Jamaica, Inc.",
        "Northwest Queens Housing Corp.",
        "Queens Community House, Inc.",
        "The Greater Ridgewood Restoration Corporation",
        "Woodside On The Move, Inc.",
        "Nhs Of Staten Island, Inc.",
        "Northfield Community Local Development Corporation",
        "Richmond Senior Services, Inc.",
        "Rcdc Housing, Inc.",
        "Rockland County Development Council, Inc.",
        "Human Development Services Of Westchester",
        "Interfaith Council For Action, Inc.",
        "Mount Vernon United Tenants",
        "North Yonkers Preservation & Development Corp.",
        "Washingtonville Housing Alliance, Inc."
      ],
      "a_not_in_b": [
        "Mbd Community Housing Corporation",
        "Citizens Alliance, Inc.",
        "Heart Of The City Neighborhoods, Inc.",
        "Hispanos Unidos De Buffalo, Inc.",
        "Lackawanna Housing Development Corporation",
        "Community Organization Of Southern Brooklyn, Inc.",
        "Ldc Of Crown Heights",
        "Neighbors Helping Neighbors, Inc.",
        "St. Nicks Alliance Corp.",
        "Downtown Manhattan Community Development Corp.",
        "Sinergia, Inc.",
        "Allen Ame Neighborhood Preservation And Development Corp.",
        "Central Astoria Local Development Coalition, Inc.",
        "Neighborhood Housing Services Of Northern Queens",
        "Rockaway Development & Revitalization Corp.",
        "The Preservation Company, Inc.",
        "Westhab In Yonkers, Inc."
      ],
      "b_not_in_a": [
        "New York State Rural Housing Coalition",
        "University District Community Development Association, Inc.",
        "Better Neighborhoods, Inc.",
        "Center City Neighborhood Development Corporation",
        "Central Islip Civic Council, Inc.",
        "Coalition Of North East Associations Inc.",
        "First Ward Action Council, Inc.",
        "The Hispanic Brotherhood Of Rockville Centre, Inc.",
        "Housing Help, Inc.",
        "Ithaca Neighborhood Housing Services, Inc.",
        "Marketview Heights Association, Inc.",
        "Metro Interfaith Housing Management Corp.",
        "Montgomery Neighborhood Center, Inc.",
        "Near Westside Neighborhood Association, Inc.",
        "North East Area Development, Inc.",
        "Ncs Community Development Corp.",
        "Regional Economic Community Action Program, Inc.",
        "South East Area Coalition, Inc.",
        "South Wedge Planning Committee, Inc.",
        "Spanish Action League Of Onondaga County, Inc.",
        "Suburban Housing Development & Research, Inc.",
        "Syracuse United Neighbors, Inc.",
        "Tap, Inc.",
        "Utica Neighborhood Housing Services, Inc.",
        "Wyandanch Community Development Corp.",
        "Alfred Housing Committee, Inc.",
        "Allegany County Community Opportunity And Rural Development",
        "Andover Historic Preservation Corp.",
        "Bellport Hagerman East Patchogue Alliance, Inc.",
        "Better Housing For Tompkins County Inc.",
        "Bishop Sheen Ecumenical Housing Foundation, Inc.",
        "Catskill Mountain Housing Development Corp. Inc.",
        "Cayuga County Homsite Development Corp.",
        "Chautauqua Home Rehabilitation And Improvement Corp.",
        "Chautauqua Opportunities Inc.",
        "Clayton Improvement Association Ltd.",
        "Community Progress Inc.",
        "Cortland Housing Assistance Council Inc.",
        "Cuba Community Development Corporation",
        "Delaware Opportunities Inc.",
        "Franklin County Community Housing Council, Inc.",
        "Friends Of The North Country, Inc.",
        "Frontier Housing Corporation",
        "Genesee Valley Rural Preservation Council, Inc.",
        "Housing Assistance Program Of Essex County, Inc.",
        "Housing Resources Of Columbia County, Inc.",
        "Keuka Housing Council, Inc.",
        "M-Ark Project, Inc.",
        "Niagara Community Action Program, Inc.",
        "North Country Affordable Housing, Inc.",
        "Mohawk Valley Community Action Agency, Inc.",
        "Oswego Housing Development Council, Inc.",
        "Otsego Rural Housing Assistance, Inc.",
        "Putnam County Housing Corp.",
        "Rensselaer County Housing Resources",
        "Rural Sullivan Housing Corporation",
        "Rupco, Inc.",
        "Saratoga County Rural Preservation Co.",
        "Schoharie County Rural Preservation Corp.",
        "Sepp, Inc.",
        "Snow Belt Housing Company, Inc.",
        "Southern Hills Preservation Corp.",
        "St Lawrence County Housing Council, Inc.",
        "Stoneleigh Housing, Inc.",
        "Community Services Programs Inc.",
        "Western Catskills Community Revitalization Council, Inc.",
        "Tioga Opportunities, Inc.",
        "Mohawk Indian Housing Corp.",
        "North Fork Housing Alliance, Inc.",
        "Scap D/B/A Arbor Development",
        "Neighbors Of Watertown, Inc.",
        "Syracuse Model Neighborhood Corporation",
        "Community Action In Self-Help, Inc.",
        "Citizens Opportunity For Development & Equality Inc.",
        "Homsite Fund, Inc.",
        "Group 14621 Community Association, Inc.",
        "Hudson River Housing, Inc.",
        "La Fuerza Unida, Inc",
        "Nhs Of Rochester Dba Neighborworks Rochester",
        "Hempstead Hispanic Civic Association, Inc.",
        "Niagara Falls Neighborhood Housing Services, Inc.",
        "Orange County Rural Development Advisory Corp.",
        "Fulton County Community Heritage Corp.",
        "Nehda, Inc.",
        "Troy Rehabilitation And Improvement Program",
        "Neighborhood Preservation Coalition Of Nys, Inc.",
        "Cattaraugus Community Action, Inc.",
        "Pride Of Ticonderoga, Inc."
      ]
    },
    "prose": {
      "summary": "88 rows matched in A and B. 17 rows in A not in B. 88 rows in B not in A. ",
      "full": "Matches in A and B: Albany County Rural Housing Alliance, Inc., Albany Housing Coalition, Inc., Arbor Hill Development Corp., South End Improvement Corp., United Tenants Of Albany, Inc., 163Rd Street Improvement Council, Inc., Belmont Arthur Avenue Local Development Corp., Bronx Shepherds Restoration Corp., Fordham Bedford Housing Corporation, Mid-Bronx Senior Citizens Council, Inc., Morrisania Revitalization Corporation, Inc., Mount Hope Housing Co, Inc., Neighborhood Association For Intercultural Affairs, Neighborhood Housing Services Of North Bronx, Inc., Neighborhood Initiatives Development Corp., Northwest Bronx Community & Clergy Coalition, South East Bronx Community Development Corp., West Bronx Housing And Neighborhood Resources Center, Inc., Black Rock-Riverside Neighborhood Housing Services, Inc., Broadway-Fillmore Neighborhood Housing Services Inc., Ellicott District Community Development, Inc., Fillmore-Leroy Area Residents, Inc., Lt. Col. Matt Urban Human Services Center Of Wny, Neighborhood Housing Services Of South Buffalo, Inc., Neighborworks Home Resources, Old 1St Ward Community Association, Inc., Southtowns Rural Preservation Company, Inc., West Side Neighborhood Housing Services, Inc., Astella Development Corporation, Brighton Neighborhood Association Inc., Brooklyn Housing And Family Services, Inc., Brooklyn Neighborhood Improvement Association Inc., Carroll Gardens Association, Inc., Crown Heights Jewish Community Council, Inc., Cypress Hills Local Development Corporation, East New York Urban Youth Corps Inc., Erasmus Neighborhood Federation, Inc., Fifth Avenue Committee, Inc., Flatbush Development Corp., Gowanus Canal Community Development Corporation, Greater Sheepshead Bay Development Corp., Los Sures Community Development Company, Inc., Midwood Development Corp., Nhs Of East Flatbush, North Brooklyn Development Corp., Northeast Brooklyn Housing Development Corp., Ocean Parkway Community Development Corp., Pratt Area Community Council, Ridgewood Bushwick Senior Citizens Council, Inc., 116 Street Block Association, Inc., Clinton Housing Development Co. Inc., Community League Of The Heights, Cooper Square Cd Committee & Businessmen'S Association, Inc., Ecumenical Community Development Organization, El Barrio'S Operation Fight-Back, Good Old Lower East Side, Inc., Hellgate Management Corp., Hope Community, Inc., Housing Conservation Coordinators, Inc., Lower East Side Coalition Housing Development, Inc., Manhattan Valley Development Corporation, Mfy Legal Services, Inc., Northern Manhattan Improvement Corp., Nuevo El Barrio Para La Rehab De La Vivienda Y La Economia, Strycker'S Bay Neighborhood Council, United Jewish Council Of The East Side, Inc., Washington Heights Inwood Preservation And Restoration Corp., West Harlem Group Assistance, Inc., West Side Federation For Senior And Supportive Housing, Inc., Wilson Major Morris Community Center, Inc., Astoria Restoration Association, Inc., Jewish Community Council Of The Rockaway Peninsula, Margert Community Corp., Nhs Of Jamaica, Inc., Northwest Queens Housing Corp., Queens Community House, Inc., The Greater Ridgewood Restoration Corporation, Woodside On The Move, Inc., Nhs Of Staten Island, Inc., Northfield Community Local Development Corporation, Richmond Senior Services, Inc., Rcdc Housing, Inc., Rockland County Development Council, Inc., Human Development Services Of Westchester, Interfaith Council For Action, Inc., Mount Vernon United Tenants, North Yonkers Preservation & Development Corp., Washingtonville Housing Alliance, Inc.. A not in B: Mbd Community Housing Corporation, Citizens Alliance, Inc., Heart Of The City Neighborhoods, Inc., Hispanos Unidos De Buffalo, Inc., Lackawanna Housing Development Corporation, Community Organization Of Southern Brooklyn, Inc., Ldc Of Crown Heights, Neighbors Helping Neighbors, Inc., St. Nicks Alliance Corp., Downtown Manhattan Community Development Corp., Sinergia, Inc., Allen Ame Neighborhood Preservation And Development Corp., Central Astoria Local Development Coalition, Inc., Neighborhood Housing Services Of Northern Queens, Rockaway Development & Revitalization Corp., The Preservation Company, Inc., Westhab In Yonkers, Inc.. B not in A: New York State Rural Housing Coalition, University District Community Development Association, Inc., Better Neighborhoods, Inc., Center City Neighborhood Development Corporation, Central Islip Civic Council, Inc., Coalition Of North East Associations Inc., First Ward Action Council, Inc., The Hispanic Brotherhood Of Rockville Centre, Inc., Housing Help, Inc., Ithaca Neighborhood Housing Services, Inc., Marketview Heights Association, Inc., Metro Interfaith Housing Management Corp., Montgomery Neighborhood Center, Inc., Near Westside Neighborhood Association, Inc., North East Area Development, Inc., Ncs Community Development Corp., Regional Economic Community Action Program, Inc., South East Area Coalition, Inc., South Wedge Planning Committee, Inc., Spanish Action League Of Onondaga County, Inc., Suburban Housing Development & Research, Inc., Syracuse United Neighbors, Inc., Tap, Inc., Utica Neighborhood Housing Services, Inc., Wyandanch Community Development Corp., Alfred Housing Committee, Inc., Allegany County Community Opportunity And Rural Development, Andover Historic Preservation Corp., Bellport Hagerman East Patchogue Alliance, Inc., Better Housing For Tompkins County Inc., Bishop Sheen Ecumenical Housing Foundation, Inc., Catskill Mountain Housing Development Corp. Inc., Cayuga County Homsite Development Corp., Chautauqua Home Rehabilitation And Improvement Corp., Chautauqua Opportunities Inc., Clayton Improvement Association Ltd., Community Progress Inc., Cortland Housing Assistance Council Inc., Cuba Community Development Corporation, Delaware Opportunities Inc., Franklin County Community Housing Council, Inc., Friends Of The North Country, Inc., Frontier Housing Corporation, Genesee Valley Rural Preservation Council, Inc., Housing Assistance Program Of Essex County, Inc., Housing Resources Of Columbia County, Inc., Keuka Housing Council, Inc., M-Ark Project, Inc., Niagara Community Action Program, Inc., North Country Affordable Housing, Inc., Mohawk Valley Community Action Agency, Inc., Oswego Housing Development Council, Inc., Otsego Rural Housing Assistance, Inc., Putnam County Housing Corp., Rensselaer County Housing Resources, Rural Sullivan Housing Corporation, Rupco, Inc., Saratoga County Rural Preservation Co., Schoharie County Rural Preservation Corp., Sepp, Inc., Snow Belt Housing Company, Inc., Southern Hills Preservation Corp., St Lawrence County Housing Council, Inc., Stoneleigh Housing, Inc., Community Services Programs Inc., Western Catskills Community Revitalization Council, Inc., Tioga Opportunities, Inc., Mohawk Indian Housing Corp., North Fork Housing Alliance, Inc., Scap D/B/A Arbor Development, Neighbors Of Watertown, Inc., Syracuse Model Neighborhood Corporation, Community Action In Self-Help, Inc., Citizens Opportunity For Development & Equality Inc., Homsite Fund, Inc., Group 14621 Community Association, Inc., Hudson River Housing, Inc., La Fuerza Unida, Inc, Nhs Of Rochester Dba Neighborworks Rochester, Hempstead Hispanic Civic Association, Inc., Niagara Falls Neighborhood Housing Services, Inc., Orange County Rural Development Advisory Corp., Fulton County Community Heritage Corp., Nehda, Inc., Troy Rehabilitation And Improvement Program, Neighborhood Preservation Coalition Of Nys, Inc., Cattaraugus Community Action, Inc., Pride Of Ticonderoga, Inc.. "
    }
  }
}