{
  "HCR Community Based Housing Org details": [
    {
      "website url": "http://www.brightonbeach.com",
      "phone no.": "(718) 891-0800",
      "contact person": "PAT SINGER",
      "title": "Brighton Neighborhood Association Inc.",
      "service area": "BRIGHTON BEACH",
      "address": "1121 BRIGHTON BEACH AVE BROOKLYN, NY 11235",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=9",
      "email": "bnapsinger@aol.com",
      "description": "The Brighton Neighborhood Association (BNA) evolved from a grassroots movement to declare war against neighborhood deterioration. Since 1979, BNA has been instrumental in expediting the assimilation of multiple immigrant populations through advocacy and education. Current activities include tenant advocacy, crime prevention, encouragement of commercial revitalization, and advocacy for all segments of the Brighton community."
    },
    {
      "website url": "http://www.chcentral.org",
      "phone no.": "(718) 771-9000",
      "contact person": "RABBI ELI COHEN",
      "title": "Crown Heights Jewish Community Council, Inc.",
      "service area": "CROWN HEIGHTS",
      "address": "392 KINGSTON AVE BROOKLYN, NY 11225",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=22",
      "email": "ecohen@chjcc.org",
      "description": "Crown Heights Jewish Community Council (CHJCC) is a private, nonprofit social service agency serving one of the most diverse and challenging neighborhoods in New York City. The agency was formed in 1969 in response to deteriorating social and economic conditions in the neighborhood. The population of the 116-city block cache area known as Crown Heights is comprised of persons of many cultures and includes new immigrants.  According to the 1990 census, incomes tend to be low - often below poverty levels.  Housing is mostly old (circa 1900 - 1930) and at a premium. CHJCC administers programs, advocates for clients, and provides referrals on issues of housing, employment, economic development, entitlements, problems of the aging, aid to crime victims, assistance for indigent residents. CHJCC has created multi-racial, faith, and community-based programs such as Project Care, which unites civic and religious leaders from every segment of the community in a funded program to promote efforts in social and economic development. Creative initiatives such as Project Care have addressed areas of common concern, and new avenues of communication and cooperation have emerged. One of the major goals of the CHJCC is to promote an atmosphere of understanding and cooperation in the community.  Areas of common concern, including housing, poverty, crime, employment, education and economic development, are being addressed through new programs."
    },
    {
      "website url": "",
      "phone no.": "(718) 462-7700",
      "contact person": "YVES VILUS",
      "title": "Erasmus Neighborhood Federation, Inc.",
      "service area": "EAST FLATBUSH",
      "address": "814 ROGERS AVE BROOKLYN, NY 11226",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=26",
      "email": "yves.vilus@erasmusfederation.org",
      "description": "Our organization has in place a two-year outside-funded self-development program to reinforce our community organizing capability-and as part of this funded effort we have been conducting community outreach to identify problems and opportunities for future effort.  These efforts give us a new, broader means of continual community assessment."
    },
    {
      "website url": "http://www.fifthave.org",
      "phone no.": "(718) 237-2017",
      "contact person": "MICHELLE DE LA UZ",
      "title": "Fifth Avenue Committee, Inc.",
      "service area": "LOWER PARK SLOPE",
      "address": "621 DEGRAW ST BROOKLYN, NY 11217",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=28",
      "email": "mdelauz@fifthave.org",
      "description": "Fifth Avenue Committee, Inc. (FAC) is a not-for-profit, community-based organization in lower Park Slope and South Brooklyn. Our mission is to advance social and economic justice in South Brooklyn, principally by developing and managing affordable housing, creating employment opportunities, organizing residents and workers, and combating displacement caused by gentrification. Our programs in the area of housing include: developing, managing, and preserving affordable housing for lower-income families and helping tenants achieve resident ownership.  In the category of community economic development, we create \"community enterprises\" that provide employment, training, and career development opportunities; help people with job searches; and assist area merchants and entrepreneurs. As organizers and advocates, we help tenants, workers, and residents understand their rights and  how to organize to improve their opportunities.  In the area of criminal justice, our programs help ex-offenders reintegrate into the community through job and housing assistance, counseling, training, and leadership development programs. FAC is funded by over 50 different entities including private foundations, banks, corporations, and local, state, and federal government agencies.  In addition we have over 300 individual donors."
    },
    {
      "website url": "http://www.fdconline.org",
      "phone no.": "(718) 859-3800",
      "contact person": "ROBIN REDMOND",
      "title": "Flatbush Development Corp.",
      "service area": "FLATBUSH",
      "address": "1616 NEWKIRK AVE BROOKLYN, NY 11226",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=29",
      "email": "rredmond@fdconline.org",
      "description": "Flatbush Development Corporation's (FDC) primary mission is to improve the quality of life for all residents of Flatbush. By counseling individual tenants and organizing tenant associations, FDC helps to stabilize the parts of the neighborhood that are dense with apartment buildings. The organization works with low-to-moderate income owners of small homes, providing them with critical information on the importance of proper maintenance and financial planning, ensuring that they remain in their homes as strong, sound homeowners. FDC also reaches out to shareholders in the many troubled, over-leveraged co-operative apartment buildings in Flatbush and works with them to help stabilize management and financial operations of their buildings, explain rights and responsibilities, and teach home maintenance and repair courses. FDC also plays a role in the larger community; facilitating the overall growth and development of the Flatbush community by developing a 5-year strategic plan, in coordination with local residents and government officials to provide workshops, seminars and a regular newsletter about issues of concern to residents. In addition, FDC works to revitalize the area's commercial strips by advocating for filling of vacant commercial space, convincing new businesses to expand or relocate to Flatbush, and by convincing other businesses to remain by advocating on behalf of existing local businesses and working with local merchant associations to improve the business climate on retail strips."
    },
    {
      "website url": "http://brooklynhousing.org",
      "phone no.": "(718) 435-7585",
      "contact person": "LARRY JAYSON",
      "title": "Brooklyn Housing And Family Services, Inc.",
      "service area": "OCEAN PARKWAY/MIDWOOD JUNCTION",
      "address": "415 ALBEMARLE RD BROOKLYN, NY 11218",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=30",
      "email": "carol@brooklynhousing.org",
      "description": "The mission of Brooklyn Housing & Family Services is:"
    },
    {
      "website url": "",
      "phone no.": "(212) 358-1231",
      "contact person": "DAMARIS REYES",
      "title": "Good Old Lower East Side, Inc.",
      "service area": "LOWER EAST SIDE",
      "address": "169 AVENUE B NEW YORK, NY 10009",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=34",
      "email": "info@goles.org",
      "description": "GOLES is a non-profit housing advocacy organization committed to the preservation of low and moderate income housing. Affordable housing continues to shrink on the Lower East Side in every housing sector. This assault on housing is most conspicuous in the privately owned rent regulated stock where the conversion to market rate luxury housing is happening at an alarming rate leading to more homelessness and displacement.  According to GOLES' in house intake survey, there has been a 15% increase since the same period last year in the litigation activity against tenants in the form of non-payment, holdover, and nuisance cases."
    },
    {
      "website url": "http://www.gowanus.org",
      "phone no.": "(718) 858-0557",
      "contact person": "JOSEPH MESSINEO",
      "title": "Gowanus Canal Community Development Corporation",
      "service area": "GOWANUS CANAL",
      "address": "201 COLUMBIA ST BROOKLYN, NY 11231",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=35",
      "email": "jmessineo@gowanus.org",
      "description": "Gowanus Canal Community Development Corporation of the Carroll Gardens area of Brooklyn was founded in 1979 to provide stable, healthy, and affordable living environments for low and moderate income households.  During the last twenty years, the organization has assisted and sponsored development of several buildings in the community including a 100-unit senior citizen residence. Our most recent project was a 90-unit gut rehab converting a vacant parochial school into below-market rentals. Gowanus Canal CDC performs the following activities: tenant/client assistance, loan program assistance, homeownership counseling, research/outreach, organizational development, and environmental clean-up activities to promote the development of economic, housing, and recreational projects. We have also added a Computer Training Center for single parents recently taken off the welfare rolls."
    },
    {
      "website url": "http://www.ridgewoodrestoration.org",
      "phone no.": "(718) 366-8721",
      "contact person": "ANGELA MIRABILE",
      "title": "The Greater Ridgewood Restoration Corporation",
      "service area": "RIDGEWOOD/MASPETH/GLENDALE/MIDDLE VILLAGE",
      "address": "68-56 FOREST AVE RIDGEWOOD, NY 11385",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=36",
      "email": "angelam@ridgewoodrestoration.org",
      "description": "Greater Ridgewood Restoration Corporation was founded in 1975 by civic and community leaders who were concerned by the spread of deterioration from surrounding communities. Their goal was to stabilize, preserve, and upgrade the housing stock of Queens Community Board 5.  To insure neighborhood stability and improvement, GRRC provides the following services:  landlord/tenant counseling; identification and correction of in-rem/problem buildings, anti-graffiti cleaning program, and marketing of low-interest loans and grants.  All of our programs focus on neighborhood housing to stabilize and upgrade buildings and insure tenants live in well-maintained, affordable, and safe homes; that landlords get help to maintain and upgrade their properties to prevent abandonment; and that quality of life is improved."
    },
    {
      "website url": "http://www.hcc-nyc.org",
      "phone no.": "(212) 541-5996",
      "contact person": "SARAH DESMOND",
      "title": "Housing Conservation Coordinators, Inc.",
      "service area": "CLINTON",
      "address": "777 TENTH AVE NEW YORK, NY 10019",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=42",
      "email": "sdesmond@hcc-nyc.org",
      "description": "Housing Conservation Coordinators, Inc. (HCC) is a not-for-profit housing advocacy agency serving the Clinton neighborhood of Manhattan.  HCC was formed in 1972 to promote safe, decent and affordable housing for low and moderate income tenants.  We provide comprehensive housing services to prevent homelessness, improve standards of living, and increase the availability of permanent, affordable housing.  HCC works collaboratively with a variety of neighborhood non-profits to better provide these services and to help residents access a wide range of social services.  Each year, we assist over 1,500 tenants through our five programs: homelessness prevention program, NYC HPD'S 7a administration program, weatherization assistance program, technical training classes, and  revolving loan program."
    },
    {
      "website url": "",
      "phone no.": "(718) 389-4078",
      "contact person": "RICHARD MAZUR",
      "title": "North Brooklyn Development Corp.",
      "service area": "GREENPOINT",
      "address": "148-50 HURON ST BROOKLYN, NY 11222",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=58",
      "email": "nbdc126@aol.com",
      "description": "North Brooklyn Development Corporation (NBDC), was organized in 1979 by civic and business leaders of Greenpoint for the purpose of promoting neighborhood stability, improving economic climate in the community, and building affordable housing. Guided by this mission and a firm understanding of Greenpoint's needs and character, NBDC has developed a strategy that includes programs in housing development and preservation, commercial and industrial development, and employment and education. NBDC has leveraged millions of dollars of public and private funds; it has worked successfully to establish public-private partnerships in community development; and has cooperated with other community groups and organizations who work to meet similar goals in Greenpoint. The purpose of NBDC's housing program is twofold: to preserve the existing housing stock and promote a stable and invested citizenry in Greenpoint and to develop affordable housing for the area's lowest income residents and through thus induce economic development. The former is achieved through the on-going services for homeowners and tenants that includes securing low-interest property rehabilitation loans; rent regulation education; property management and maintenance; landlord/tenant disputes; affordable housing referrals; and securing other housing entitlements. The latter is addressed by constantly looking for sites and means for developing new affordable housing units for the most needy residents. NBDC has also invested heavily into educating Greenpoint's youngsters. Annual After School Programs are run in five local schools providing warm and structured environment for over 450 children with supplemental tutoring in math and reading, arts& crafts workshops, sports and active recreation. NBDC's Community Achievement Project in Schools (CAPS) confronts truancy in schools, improves students' attendance and develops a closer level of communication between schools and families. Such diversified scope of services in addressing community needs allow NBDC to be a leader and promoter in positive change in Greenpoint community."
    },
    {
      "website url": "",
      "phone no.": "(914) 423-9754",
      "contact person": "ANGELA ASCOLILLO",
      "title": "North Yonkers Preservation & Development Corp.",
      "service area": "NORTHWEST YONKERS",
      "address": "219 RIDGE AVE YONKERS, NY 10703",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=61",
      "email": "northyonkerspreservation@yahoo.com",
      "description": "North Yonkers Preservation & Development Corporation is a not for profit community based organization.  The organization provides housing related assistance to residents of Northwest Yonkers.  We preserve and maintain the community by assisting tenants in upgrading their buildings, thereby stabilizing the neighborhood.  We inform residents in targeted areas through fliers, newspapers, church bulletins, and community events of their housing rights and guidelines.  Assistance is given to those who need help with housing problems due to lack of services such as heat, hot water, water leaks, evictions, and tenant/landlord problems. An annual meeting is held with public officials so that area residents may come and voice their concerns about housing conditions, problems, and needs in the neighborhood. To help stabilize the neighborhood, fire prevention, housing safety, crime prevention, recycling, and family health care seminars are conducted with local firefighters, public law officials, and city code enforcers. The organization also provides legal council and representation in housing court.  We provide individual counsel/referrals to tenants. A survey is now in progress to assess the needs of the community."
    },
    {
      "website url": "",
      "phone no.": "(718) 435-1300",
      "contact person": "TOM BAUER",
      "title": "Ocean Parkway Community Development Corp.",
      "service area": "KENSINGTON/OCEAN PARKWAY",
      "address": "4006 18TH AVE BROOKLYN, NY 11218",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=66",
      "email": "tbauer@sbcony.org",
      "description": "Ocean Parkway Community Development Corp. (OPCDC) is a grass-roots, multi-ethnic organization incorporated in 1979 to address the deterioration of housing in Kensington and along the Ocean Parkway corridor.  A diverse group of professionals and business people came together to create an agency that would focus its activities on neighborhood stabilization, revitalization, and improvement. The purpose of the Corporation is to aid in the development, rehabilitation, and preservation of local housing and make same available to low and moderate-income families. OPCDC's activities comprise a multi-faceted community-based approach that includes housing development, preservation, strengthening of neighborhoods by developing strong neighborhood associations, and assisting tenants and property owners with a variety of their housing needs."
    },
    {
      "website url": "http://www.prattarea.org",
      "phone no.": "(718) 522-2613",
      "contact person": "NAILA MOORE",
      "title": "Pratt Area Community Council",
      "service area": "CLINTON HILL/FORT GREENE",
      "address": "201 DEKALB AVE BROOKLYN, NY 11205",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=69",
      "email": "naila_moore@prattarea.org",
      "description": "Pratt Area Community Council (PACC) helps residents achieve self-sufficiency, create a sense of community, and realize overall neighborhood stabilization through community organizing; homeowner and tenant services; affordable housing development, commercial revitalization and responsible property management. We offer a wide range of programs designed to ensure that tenants, merchants and homeowners receive the support they need to rehabilitate vacant units, prevent building deterioration, access needed resources and avoid displacement. PACC counsels and mediates between tenants and landlords and organizes tenant and block associations.  As a HUD certified counseling agency, PACC counsels homeowners facing default and foreclosure, provides mortgage counseling, affordable mortgages and workshops to prospective homebuyers, and packages repair loan and grant applications for homeowners and small landlords.  Through our Healthy Homes Initiative, PACC educates tenants, homeowners and small landlords to the dangers of lead poisoning and other environmental hazards in the home.  Our economic development and commercial revitalization efforts on the Fulton Street corridor have brought grant dollars and business retention resources to small merchants, streetscape improvements, and through merchant organizing we have coordinated marketing efforts and led the way to the formation of a Business Improvement District.  Lastly, our affordable housing development provides apartments and homeownership opportunities to low and moderate income residents in the community and our asset and property management preserve and maintain the affordable housing we have produced."
    },
    {
      "website url": "http://www.rbscc.org",
      "phone no.": "(718) 366-3800",
      "contact person": "SCOTT SHORT",
      "title": "Ridgewood Bushwick Senior Citizens Council, Inc.",
      "service area": "BUSHWICK",
      "address": "555 BUSHWICK AVE BROOKLYN, NY 11206",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=76",
      "email": "sshort@rbscc.org",
      "description": "During this contract year,  Ridgewood Bushwick Senior Citizens Council, Inc. has progressed in our activities in several areas. First, we completed a 42-unit new building with HTF LIHTF tax credits. Second, another LIHTF project of 40 units went to closing and construction and neared 50% completion by the end of this contract. Third, we prepared an application for a third such project of 60 units and received notice of credits. Fourth, our Section 202 development of 82 units moved toward a final closing and construction. Finally, we completed rehabilitation of a 35-unit existing building that will preserve its surrounding area. On other fronts, we continued representing tenants and informing them of their legal rights. We also organized our community around a series of alleged arson incidents. We also completed sale of 19 two-family homes and moved forward to market an additional 150 homes."
    },
    {
      "website url": "http://www.ruralhousing.org",
      "phone no.": "not listed",
      "contact person": "not listed",
      "title": "New York State Rural Housing Coalition",
      "service area": "not listed",
      "address": "3RD FLOOR 79 N PEARL ST ALBANY, NY 12207",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=79",
      "email": "not listed",
      "description": ""
    },
    {
      "website url": "http://www.udcda.org",
      "phone no.": "not listed",
      "contact person": "not listed",
      "title": "University District Community Development Association, Inc.",
      "service area": "not listed",
      "address": "3242 MAIN ST BUFFALO, NY 14214",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=86",
      "email": "not listed",
      "description": ""
    },
    {
      "website url": "",
      "phone no.": "(718) 476-8449",
      "contact person": "ROSA REYES",
      "title": "Woodside On The Move, Inc.",
      "service area": "WOODSIDE",
      "address": "2ND FLOOR 39-42 59TH ST QUEENS, NY 11377",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=91",
      "email": "info@woodsideonthemove.org",
      "description": "Established in1978, Woodside On The Move, Inc. (WOTM) offers a diverse range of programs and services for the maintenance and improvement of the quality of life in Woodside, Queens.  Maintaining decent, affordable housing is an  important aspect of our mission.  WOTM has provided assistance to the community in housing, youth services, business, culture, and job placement programs that help both businesses and residents. WOTM's activities include: co-ownership of a 78-unit senior residence; serving as a local sponsor for the Sunnywood Partnership Homes; providing businesses and employment services; providing after-school and summer youth programs; and organizing community activities such as neighborhood clean-ups, a street fair, holiday tree lighting, and free concerts in schools and parks. WOTM also provides tenant and landlord assistance and homeowner financial counseling. During State FY '99-'00, the corporation performed the following NPC activities: tenant/client assistance, grants and program assistance, research/outreach/organizational development, and homeowner financial counseling. As a way to broadly inform the community about our services, WOTM opened a web-site giving the opportunity to tenants/clients to access information about our programs."
    },
    {
      "website url": "",
      "phone no.": "(212) 860-4100",
      "contact person": "HILDA C. VIVES-VASQUEZ",
      "title": "116 Street Block Association, Inc.",
      "service area": "EAST HARLEM AND EL BARRIO",
      "address": "55 E 115TH ST NEW YORK, NY 10029",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=94",
      "email": "candy10029@aol.com",
      "description": "116th STREET BLOCK ASSOCIATION, INC. is a nonprofit community based organization located in East Harlem and serving residents of Community Board 11.  The association was organized in 1976 and incorporated under the laws of the State of New York in 1979 by a group of community leaders who were concerned about the negative effects of crime, drugs, lack of employment opportunities, abandonment, poor quality of housing, and bank disinvestment in the area. The Association was created with the view of collaborating in a recuperating strategy for the community; aspiring to develop tenants potential through meaningful workshops in leadership; to organize tenants; secure housing from negligent landlords; promote neighborhood stability; and provide low-income housing. The services and activities are based upon the conviction that in order to effectively control housing problems, the neighborhood residents themselves must become involved. The Association promotes a self-help approach in attending other needs arising from poverty levels characterizing vast sectors of the community. The examination of the issues of the community and the individual person in a holistic way has led to a web of interrelations with other community organizations in order to improve the quality assistance offered to housing, schools, churches, hospitals, police, fire departments and other service providers in the area. The organizational relationship avoids repetitive efforts and economic redundancy. The Association provides independent living skills workshops to the community on various topics such as: Lead Awareness-Local Law 1, management, crime prevention (trespassing program), arson awareness, the operation of tenants associations and health issues.  Through NYC HPD's  Anti-Abandonment Unit- Community Consultant Program, the association offers walk-in services for: case management, counseling services, tenant counseling on apartment maintenance, referrals to suitable housing, employment and education, assistance with applications for Public Housing, Section 8 and Public Assistance, rent arrears application, DRIE (Disability Rent Increase Exempt), Con Edison /Heartshare (grant for individuals who are in distress and in arrears with electrical/gas bill, this program is seasonal), and protecting their legal rights. The association's most recent contract with NYC HPD's Anti-Abandonment Unit as an NPC provides surveys to buildings in housing code violations; assists landlords to get into voluntary repair agreements, repair loans, building maintenance and other programs to be eligible for tax breaks; mediation with both landlord and tenant dispossession and evictions; technical assistance to residents of city owned buildings; and management and financial services assistance to buildings already converted to Cooperatives. Services are provided to Seniors to motivate them to secure and maintain entitlement benefits and assist with their physical, psychological and social well being. The organization assists with various programs accessible for seniors such as referral to suitable housing placement, SCRIE, HEAP, IT210 & IT214 tax rebates, Medicare/Medicaid, Home care referral and social cultural/ recreational programs."
    },
    {
      "website url": "",
      "phone no.": "(718) 620-6007",
      "contact person": "STEPHEN HUNTLEY",
      "title": "163Rd Street Improvement Council, Inc.",
      "service area": "MORRISANIA",
      "address": "490 E 167TH ST BRONX, NY 10456",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=95",
      "email": "shuntley@163council.org",
      "description": "The mission of the 163rd Street Improvement Council, Inc. is to plan, design, develop and implement affordable housing and support services that focus on meeting the housing and human services needs of the residents of the Southeast Bronx.  A majority of our clients have incomes below the median level.  The Council offers an integrated program designed to create the empowerment of its residents.  The Council's history of three-plus decades is rooted in providing quality and affordable housing through direct assistance that includes support services, education, information, advocacy, placement and referral. The Council has also expanded its scope to include special needs housing with support services."
    },
    {
      "website url": "",
      "phone no.": "(518) 465-5251",
      "contact person": "JOSEPH SLUSZKA",
      "title": "Albany Housing Coalition, Inc.",
      "service area": "ARBOR HILL AND WEST HILL",
      "address": "278 CLINTON AVE ALBANY, NY 12210",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=99",
      "email": "admin@ahcvets.org",
      "description": "The Albany Housing Coalition, Inc. provides a continuum of housing and support services to veterans, low-income individuals and families in the Capital Region."
    },
    {
      "website url": "http://www.astelladevelopment.org",
      "phone no.": "(718) 266-4653",
      "contact person": "JUDITH ORLANDO",
      "title": "Astella Development Corporation",
      "service area": "CONEY ISLAND",
      "address": "1618 MERMAID AVE BROOKLYN, NY 11224",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=106",
      "email": "astellaci@aol.com",
      "description": "Astella Development Corporation is dedicated to providing affordable housing, commercial revitalization and economic development, and to improving the quality of life in Coney Island, Brooklyn.  Astella was established in 1975 by concerned tenants, landlords and dedicated residents whose primary goal was to stem the tide of neighborhood deterioration. Astella offers the following services: assist potential home buyers in purchasing a house; inform homeowners and landlords of loan programs; market affordable single family homes; work with homeowners  associations; coordinate educational workshops; counsel tenants and landlords; prepare tenants and landlords for housing court; mediate between tenants and landlords; assist with Housing Authority, HEAP, and SCRIE applications; assist in filing DHCR complaint forms; provide social service referrals; rehabilitate properties; publish home ownership booklet on how to buy a house; coordinate business seminars and promotion; provide technical assistance to merchants; work with the Coney Island Board of Trade; assist potential and established business owners; construct retail space; post job opportunities; type and fax resumes; market mixed use buildings; interface with the city agencies; organize community events; publish community newsletter; publish Coney Island Service Directory."
    },
    {
      "website url": "",
      "phone no.": "(718) 726-0034",
      "contact person": "CATHERINE PIECORA",
      "title": "Astoria Restoration Association, Inc.",
      "service area": "DITMARS/ASTORIA",
      "address": "31-28 DITMARS BLVD ASTORIA, NY 11105",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=107",
      "email": "cmpiecora@aol.com",
      "description": "The Astoria Restoration Association (ARA) was first organized in 1977 by a group of concerned merchants and residents who became increasingly aware that the viability of the Ditmars Boulevard-31st Street commercial strip was essential to the continued well-being of the entire neighborhood.  As the commercial revitalization activities of the Astoria Restoration Association continued, which included the completion of a 1.7 million dollar physical improvement project for the area, it soon became apparent that housing deterioration had to be addressed before it developed into a more serious problem.  Thus in 1981, the ARA began a comprehensive housing and neighborhood revitalization program aimed at strengthening the existing housing stock of the neighborhood.  The goals of the Astoria Restoration Association, as stated in the Articles of Incorporation are to \"preserve the stability of the residential and the commercial areas of the community; encourage landlords, homeowners, and businessmen to improve their property, stimulate public interest in the arts and cultural endeavors related to the preservation of the community; and to coordinate with government agencies to improve the community.\"  With these goals as a base, the ARA has and will continue to implement an on-going Neighborhood Preservation Program consisting of three majors components: 1) Housing 2) Neighborhood Economic Development 3) Neighborhood Employment Service."
    },
    {
      "website url": "http://www.belmontarthurldc.com",
      "phone no.": "(718) 295-2882",
      "contact person": "CONSOLATO CICCIU",
      "title": "Belmont Arthur Avenue Local Development Corp.",
      "service area": "BELMONT",
      "address": "660 E 183RD ST BRONX, NY 10458",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=109",
      "email": "belmontldc@aol.com",
      "description": "The Belmont Arthur Avenue Local Development Corporation (LDC) was founded on 08/18/81 to serve as the official economic development agency for the Belmont Community.  The LDC was created to complement and expand commercial initiatives and to preserve housing stock for moderate- and low-income families.  The LDC also provides the important link to the City of New York in obtaining funding for community projects to foster long range planning.  Housing services provided by the LDC include the development of subsidized housing for low- and moderate-income families, the elderly on fixed incomes, persons with special needs and the homeless.  In addition, they assist landlords in obtaining low interest government loans to upgrade housing stock primarily occupied by low- and moderate-income families.  Low- and moderate-income tenants can also get assistance in accessing social services."
    },
    {
      "website url": "http://www.better-neighborhoods.org",
      "phone no.": "(518) 372-6469",
      "contact person": "EDWARD AUGUST",
      "title": "Better Neighborhoods, Inc.",
      "service area": "HAMILTON HILL AND VALE AREA",
      "address": "986 ALBANY ST SCHENECTADY, NY 12307",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=111",
      "email": "eaugust@better-neighborhoods.org",
      "description": "Better Neighborhoods, Inc. (BNI) strives to revitalize neighborhoods and improve housing opportunities for low and moderate income persons through:"
    },
    {
      "website url": "http://www.brrnhs.org",
      "phone no.": "(716) 877-3910",
      "contact person": "WILLIAM BUZAK",
      "title": "Black Rock-Riverside Neighborhood Housing Services, Inc.",
      "service area": "BLACK ROCK/RIVERSIDE/GRANT-AMHERST",
      "address": "203 MILITARY RD BUFFALO, NY 14207",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=112",
      "email": "bbuzak@brrnhs.org",
      "description": "Black Rock-Riverside Neighborhood Housing Services (NHS) is a non-profit lender and developer dedicated to improving the housing, commercial districts, and public spaces in the Black Rock and Riverside neighborhoods.  NHS is a HUD-certified counseling agency  NHS provides financing for home improvements to households who cannot qualify for conventional financing, counsels and assists renters who wish to become home owners, and provides affordable housing to those who wish to rent. NHS provides assistance to small businesses who wish to locate or expand in the area. NHS acquires and  develops properties that private investors shun, and coordinates efforts to enhance public facilities that enrich the neighborhood.  Whenever possible NHS undertakes civic projects that enhance the quality of life and resident pride in our neighborhoods.  An urban park (approx 15,000 sq ft) to serve as a gateway to the Black Rock neighborhood was developed, and previous projects include a little league football field in the Riverside neighborhood."
    },
    {
      "website url": "http://www.780fillmore.org",
      "phone no.": "(716) 852-3130",
      "contact person": "STEPHEN KARNATH",
      "title": "Broadway-Fillmore Neighborhood Housing Services Inc.",
      "service area": "FILLMORE",
      "address": "780 FILLMORE AVE BUFFALO, NY 14212",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=113",
      "email": "skarnath@780fillmore.org",
      "description": "Broadway-Fillmore NHS serves three housing populations - the renter, homeowner, and the prospective homeowner.  This three-pronged approach targets low-to-moderate income persons and assures that the housing needs of the Fillmore Councilmatic District are addressed.  BFNHS accomplishes this through the use of its Revolving Loan Fund, Mortgage Fund, and other available resources i.e., Affordable Housing Corporation, the City of Buffalo, and DHCR."
    },
    {
      "website url": "http://www.bronxshepherds.org",
      "phone no.": "(718) 299-0500",
      "contact person": "SUSAN MCPHERSON",
      "title": "Bronx Shepherds Restoration Corp.",
      "service area": "MORRISANIA",
      "address": "1590 E 172ND ST BRONX, NY 10472",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=115",
      "email": "info@bronxshepherds.org",
      "description": "Bronx Shepherds Restoration Corporation (BSRC) was organized 23 years ago by pastors and lay persons who chose to remain in the South Bronx after major institutions had abandoned the area.  A major thrust of the organization has been the upgrading of existing housing through rehabilitation or new construction. BSRC owns and manages 340 E. 184 St., a 64 unit building, a 46 unit building at 1590 E. 172 St. and an 8 unit building at 942 Leggett Avenue.  They have also sponsored 139 new 2-3 family homes and 267 units of condominium housing; rehabilitated over 140 units of low-income affordable housing; gut rehabilitated 69 units, currently 100% occupied; and have been selected to gut rehabilitate 2 buildings at 932 E 173 St and 937 E 172 St, a total of 48 units.  Under the Neighborhood Small Homes Program, BSRC will rehabilitate 12 1-3 family homes and then sell them to community residents.  A new frail and elderly building located at 171 St. and Park Avenue has been accepting residents since September, 2002.  BSRC is a community consultant in Community Board # 3 for the HPD Anti-Abandonment Program and has retrofitted their building at 1932 Washington Ave. to include use for additional community space.  Bronx Shepherds continues to organize tenants associations and security patrols and provide orientation for all tenants as well as assisting with social services as needed.  A community survey with UDAP of Columbia University will be used to plan additional housing and commercial revitalization."
    },
    {
      "website url": "http://www.carrollgardensassociation.com",
      "phone no.": "(718) 243-9301",
      "contact person": "VILMA HERAMIA",
      "title": "Carroll Gardens Association, Inc.",
      "service area": "REDHOOK/CARROLL GARDENS/COLUMBIA STREET/WATERFRONT",
      "address": "201 COLUMBIA ST BROOKLYN, NY 11231",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=122",
      "email": "vvheramia@carrollgardensassociation.com",
      "description": "In May, 1971 the Carroll Gardens Association, Inc. (CGA) was incorporated as a not-for-profit organization to assist the disadvantaged regardless of race or religion and to create a spirit of community. The new not-for-profit began by leveraging federal and state funds into the community and developing service programs in education, cultural awareness, employment counseling and job placement. CGA has developed programs that have addressed the needs of the working class neighborhoods of South Brooklyn. Programs benefitting low- and moderate-income individuals and families include landlord/tenant counseling and assistance in filing applications for assisted housing (Section 8 and Housing Authority.) CGA offers assistance and technical services to small property owners and rehabilitation funds for property management. When Carroll Gardens began experiencing its first wave of gentrification, they began to explore the need for affordable housing to ease displacement of long time residents because of exorbitant rent increases. CGA is the recipient of two John Heinz Neighborhood Demonstration Program Awards totaling $125,000. This award has a highly competitive application process and is funded through HUD. CGA is funded yearly by the Department of Youth and Community Development to operate an after school computer training program. Collaborative work with other non-profits and community groups includes projects with the Enterprise Foundation, National Equity Fund, National Low Income Housing Coalition, National Puerto Rican Coalition and the Statewide Hispanic Corp. CGA is rehabilitating and refurbishing 62 units of housing in Red Hook and developing a HomeWork housing program."
    },
    {
      "website url": "http://www.centercitynf.org",
      "phone no.": "(716) 282-3738",
      "contact person": "JOHN C. DRAKE",
      "title": "Center City Neighborhood Development Corporation",
      "service area": "CENTER CITY/SOUTH END",
      "address": "1824 MAIN ST NIAGARA FALLS, NY 14305",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=123",
      "email": "centercity@pce.net",
      "description": "The primary mission of the Center City Neighborhood Development Corporation is to assist the lowest income members of the community with their housing needs.  To accomplish this, the corporation rehabilitates substandard units and rents them to very low-income persons.  Currently, Center City owns and/or managers 108 affordable rental units.  In addition, Center City provides grant and loan assistance to landlords who make improvements to the properties they rent to very low-income persons.  Owner-occupied home improvement programs are also offered to assist very low- and low-income home owners with their home improvement needs.  All property improvement programs focus on improvements to the dwelling units which bring the property up to current code; prolong the useful life of the structure; and make the property more affordable the for owner to maintain.  Center City also works with very low- and low-income first-time home buyers, assisting them through the maize of barriers associated with the home purchase process.  Center City is the only HUD Certified Housing Counseling Agency in Niagara County and therefore provides housing counseling and education to anyone in need regardless of neighborhood.  Center City also has innovative grant/loan programs for low-income first-time home buyers who are purchasing a home in their neighborhood.  Through home purchase education, one-on-one budgeting, debt and credit counseling and grant/loan programs increasing numbers of families have a stake in their neighborhood by realizing the dream of home ownership, a dream which they never believed was within their reach.  Other quality of life issues for the entire community are positively impacted by the activities of Center City: block club participation and clean-up events; active participation in business associations to assure inclusion of the neighborhood residents' perspective; coordination of resident surveys; and hosting of public community meetings."
    },
    {
      "website url": "",
      "phone no.": "(631) 348-0669",
      "contact person": "NANCY MANFREDONIA",
      "title": "Central Islip Civic Council, Inc.",
      "service area": "CENTRAL ISLIP",
      "address": "68 WHEELER RD CENTRAL ISLIP, NY 11722",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=126",
      "email": "ciciviccouncil@aol.com",
      "description": "The Central Islip Civic Council, a community based non-profit, provides housing counseling and tenant services to the Central Islip community. The Council rehabs and builds affordable housing (over 500 units in the last ten years); coordinates crime control and downtown revitalization efforts for the community; provides educational and nutritional programs for youth; and runs a food pantry for needy citizens."
    },
    {
      "website url": "",
      "phone no.": "(212) 967-1644",
      "contact person": "JOHN SCOTT R. JOHNSON",
      "title": "Clinton Housing Development Co. Inc.",
      "service area": "CLINTON",
      "address": "403 W 40TH ST NEW YORK, NY 10018",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=128",
      "email": "info@clintonhousing.org",
      "description": "Clinton Housing Development Company, Inc. (CHDC), established in 1973 as a voluntary organization, was incorporated in 1974. Its original mission was to combat community deterioration, assist the community in meeting and solving its housing needs, and improve the living conditions for senior citizens, families of limited income, and other disadvantaged persons by sponsoring and promoting the renovation, rehabilitation, and tenant ownership of housing in the borough of Manhattan. Housing is planned, renovated or built with people as the first concern. Tenants are an integral part of the development and construction process. By putting people first, our staff creates affordable apartments which are well-maintained years after renovation. Many buildings have been converted to tenant ownership as low- and moderate-income coops. Ownership empowers tenants and builds a stable community."
    },
    {
      "website url": "",
      "phone no.": "(585) 325-1311",
      "contact person": "DELAINE COOK-GREENE",
      "title": "Coalition Of North East Associations Inc.",
      "service area": "UPPER FALLS",
      "address": "471-473 HUDSON AVE ROCHESTER, NY 14605",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=131",
      "email": "conea@frontiernet.net",
      "description": "The Coalition of Northeast Associations (CONEA) is a 501 (c)3, not for profit organization which revitalizes the Northeast Area (Sector 10) of Rochester, NY.   CONEA continues to create unity throughout the community by addressing housing needs, crime prevention, youth leadership development, community and economic development and community organization.  Housing programs include both rehabilitation of existing units and new construction.  CONEA administers the Residential Assistance Program (RAP) for the City of Rochester which enables homeowners to maintain their properties and prevent code violations.  CONEA has collaborated with Flower City Habitat for Humanity in the development and building of new homes for first time homeowners."
    },
    {
      "website url": "http://www.cloth159.org",
      "phone no.": "(212) 795-4779",
      "contact person": "YVONNE STENNETT",
      "title": "Community League Of The Heights",
      "service area": "WASHINGTON HEIGHTS",
      "address": "500 W 159TH ST NEW YORK, NY 10032",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=132",
      "email": "ystennett@cloth159.org",
      "description": "The Community League of the Heights ( CLOTH) is a community based organization that was founded in 1952.  From its origins as a volunteer organization formed to serve the needs of the youth of Southern Washington Heights, CLOTH today is a dynamic community development organization working to strengthen and empower the neighborhoods of Southern Washington Heights and Hamilton Heights.  What began as a coalition of neighborhood parents, CLOTH (formerly the Community League of West 159th Street) has evolved into a professional and multi-dimensional organization whose comprehensive mission now encompasses advocacy, organizing and the provision of services as they relate to affordable housing; education; health; youth and neighborhood improvement.  Our enduring philosophy is that our doors are always open to neighbors in need. CLOTH has been and continues to be dedicated to the improvement of the quality of life for residents of the Southern Washington Heights area."
    },
    {
      "website url": "http://www.coopersquare.org",
      "phone no.": "(212) 228-8210",
      "contact person": "STEVE HERRICK",
      "title": "Cooper Square Cd Committee & Businessmen'S Association, Inc.",
      "service area": "LOWER EAST SIDE",
      "address": "61 E 4TH ST NEW YORK, NY 10003",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=134",
      "email": "steveh@coopersquare.org",
      "description": "The Cooper Square Committee's mission is to preserve and develop affordable housing and community/cultural spaces in order to prevent displacement of low/moderate income tenants and to maintain the racial, economic and cultural diversity of the Lower East Side in our service area from the Bowery to the East River and from E. 14th Street to Delancey Street."
    },
    {
      "website url": "http://www.cypresshills.org",
      "phone no.": "(718) 647-2800",
      "contact person": "MICHELLE NEUGEBAUER",
      "title": "Cypress Hills Local Development Corporation",
      "service area": "CYPRESS HILLS/HIGHLAND",
      "address": "625 JAMAICA AVE BROOKLYN, NY 11208",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=136",
      "email": "michellen@cypresshills.org",
      "description": "Cypress Hills Local Development Corporation (CHLDC) provides comprehensive housing counseling and development, youth and human services, and economic development programs to the low and moderate income community of Cypress Hills in northeast Brooklyn.  CHLDC serves over 7,000 residents annually through its multi-faceted programming.  Housing counseling services offered include: mortgage counseling, tenant organizing, fire safety education, home repair loan packaging, and mortgage foreclosure prevention.  The organization has developed 200 units of affordable housing and a day care center.  CHLDC is also working towards the development of a mini-mall on the neighborhood shopping street and a community-owned school building."
    },
    {
      "website url": "",
      "phone no.": "(212) 410-7900",
      "contact person": "GUSTAVO ROSADO",
      "title": "El Barrio'S Operation Fight-Back",
      "service area": "EAST HARLEM/EL BARRIO",
      "address": "SUITE 403 413 E 120TH ST NEW YORK, NY 10035",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=140",
      "email": "john.arenas@ebof.org",
      "description": "Incorporated in January 1986, El Barrio's Operation Fightback (EBOF) continues to work against the deterioration of housing, the displacement of families, and the declining availability of affordable housing in East Harlem. EBOF manages 259 rental units with another 42 units slated for completion by the Fall 2000.  In addition EBOF has sponsored 102 units of two and three-family homes and 77 SRO units for formally drug dependent individuals. EBOF also offers an array of tenant and community services to improve the quality of life for East Harlem's children and families.  Specifically, Operation Fightback provides housing information and assistance regarding tenant code enforcement; assists tenants with housing court actions; organizes neighborhood improvement activities; serves as tenant liaison for Neighborhood Entrepreneur Program; facilitates home ownership through the City Homes Program; rehabilitates neighborhood apartments and homes; sponsors the development of new homes in conjunction with NYC Housing Partnership; and provides guidance, recreational and educational services for the children of neighborhood tenants.  These efforts are the product of a broad public, private, and non-profit partnership funded through city, state, and federal housing agencies, as well as private corporations and the foundation community."
    },
    {
      "website url": "",
      "phone no.": "(716) 856-3262",
      "contact person": "ERMA BROWN",
      "title": "Ellicott District Community Development, Inc.",
      "service area": "EMSLIE-JOHNSON",
      "address": "644 WILLIAM ST BUFFALO, NY 14206",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=141",
      "email": "ellicottcdc644@aol.com",
      "description": "Ellicott District Community Development, Inc. (EDCD) was formed in 1973 to advance the cause of affordable housing and neighborhood revitalization.   The overall  mission of EDCD is to  stabilize the neighborhoods it serves by increasing home ownership opportunities; promoting  home improvement efforts for owner occupants; and empowering residents to get involved.  A strong and healthy community is one which: looks appealing; has decent affordable housing; has potential for growth; values neighborhood owned enterprises and initiatives; and is a place where people feel safe and want to raise a family.  EDCD provides services to four distinct areas: Emslie/Johnson Neighborhood Statistical Area (NSA; Pratt/Willert NSA; Fruitbelt NSA; and Cold Spring NSA.  These neighborhoods (with special regards to Emslie/Johnson) contain the oldest housing stock in the City.   The  demolition of the existing housing stock and the large number of absentee owners continues to be a major hurdle in stabilizing the community.  Although Ellicott NSA has seen an increase in new housing over the past few years, the existing housing stock continues to be in various stages of deterioration and in great need of repair.  The Ellicott District continues to rank among the lowest on all social and economic scales, with incomes for the residents far below the county and city median."
    },
    {
      "website url": "",
      "phone no.": "(716) 838-6740",
      "contact person": "WENDY H. ANDERSON",
      "title": "Fillmore-Leroy Area Residents, Inc.",
      "service area": "FILLMORE-LEROY",
      "address": "307 LEROY AVE BUFFALO, NY 14214",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=143",
      "email": "cpa898@hotmail.com",
      "description": "Fillmore-Leroy Area Residents, Inc. (FLARE)  was established by concerned residents in the Fillmore-Leroy area of Buffalo over 20 years ago.  Its services are focused both on housing and human service issues.  As a result of their efforts, FLARE was able to establish the following: 17 rental units that are available to low income people, home improvement grants and low interest loans for low income residents, an acquistion rehabilitation sale program, beautification projects, new construction projects, a food pantry, senior nutrition program, senior transportation, and youth services program. Recently, FLARE was awarded additional funds from the Federal Home Loan Bank of New York to provide subsidies for the acquisition rehabilitation sale program and funds from the NYS Affordable Housing Corporation to increase the pool of funds available for home improvements."
    },
    {
      "website url": "http://www.firstwardaction.org",
      "phone no.": "(607) 772-2850",
      "contact person": "JERRY WILLARD",
      "title": "First Ward Action Council, Inc.",
      "service area": "FIRST WARD",
      "address": "167 CLINTON ST BINGHAMTON, NY 13905",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=144",
      "email": "fwac@stny.rr.com",
      "description": "First Ward Action Council, Inc. was incorporated in 1982 with a mission to work in a variety of ways to improve the neighborhood through advocacy, housing rehabilitation, housing development, and preservation activities. It completed its first housing rehabilitation project in 1989 and has continued to rehab targeted properties with the intent of improving the neighborhood while providing affordable housing."
    },
    {
      "website url": "http://www.fordham-bedford.org",
      "phone no.": "(718) 367-3200",
      "contact person": "JOHN M. REILLY",
      "title": "Fordham Bedford Housing Corporation",
      "service area": "FORDHAM-BEDFORD",
      "address": "2751 GRAND CONCOURSE BRONX, NY 10468",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=146",
      "email": "rviera@fbhcnet.org",
      "description": "Fordham Bedford Housing Corporation was created in 1980 by community leaders to combat prevalent housing deterioration and abandonment spreading from the South Bronx.  Its mission has always been to improve its Bronx community by providing community-run housing that is safe, sound, and affordable.  Presently, the housing corporation is providing assistance to tenants in more than 70 community-run apartment buildings and to tenants and owners of privately run buildings. Altogether, it serves and assists more than 2000 low-income households annually. To make housing safe, sound, and affordable, the housing corporation assists with building security, energy efficiency, tax exemptions, controlling water charges, providing low-interest repair loans, obtaining rental subsidies, resolving code violations, and addressing lead paint issues.  In addition to housing concerns, the Housing Corporation sponsors and supports youth activities, creates and maintains recreational space, sponsors programs for new immigrants, fights for increased security and city services, and provides meeting space for numerous community improvement activities."
    },
    {
      "website url": "http://www.queenscommunityhouse.org",
      "phone no.": "(718) 592-5757",
      "contact person": "IRMA RODRIGUEZ",
      "title": "Queens Community House, Inc.",
      "service area": "FOREST HILLS, REGO PARK, CORONA & ELMHURST",
      "address": "108-25 62ND DR FOREST HILLS, NY 11375",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=147",
      "email": "irodriguez@queenscommunityhouse.org",
      "description": "Queens Community House, Inc. is a multi-service settlement house with 25 years of social service experience.  We are committed to the personal growth of the diverse population we serve.  The Community House employs 267 people and utilizes a volunteer core of 200 Queens residents and social work interns to serve approximately 17,000 individuals annually. We provide 32 programs at 17 sites for Queens residents.  Community House programs include 4 senior centers, one which serves gay and lesbian seniors;  transportation services for the elderly; after-school programs throughout Community District 28; a teen outreach program; a substance abuse and prevention program targeting young women; adult literacy and computer classes; child health insurance enrollment; and comprehensive housing services including homelessness prevention, eviction prevention, rehousing assistance, and services to homeless families. Through our Neighborhood Preservation activities, tenants and property owners can obtain assistance to improve the quality of their housing environments. The Neighborhood Preservation Program also supports the activities of tenant association, block associations, and offers community education and community mediation services."
    },
    {
      "website url": "",
      "phone no.": "(718) 332-0582",
      "contact person": "ELLEN SUSNOW",
      "title": "Greater Sheepshead Bay Development Corp.",
      "service area": "SHEEPSHEAD BAY",
      "address": "2107 EAST 22ND ST BROOKLYN, NY 11229",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=151",
      "email": "gsbdcorp@aol.com",
      "description": "Greater Sheepshead Bay Development Corporation (GSBDC) is a non profit, non-government, 501(c)(3) community based development corporation founded in 1978 who dedicates itself to aid in the development and coordination of programs for the preservation and redevelopment of the Greater Sheepshead Bay area of Kings Country for the purpose of improving the physical, economic and social environment of its geographic area with particular attention to the needs of low and moderate income community residents. GSBDC provides multifaceted services to its communities with areas of responsibility that include home improvement loans, housing exemption applications for tenants, coop and homeowners, commercial revitalization, homeownership education,  foreclosure prevention, senior citizen services and immigrant services."
    },
    {
      "website url": "",
      "phone no.": "(212) 410-7707",
      "contact person": "MARTIN REYES",
      "title": "Hellgate Management Corp.",
      "service area": "EAST HARLEM",
      "address": "SUITE 306 413 E 120TH ST NEW YORK, NY 10035",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=154",
      "email": "rrodriguez@promesa.org",
      "description": "Hellgate Management Corporation was incorporated in the State of New York as a non-for-profit organization in 1979. Its mission for the last twenty-nine years has been to develop and implement plans, projects and activities that would eliminate the abandonment of housing stock in East Harlem. The agency also strives to aid, assist, and foster planning, development, and rebuilding through activities geared towards the preservation of our community."
    },
    {
      "website url": "http://www.hispanicbrotherhood.com",
      "phone no.": "(516) 766-6610",
      "contact person": "MARGARITA GRASING",
      "title": "The Hispanic Brotherhood Of Rockville Centre, Inc.",
      "service area": "ROCKVILLE CENTRE",
      "address": "59 CLINTON AVE ROCKVILLE CENTRE, NY 11570",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=155",
      "email": "margarita.grasing@hispanicbrotherhood.org",
      "description": "In 1984 the Hispanic Brotherhood of Rockville Centre, Inc. was created to provide services to a fast growing Latino community in the Village of Rockville Centre as well as the South Shore of Long Island.  For those living in Rockville Centre, the agency continues to provide housing counseling and tenant assistance among other services, which are provided by a bi-lingual, bi-cultural staff at the Center.  We have continuously targeted a population at 50% or below the median income.  According to 1997-98 statistics by HUD and the Low Income Housing Coalition, housing has become out of reach for low and middle income families on Long Island.  At 50% of the area median income, a family of four is unable to afford a two bedroom unit.  It has been our mission to provide assistance with housing, employment, and child care. Clients in need of subsidized housing are provided comprehensive services in order to achieve their needs."
    },
    {
      "website url": "http://www.hopeci.org",
      "phone no.": "(212) 860-8821",
      "contact person": "WALTER M. ROBERTS",
      "title": "Hope Community, Inc.",
      "service area": "EAST HARLEM/EL BARRIO",
      "address": "174 E 104TH ST NEW YORK, NY 10029",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=157",
      "email": "wroberts@hopeci.org",
      "description": "As a community based developer of housing, Hope Community, Inc. is committed to building a better community and enriching the lives of the people who live and work within East Harlem. We sponsor, construct, and operate attractive and high quality housing primarily for low- and moderate-income families. Hope Community believes that personal responsibility combined with collected action is the key to establishing a lasting impact on the community. Working in partnership with other organizations, private businesses, government, and the constituents of East Harlem, Hope Community forges ties that bind people together into economically, ethnically, and culturally diverse neighborhoods creating healthy environments where families can grow and prosper. In addition to providing quality housing, Hope Community seeks to foster an enriched community through restructuring the vacant lots that plague East Harlem's blocks. These properties are viable sites to develop into parks and gardens under Hope Community's Urban Landscaping program. Hope Community has successfully converted 15 vacant lots throughout East Harlem into five parks and ten gardens. Work on the restoration of the Modesto Tin Flores Garden, where Hope Community holds its Poetas Con Cafe, has already begun."
    },
    {
      "website url": "",
      "phone no.": "(631) 754-0373",
      "contact person": "SUSAN R. LAGVILLE",
      "title": "Housing Help, Inc.",
      "service area": "HUNTINGTON STATION",
      "address": "SUITE 6 91 BROADWAY GREENLAWN, NY 11740",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=159",
      "email": "susanlagville@optonline.net",
      "description": "Housing Help, Inc. (HHI) is a 45-year-old, not for profit housing agency that provides services for low and moderate income households in the Town of Huntington. We serve approximately 1,200 households annually.  We are funded by NYS DHCR, Long Island United Way, and a number of foundations, banks, and churches. HHI provides services that target tenants (code enforcement, tenant rights and responsibilities, relocation), home buyers and home owners (counseling for first time buyers and linkages to down payment assistance programs, mortgage default counseling), and senior citizens (reverse equity mortgages and rental housing referral). We work closely with local parish outreach centers, the Veterans Administration, Adult Protective services, and many social service agencies. HHI has eight housing programs: Tenant Counseling, First-Time Home Buyer Counseling, Mortgage Default Counseling, Reverse Equity Mortgage Counseling, Project HOPE (rehab and sale of vacant houses), the Huntington Interfaith Affordable Housing Loan Fund, Debt Into Wealth, and Matinecock Court, a 155 unit affordable housing development to be constructed in 2009."
    },
    {
      "website url": "http://www.hdsw.org",
      "phone no.": "(914) 939-2005",
      "contact person": "ANDREA KOCSIS",
      "title": "Human Development Services Of Westchester",
      "service area": "PORT CHESTER",
      "address": "930 MAMARONECK AVE MAMARONECK, NY 10543",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=160",
      "email": "blancalhds@aol.com",
      "description": "Human Development Services of Westchester, Inc. is a social service organization providing quality psychiatric, rehabilitative, residential and community stabilization in Westchester County.  The agency is dedicated to empowering the individuals and families we serve to achieve self sufficiency."
    },
    {
      "website url": "http://www.ifcany.org",
      "phone no.": "(914) 941-5252",
      "contact person": "JUNE JARVIS",
      "title": "Interfaith Council For Action, Inc.",
      "service area": "OSSINING'S INNER VILLAGE",
      "address": "790 138 SPRING ST OSSINING, NY 10562",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=162",
      "email": "jjarvis@ifca.org",
      "description": "Interfaith Council for Action, Inc. (IFCA) was founded in 1968 to promote and sponsor better housing and to improve recreational, educational, and social conditions for low-and-moderate income members of the Ossining community.  Our mission is to \"sustain community, diversity and opportunity through affordable/workforce housing and vital social services.\""
    },
    {
      "website url": "http://www.ithacanhs.org",
      "phone no.": "(607) 277-4500",
      "contact person": "PAUL D. MAZZARELLA",
      "title": "Ithaca Neighborhood Housing Services, Inc.",
      "service area": "NORTHSIDE/SOUTHSIDE/WEST HILL/FALL CREEK/SOUTH HILL",
      "address": "115 WEST CLINTON ST ITHACA, NY 14850",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=164",
      "email": "pmazzarella@ithacanhs.org",
      "description": "Ithaca Neighborhood Housing Services, Inc. (Ithaca NHS) serves Ithaca and Tompkins County with a comprehensive approach to neighborhood revitalization and affordable housing development.  Established in 1976 as a partnership between neighborhood residents, government, and the business community, Ithaca NHS has established highly successful programs that target four primary housing issues. These include:"
    },
    {
      "website url": "http://www.jccrp.org",
      "phone no.": "(718) 327-7755",
      "contact person": "NATHAN KRASNOVSKY",
      "title": "Jewish Community Council Of The Rockaway Peninsula",
      "service area": "FAR ROCKAWAY",
      "address": "1525 CENTRAL AVE FAR ROCKAWAY, NY 11691",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=165",
      "email": "nkrasnovsky@jccrp.org",
      "description": "Since the Jewish Community Council of the Rockaway Penninsula (JCCRP) was founded in 1972, it has been providing services on a non-sectarian basis to those in need and advocating for issues of concern to the community.  JCCRP provides social services to residents who live in the service area. JCCRP provides neighborhood preservation services and focuses on assisting  tenants and landlords of troubled buildings and is committed to improving the living conditions of area residents. It collaborates with community groups and individuals to attain improvements for the area."
    },
    {
      "website url": "http://www.lossures.org",
      "phone no.": "(718) 387-3600",
      "contact person": "DAVID D. PAGAN",
      "title": "Los Sures Community Development Company, Inc.",
      "service area": "SOUTHSIDE/WILLIAMSBURG",
      "address": "213 S 4TH ST BROOKLYN, NY 11211",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=172",
      "email": "ddpagan@aol.com",
      "description": "Los Sures Community Development Company, Inc. also known as Southside United HDFC is a community development corporation serving the Southside of Williamsburg, a predominantly Latin community.  The original impetus came from three Roman Catholic priests who came together in the late 1960's to stop further deterioration of the Southside of Williamsburg.  At that time, entire buildings, even entire blocks of the neighborhood were abandoned, sometimes as a result of suspected arson.  The first work of the largely volunteer organization was to organize tenants to collect their own rent and to run their own buildings.  In 1972 Southside United HDFC was incorporated and in 1979 Los Sures Community Development was incorporated to further the work and goals of the organization."
    },
    {
      "website url": "",
      "phone no.": "(212) 677-4772",
      "contact person": "KIM O'NEALE",
      "title": "Lower East Side Coalition Housing Development, Inc.",
      "service area": "LOWER EAST SIDE",
      "address": "GROUND FLOOR 308 E 8TH ST NEW YORK, NY 10009",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=173",
      "email": "leschdc@aol.com",
      "description": "Established in 1967 as the Coalition for Human Housing, Lower East Side Coalition Housing Development, Inc. (COALITION) is the only Latino, community-based, housing development organization in the Lower East Side.  Since its inception, the purpose of the Coalition has been to give the community a strong voice in creating a fair and balanced policy of housing development and land use.  COALITION has provided a model for, and participated in, numerous collaborative efforts to improve the quality of life throughout the lower east side, inviting community input and encouraging community leadership in the delivery of a full range of human service.  COALITION established and spun off a senior center and developed and sponsored a day care center.  COALITION has acted as fiscal conduit for The Girls Club of the Lower East Side and the Lower East Side Latino Human Services Consortium. Funds received from DHCR have leveraged over $28 million for the new construction of 80 HUD Section 202 apartments and the gut rehab of 19 buildings encompassing 212 apartments and 10 commercial spaces under HHAP, Enterprise/LISC/HPD, and HPD Capital Program.  Coalition is also the proud sponsor of 98 units of housing under the auspices of NYC Partnership Housing."
    },
    {
      "website url": "http://www.mfy.org",
      "phone no.": "(212) 417-3766",
      "contact person": "CHRISTOPHER SCHWARTZ",
      "title": "Mfy Legal Services, Inc.",
      "service area": "LOWER EAST SIDE",
      "address": "299 BROADWAY NEW YORK, NY 10007",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=175",
      "email": "cschwartz@mfy.org",
      "description": "MFY Legal Services, Inc. is a not-for-profit legal services program providing legal counseling, social services, community legal education, and legal representation to low income tenants and tenant groups residing in many at-risk neighborhoods in Manhattan including the Lower East Side, East Harlem, Chinatown, Clinton, and Manhattan Valley.  Funding sources include federal, state, and local grants as well as private foundations, corporations, and individuals.  MFY's Neighborhood Preservation Program funding supports assistance to low-income tenants in Single Room Occupancy (SRO) hotels, rooming houses, and lodging houses in the rapidly changing neighborhoods of Manhattan's East Side.  During State Fiscal Year 99-00, MFY provided tenant assistance."
    },
    {
      "website url": "http://www.mvdc.org",
      "phone no.": "(212) 678-4410",
      "contact person": "SANDRA B. POWERS",
      "title": "Manhattan Valley Development Corporation",
      "service area": "MANHATTAN VALLEY",
      "address": "73 W 108TH ST NEW YORK, NY 10025",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=176",
      "email": "sandra.b.powers@gmail.com",
      "description": "The mission of Manhattan Valley Development Corporation (MVDC) is geared toward the rehabilitation of the existing housing stock, building maintenance, and the preservation and revitalization of the neighborhood by coordinating its physical, social, and economic initiatives.  By sustaining the mission of providing affordable housing to the predominantly low income, ethnically diverse population and relocation within the community, MVDC is making every effort to tailor construction costs to rent levels community residents can afford or to secure rent subsidies in cases where construction costs exceed their income. Another important aspect of MVDC's mission is to provide jobs and job training to local unemployed or underemployed workers, support local businesses and other enterprises, provide human services, and improve quality of life.  In more recent years, MVDC extended its mission to house homeless families and individuals in its projects, including individuals living with HIV. It has always been an important part of MVDC's mission to create a viable housing services and rehabilitation capability, while simultaneously improving Manhattan Valley buildings in a manner that would preserve the integrity of the community as a viable neighborhood for low income and working class families from diverse racial, social, ethnic, and economic backgrounds."
    },
    {
      "website url": "http://www.margert.org",
      "phone no.": "(718) 471-3724",
      "contact person": "JOSEPH G. BARDEN",
      "title": "Margert Community Corp.",
      "service area": "FAR ROCKAWAY/EDGEMERE",
      "address": "325 BEACH 37TH ST FAR ROCKAWAY, NY 11691",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=178",
      "email": "jgb@nyct.net",
      "description": "Margert Community Corporation is an independent, nonprofit, charitable, community-based housing organization that provides neighborhood preservation services; housing assistance; energy affordability analyses and retrofits; health & safety improvements; and client education and housing counseling to low to moderate income tenants, homeowners, the elderly, and persons with disabilities. While our primary service area is Far Rockaway, Queens, we also provide vital housing services to all of Queens County and the entire NYC Metro Area. These services are provided by leveraging a variety of public and private funds primarily designed to assist households at or below 90% of our area's medium income and/or in severe financial distress. These sources, leveraged through the core administrative budget provided by the NYS DHCR Neighborhood Preservation Program, include: the DHCR Energy Services Bureau Weatherization Assistance Program, the HTFC RESTORE Program LPA, the HTFC HOME Program LPA, the HTFC Access to Home Program LPA, the US Department of Housing and Urban Development (HUD) Housing Counseling Program, the NYC DFTA Last Resort and coordinated weatherization programs, the Long Island Fuel Fund's Project Warmth, new construction applications through the NYS DHCR Unified Funding Process, and NYSERDA funded energy efficiency programs. We also provide housing counseling services through the New York Mortgage Coalition and NYC HPD City Council Initiative programs, and first time home ownership opportunities through community sponsorship of affordable housing development."
    },
    {
      "website url": "http://www.marketviewheights.org",
      "phone no.": "(585) 423-1540",
      "contact person": "FRANCISCO RIVERA",
      "title": "Marketview Heights Association, Inc.",
      "service area": "MARKETVIEW HEIGHTS",
      "address": "308 NORTH ST ROCHESTER, NY 14605",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=179",
      "email": "frivera@marketviewheights.org",
      "description": "Marketview Heights Association (MHA) is a neighborhood-based community development organization whose mission is to improve the quality of life in northeast Rochester through underscoring the need for decent housing that is affordable to low and moderate income households.  We provide a range of homeownership and housing rehabilitation programs and services, designed to help renew and restore our neighborhoods, and to reverse blight and substandard housing conditions. Our activities include homeownership housing development, home repair grant and loan programs, homebuyer counseling and education services, real estate services, neighborhood organizing and crime prevention, information and referral services, and other community renewal activities.  MHA is a designated City of Rochester and State of New York Community Housing Development Organization (CHDO), a HUD-approved Housing Counseling Agency, an adopter of the National Industry Standards for Homeownership Education, and a HOME Local Program Administrator."
    },
    {
      "website url": "http://www.metrointerfaith.org",
      "phone no.": "(607) 772-6766",
      "contact person": "LAURA D. RHINEHART",
      "title": "Metro Interfaith Housing Management Corp.",
      "service area": "SOUTH END",
      "address": "21 NEW ST BINGHAMTON, NY 13903",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=180",
      "email": "metrorhinehart@stny.rr.com",
      "description": "Metro Interfaith Housing Management Corporation was founded in 1968 to provide safe, appropriate and affordable housing for persons of moderate and very low/low income including elderly and handicapped/disabled individuals; to provide supportive services as may be needed and feasible and to provide Housing Counseling.  Metro Interfaith owns and manages 273 units of low income housing, is a licensed Enriched Housing Provider, licensed Home Care Agency,  a HUD Certified Housing Counseling Agency and administers a HOME Rehabilitation Program.  The type of services that we provide to our service area are: homeownership counseling, debt consolidation, mortgage default/foreclosure prevention counseling, loan grant assistance, grant/subsidy assistance, community resource referrals, rental housing assistance and rehabilitation assistance."
    },
    {
      "website url": "",
      "phone no.": "(718) 588-8200",
      "contact person": "JEANETTE PURYEAR",
      "title": "Mid-Bronx Senior Citizens Council, Inc.",
      "service area": "GRAND CONCOURSE",
      "address": "900 GRAND CONCOURSE BRONX, NY 10451",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=182",
      "email": "mbsccgen@aol.com",
      "description": "The Mid-Bronx Senior Citizens Council, Inc. (MBSCC) continues to provide service required by residents of the community. MBSCC has identified the provision of quality job development/job placement as one of the greatest service needs of our residents. MBSCC's Job Resource Center has two full time employees and an additional Job/Business Development position was funded. As more community residents become employed, the need for child care service have greatly increased.  MBSCC has been able to increase child care service by securing funding from the Board of Education for the provision of Universal Pre-Kindergarten services to 80 children.  This program began in September of 1999.  Also four new day care classrooms have been completed that will house a total of 68 children.  Additional funding has been secured from the NYC Board of Education to provide Universal Pre-Kindergarten to serve 56 children. During the past three years,  MBSCC has involved community residents through it's Neighborhood Advisory Council (NAC) in negotiating with NYC Department of Design Construction for the construction of a community friendly Bronx Supreme Court building.  As a result of the negotiating, a High School of Law and Justice and a day care center for 140 children will be built adjacent to the new Supreme Court Building. The construction of the Family Preservation Center (FPC) at the Andrew Freedman Home is near completion.  The FPC will house a number of programs offering job development, social services, day care, pediatric serviced, etc. to community residents.  Also, a number of other social service agencies will be housed at the FPC on a rotating basis to ensure that the greatest variety of services can be provided to community residents. The provision  of qualify housing to community residents of Bronx Planning #4 continues to be a very important goal of MBSCC."
    },
    {
      "website url": "",
      "phone no.": "(718) 376-0999",
      "contact person": "LINDA S. GOODMAN",
      "title": "Midwood Development Corp.",
      "service area": "MIDWOOD",
      "address": "1416 AVENUE M BROOKLYN, NY 11230",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=183",
      "email": "lgoodman@middev.org",
      "description": "Midwood Development Corporation (MDC) is a multifaceted nonprofit community-based organization.  The agency's mission is to stabilize, develop, and enhance the community by providing a comprehensive range of services for all those who live, work, and shop in the area.  These services include a supported employment program employing more than sixty individuals with developmental disabilities. MDC's commercial revitalization programs aim to promote the local shopping streets. MDC also operates an English As a Second Language (ESL) class.   We also provide general assistance and counseling to New Americans.  In addition, we facilitate the NYC Board of Education's ESL classes at the local high school. With funding from OMRDD and NYC DYCD, MDC provides after-school activities for elementary school youngsters.  GED classes and evening recreational programs for individuals with developmental disabilities are also offered.  MDC also operates the Midwood Youth Council, a community service and leadership training program for junior and senior high school students.  Each year, MDC organizes four community wide events, the Annual J Students Art Show (in collaboration with the Midwood Board of Trade), the Midwood Mardi Gras street fair, Neighborhood Entertainment Day in Kolbert Park, and the MDC Annual Meeting at Murrow H.S."
    },
    {
      "website url": "",
      "phone no.": "(585) 436-3090",
      "contact person": "ROBERT WALKER-SMITH",
      "title": "Montgomery Neighborhood Center, Inc.",
      "service area": "SOUTHWEST ROCHESTER",
      "address": "10 CADY ST ROCHESTER, NY 14608",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=184",
      "email": "rwalker-smith@swanonline.org",
      "description": "Montgomery  Neighborhood Center (MNC) was incorporated in 1952, making it the 5th Settlement House in the City of Rochester.  It's mission then and now is to meet the needs of problem families in the Southwest Community.  Those need then and now are still the same:  Rehabilitation of Housing, Programs for Seniors & Youth, and Community Organizing."
    },
    {
      "website url": "",
      "phone no.": "(718) 589-7858",
      "contact person": "CLAUDIA NESBETT",
      "title": "Morrisania Revitalization Corporation, Inc.",
      "service area": "MORRISANIA",
      "address": "576B E 165TH ST BRONX, NY 10456",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=185",
      "email": "cnisbett.mrcmlkbx@verizon.net",
      "description": "Morrisania Revitalization Corporation (MRC) is a community housing development organization founded almost 20 years ago to develop programs and activities designed to enhance the quality of life for the residents of the Morrisania community.  MRC's primary goals are to improve housing and economic opportunities within the community and to provide supportive social services where needed.  MRC's programs include marketing for the City Home - South Bronx program, operating the Ella Baker/Cleveland Robinson Leadership Academy, and  the Peace Academy Tutorial Program.  MRC also provides technical assistance to the Harriet Tubman Charter School.  Working closely with Community Board 3, MRC provides a comprehensive array of programs and services to the community including  research and planning, housing management, tenant/homeowner assistance, loan/grant application assistance, youth education and leadership development, and housing rehab/development."
    },
    {
      "website url": "",
      "phone no.": "(212) 427-0555",
      "contact person": "ROBERTO C. ANAZAGASTI",
      "title": "Nuevo El Barrio Para La Rehab De La Vivienda Y La Economia",
      "service area": "EAST HARLEM",
      "address": "SUITE 2R 18 E 116TH ST NEW YORK, NY 10029",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=186",
      "email": "ranerve1@aol.com",
      "description": "Nuevo El barrio para la Rehabilitation.de la Vivienda y la Economia, Inc. (N.E.R.V.E, inc), was founded in 1975 to help meet the housing needs of residents in East Harlem (El Barrio). After two submissions to the NYSHTF we were unable to get the funds to develop housing for low income residents at 2249 2nd Avenue site. We have been forced to surrender the idea of developing low income housing, and are now in the process of developing moderate income condominiums ( 32 Units) at 2249 2nd Avenue (Block 1665, Lot 24 & 25) in order to support our low income buildings. In the past and current years we have supported and maintained our low income buildings with rent and funds generated from 119 East 102nd street, a section 8 project. Our future strategy is to build these condominiums in order to generate funds from the sales therefore allowing N.E.R.V.E Inc. to become more self sufficient."
    },
    {
      "website url": "",
      "phone no.": "(718) 469-4679",
      "contact person": "TONYA ORES",
      "title": "Nhs Of East Flatbush",
      "service area": "EAST FLATBUSH",
      "address": "2806 CHURCH AVE BROOKLYN, NY 11226",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=187",
      "email": "tonya_ores@nhsnyc.org",
      "description": "Neighborhood Housing Services of East Flatbush, Inc. is a not-for-profit, citywide organization working to:"
    },
    {
      "website url": "http://www.nhsj.org",
      "phone no.": "(718) 291-7400",
      "contact person": "CATHY MICKENS",
      "title": "Nhs Of Jamaica, Inc.",
      "service area": "JAMAICA",
      "address": "89-70 162ND ST JAMAICA, NY 11432",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=188",
      "email": "cathy.mickens@nhsj.org",
      "description": "Neighborhood Housing Services of Jamaica (NHSJ) is a 34 year-old not-for-profit organization that's provided a cadre of housing services to residents in Southern Queens.  As the premier housing organization in Southern Queens, NHSJ provides quality and affordable homeownership services to low- and middle-income residents in communities known as:  South Jamaica, Ozone Park, Springfield Gardens, St. Albans and Hollis.   NHSJ strives to preserve neighborhoods in its service area by offering homeownership education, counseling, technical and financial assistance to community residents."
    },
    {
      "website url": "http://www.nhssouthbuffalo.org",
      "phone no.": "(716) 837-0071",
      "contact person": "SHYRL L. DUDERWICK",
      "title": "Neighborhood Housing Services Of South Buffalo, Inc.",
      "service area": "SOUTH BUFFALO",
      "address": "1937 SOUTH PARK AVE BUFFALO, NY 14220",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=190",
      "email": "info@nhssouthbuffalo.org",
      "description": "Neighborhood Housing Services of South Buffalo, Inc. provides financial assistance to homeowners for rehabilitation; financing for commercial facades; weatherization programs; and supporting fiscal services for neighborhood block clubs and faith based initiatives."
    },
    {
      "website url": "http://www.nhsofsi.org",
      "phone no.": "(718) 442-8080",
      "contact person": "ALFRED GILL",
      "title": "Nhs Of Staten Island, Inc.",
      "service area": "WEST BRIGHTON",
      "address": "770 CASTLETON AVE STATEN ISLAND, NY 10310",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=191",
      "email": "agill@nhsofsi.org",
      "description": "For over 25 years NHSSI has been committed to revitalizing neighborhoods through education, counseling and financial services to enhance people's ability to access affordable housing on Staten Island.  During this time the agency has worked to increase and protect investment in underserved low- and moderate- income neighborhoods, helped build communities, which encourage and support neighborhood self-reliance, and improve the quality of community life.  Today that quality of life in those communities that we have worked so hard to preserve is being threatened by Foreclosure."
    },
    {
      "website url": "",
      "phone no.": "(718) 881-1180",
      "contact person": "OSCAR J. MORILLO",
      "title": "Neighborhood Housing Services Of North Bronx, Inc.",
      "service area": "WILLIAMSBRIDGE",
      "address": "2ND FLOOR 1451 E GUNHILL RD BRONX, NY 10469",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=192",
      "email": "oscar_morillo@nhsnyc.org",
      "description": "Neighborhood Housing Services of the North Bronx, Inc.,  is a not for profit community housing/development corporation created with the purpose of stimulating reinvestment in the North Bronx's neighborhoods and to stop redlining practices of the 1980s against homeowners and residents of our community who were predominantly Latinos and African American. Today, we continue to facilitate lending for low and moderate income residents, provide homeownership  education, counseling and affordable housing development opportunities.  As as ressult"
    },
    {
      "website url": "http://www.nwnainc.com",
      "phone no.": "(607) 733-4924",
      "contact person": "BETH FARR",
      "title": "Near Westside Neighborhood Association, Inc.",
      "service area": "ELMIRA",
      "address": "353 DAVIS ST ELMIRA, NY 14901",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=193",
      "email": "nearwestside@stny.rr.com",
      "description": "The Association was first formed in 1977, by a group of West Gray Street residents who became alarmed by the deterioration of the neighborhood. The group wan incorporated in 1978, to become Near Westside Neighborhood Association, Inc., (NWNA) a non-profit organization. The purpose of NWNA is to enhance the quality of life in our community through the development and revitalization of housing and the preservation of historic structures in the City of Elmira."
    },
    {
      "website url": "",
      "phone no.": "(718) 538-3344",
      "contact person": "EDWARDO LAGUERRE",
      "title": "Neighborhood Association For Intercultural Affairs",
      "service area": "MORRISANIA/HIGH BRIDGE",
      "address": "SUITE 1B 1075 GRAND CONCOURSE BRONX, NY 10452",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=194",
      "email": "naica981@cs.com",
      "description": "The overall mission of the Neighborhood Association for Inter-Cultural Affairs, Inc. (NAICA) is dedicated to the economic, social and cultural resurgence of our Bronx neighborhoods. We seek to serve as a catalyst for self-realization that transforms and uplifts the lives of community residents. NAICA was founded on the principle that people need an affordable solution to dealing with their housing problems. Our goal is to build and maintain affordable housing, to provide housing mediation and legal representation to low income area tenants, to help residents become active and contributing citizens, and to provide educational-cultural programs aimed at bringing together the myriad of cultures that make up the Bronx. It is our objective to create an environment in our community that engages us in partnerships with residents, business leaders, and elected governmental officials in the creation of a living environment that is safe, nurturing, and affordable to low and moderate income individuals and families."
    },
    {
      "website url": "http://www.nidcny.org",
      "phone no.": "(718) 231-9800",
      "contact person": "WILLIAM FOSTER",
      "title": "Neighborhood Initiatives Development Corp.",
      "service area": "NORTHEAST BRONX",
      "address": "2523 OLINVILLE AVE BRONX, NY 10467",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=195",
      "email": "wfoster@nidcny.org",
      "description": "Neighborhood Initiatives Development Corporation (N.I.D.C.) is a non-profit organization that was formed in 1982 to stabilize the neighborhoods within Bronx Community Board 11 and to ensure the provision of safe, decent, affordable housing for low to moderate income residents.  N.I.D.C. has grown as an agency and now has an annual budget of more than $900,000, which comes from both government and private sources.  Our services have expanded to include commercial revitalization, job readiness, and a full range of youth programs.  N.I.D.C.'s housing services include assistance to individual tenants, organizing of tenant associations, helping with loans and subsidy programs, informational workshops and newsletters for tenants and building owners, and addressing crime problems and quality of life issues in apartment buildings and throughout the community."
    },
    {
      "website url": "http://www.neadrochester.org",
      "phone no.": "(585) 482-7320",
      "contact person": "GEORGE MOSES",
      "title": "North East Area Development, Inc.",
      "service area": "NORTHEAST ROCHESTER",
      "address": "360 WEBSTER AVE ROCHESTER, NY 14609",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=198",
      "email": "gmoses@neadrochester.org",
      "description": "North East Area Development, Inc. (NEAD) is a non-profit Neighborhood Preservation Company comprised of individuals, block organizations and business associations working together to revitalize living and working conditions within Sector 8 of Rochester's north east side. NEAD has served the community for over 40 years, providing leadership in quality of life enhancement."
    },
    {
      "website url": "http://www.northfieldldc.org",
      "phone no.": "(718) 442-7351",
      "contact person": "JOAN CATALANO",
      "title": "Northfield Community Local Development Corporation",
      "service area": "PORT RICHMOND",
      "address": "160 HEBERTON AVE STATEN ISLAND, NY 10302",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=201",
      "email": "northfieldldc.jcat17@gmail.com",
      "description": "Northfield Community LDC provides services to the community through housing, weatherization, economic development,  and social services for seniors. Northfield strives to improve the housing conditions in the community by meeting regularly with  residents to discuss the needs of the community.  Housing services include developing housing to create homeownership opportunities for low- and moderate-income residents who might otherwise be excluded from the housing market.  To that end the organization administers a HOME subsidy grant; purchases and rehabilitates currently dilapidated houses; provides homebuyer workshops and one on one counseling; and pursues opportunities to develop new affordable homeownership units.  We assist property owners who wish to make repairs to their homes by providing rehabilitation loan information.  The organization provides referrals to rental housing management companies and maintains a listing of rent regulated apartments in our area. For tenants living in poor housing conditions, the organization provides referrals, processes code violation complaints, makes dispute resolution referrals, informs landlords regarding loans available to make repairs and training resources. Northfield LDC has been providing Weatherization services to the community for almost 20 years.  The organization also administers complementary programs which augment the repairs made under Weatherization. Economic development activities are targeted to the Port Richmond commercial district. Northfield administers a revolving loan fund for new and expanding businesses, works directly with merchants to promote the district, and brings educational resources to the business owners."
    },
    {
      "website url": "http://www.northwestbronx.org",
      "phone no.": "(718) 584-0515",
      "contact person": "CLAY SMITH",
      "title": "Northwest Bronx Community & Clergy Coalition",
      "service area": "NORTHWEST BRONX",
      "address": "103 E 196TH ST BRONX, NY 10468",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=202",
      "email": "clay@northwestbronx.org",
      "description": "Northwest Bronx Community and Clergy Coalition (NWBCCC) is a coalition of 10 neighborhood-based organizations in the Northwest Bronx.  The NWBCCC was formed in 1984. The chief services provided by the Coalition and its affiliates are organizing assistance to parents of school children, tenants, community residents through our Safe Streets program, and to students through the Youth Program.  NWBCCC works on area-wide campaigns that benefit the community.  Combating school overcrowding is our most important such campaign at the moment.  The Education Committee's work contributed to the opening of seven new school buildings last fall.  Other current activities include working to keep the North Central Bronx Hospital from reducing its services or even closing; fighting the location of the federally mandated water filtration plant in Van Cortlandt Park; and working for the implementation of \"community policing\" in cooperation with the police leadership in the Northwest Bronx."
    },
    {
      "website url": "http://www.ncscdc.org",
      "phone no.": "(585) 254-8090",
      "contact person": "FRANK CORNIER",
      "title": "Ncs Community Development Corp.",
      "service area": "NORTHWEST ROCHESTER",
      "address": "275 DRIVING PARK AVE ROCHESTER, NY 14613",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=203",
      "email": "frankcornier@ncscdc.org",
      "description": "NCS was founded in 1968 and is considered to be one of Rochester's first grassroots organizations serving the low-to-moderate income community.  NCS's primary focus is affordable housing.  NCS develops and sells approximately 25 single family houses a year to first-time, low-to-moderate income families.  NCS also administers grants to existing low-to-moderate income families living in the northwest part of the City of Rochester.  As a licensed Real Estate Office, NCS can help families find a home for sale on the private market or can help existing homeowners sell their current property.  NCS is committed to improving the quality of life of the families it serves.  To that end, NCS offers Lead Awareness Training, Block Club Training, Credit Counseling and other much needed services.  For more information on any of our programs, please visit our web site or contact us by phone or e-mail."
    },
    {
      "website url": "",
      "phone no.": "(718) 728-6886",
      "contact person": "JOHN P. KAITERIS",
      "title": "Northwest Queens Housing Corp.",
      "service area": "ASTORIA",
      "address": "GEORGE T DOURIS TOWER 27-40 HOYT AVE ASTORIA, NY 11102",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=204",
      "email": "zoeartemis@aol.com",
      "description": "Northwest Queens Housing Corp. is a non-profit neighborhood preservation company whose purpose is to revitalize our community.  We offer programs and services to create affordable housing and help our clients find affordable housing and other needed social services.  We assist clients in applying for a variety of economic relief programs, such as Section 8, IT-214 tax credits, HEAP, STAR, and public housing.  By providing the essential information and assisting the client in the application process, we are providing economic relief to low-middle income clients.  Many are seniors; many cannot speak English; and many would not be aware of their entitlements if it was not for Northwest Queens Housing Corp. We also provide assistance with landlord-tenant issues, such as filling out leases, recertifications, explanation of rent stabilization and rent control laws and act as an intermediary when there is a conflict between tenant and landlord. In this densely populated area with its slow vacancy rates, the services we provide are essential to our client population."
    },
    {
      "website url": "http://www.urbanctr.org",
      "phone no.": "(716) 893-7222",
      "contact person": "MARLIES WESOLOWSKI",
      "title": "Lt. Col. Matt Urban Human Services Center Of Wny",
      "service area": "BROADWAY-FILLMORE",
      "address": "1081 BROADWAY BUFFALO, NY 14212",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=211",
      "email": "lvishwanath@urbanctr.org",
      "description": "The Center provides a wide range of services to the population of the Broadway Fillmore District of the East Side of Buffalo."
    },
    {
      "website url": "http://www.recap.org",
      "phone no.": "(845) 342-3978",
      "contact person": "JOSEPH CZAJKA",
      "title": "Regional Economic Community Action Program, Inc.",
      "service area": "MIDDLETOWN",
      "address": "40 SMITH ST MIDDLETOWN, NY 10940",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=216",
      "email": "recap@recap.org",
      "description": "The Regional Economic Community Action Program, Inc. (RECAP) is a registered not-for-profit charitable organization located in the city of Middletown, which has been administering funds from federal, state, and community sources since 1965.  The agency's service area is 550 square miles and encompasses Western Orange County.  RECAP is a multi service, anti-poverty agency that benefits thousands of people annually.  RECAP's mission is to mobilize and coordinate public and private resources to address the basic needs of low-income people while they attain the skills, knowledge, motivations, and opportunities needed to become economically self sufficient.  RECAP has extensive experience in the provision of services to the poor.  Designated as a Neighborhood Preservation Company in 1985, RECAP's Housing services entail the management of 135 affordable units that provides shelter and services to special needs individuals and families.  RECAP's Community Re-Entry Program earned the Fannie Mae Award of Excellence in 1991, for providing affordable housing to homeless families living in hotels and motels.  RECAP also offers transitional and homeless housing services; alcohol/substance abuse prevention; subsidized housing for individuals and families suffering HIV/AIDS; a first time home ownership program; and a Heating Oil Purchasing Initiative (HOPI) program, which addresses the need for families to secure heating oil at affordable prices.  RECAP's staff is trained in assisting with entitlements, advocacy, information and referral case management, and other support services.  RECAP offers a nutrition program Food Pantry, Head Start, Weatherization, and Educational Component, and Senior Citizen Housing."
    },
    {
      "website url": "",
      "phone no.": "(845) 352-1400",
      "contact person": "SHULAMIS CHAIT",
      "title": "Rockland County Development Council, Inc.",
      "service area": "MONSEY",
      "address": "22 MAIN ST MONSEY, NY 10952",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=217",
      "email": "rcdchousing@aol.com",
      "description": "Rockland County Development Council is committed to ensuring that residents in its service area are offered needed services so that they may enjoy safe, sanitary, affordable housing.  RCDC works towards increasing the number of available affordable housing units and assists with maintenance and repair of existing affordable units to help extend their useful life.  RCDC helps decrease monthly utility costs through weatherization and other energy efficiency programs.  Assistance is given to help lower utility expenses through HEAP and Neighbor Fund grants as well as private donations.  RCDC helps identify and resolve health and safety issues existing in Rockland's aging housing stock."
    },
    {
      "website url": "http://www.sebcodevelopment.org",
      "phone no.": "(718) 617-2800",
      "contact person": "JOHN CALDERONE",
      "title": "South East Bronx Community Development Corp.",
      "service area": "HUNTS POINT/ALDUS/LONGWOOD",
      "address": "885 BRUCKNER BLVD BRONX, NY 10459",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=221",
      "email": "jcalderone@sebcodevelopment.org",
      "description": "The South East Bronx Community Organization (SEBCO) was formed in the fall of 1968, under the visionary leadership of Father Louis R. Gigante. The mission of SEBCO is to provide both affordable housing and to improve the quality of life for the residents of Hunts Point. SEBCO works with urban planners and political leaders to develop schools, recreational facilities, and to redevelop the infrastructure, in order to pave the way for the reinvigoration of the neighborhood's housing stock. Through its development efforts, SEBCO has obtained extensive experience undertaking renovation and rehabilitation work in occupied multi-family buildings and is consistently recognized as one of New York City's top subsidized housing developers.  While the majority of the housing developed has been for low-income families, seniors and the formerly homeless, SEBCO also sponsors the construction and renovation of private houses, coops, and condos. As of June 2000, SEBCO has been involved in the creation of 63 apartment buildings and 358 private homes, coops, and condos. This represents a total of 2,991 housing units. Close to 3,000 families are living in permanent housing that SEBCO has developed over the past 32 years. SEBCO's focus is not limited to physical housing but in improving all aspects of the community. We provide over 130 hot meals in our Department for the Aging sponsored senior center; our computer learning center prepares community residents for the workplace. Over 2,000 residents receive our newsletter six times per year. Five after-school programs provide tutoring for over 80 children. Another social service mission of SEBCO Development is to provide quality transitional housing for homeless families. SEBCO operates two TIER II shelters composed of 96 units for New York City Department of Homeless Services. An important goal is not only providing temporary housing for the homeless, but locating quality permanent housing and preparing families for that important next step."
    },
    {
      "website url": "http://www.myseac.org",
      "phone no.": "(585) 244-7405",
      "contact person": "DONALD BOYD",
      "title": "South East Area Coalition, Inc.",
      "service area": "SOUTHEAST ROCHESTER",
      "address": "243 ROSEDALE ST ROCHESTER, NY 14620",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=226",
      "email": "hbhogan@myseac.org",
      "description": "South East Area Coalition, Inc. (SEAC), is a not-for-profit community development corporation designated by New York State as a Neighborhood Preservation Company. SEAC serves approximately 40,000 households. Residents of the Rochester south east area are diverse in age, education, ethnicity, gender and economic means. SEAC is a resource and partner for the south easts 25 neighborhood organizations and seven merchants associations. SEAC is a unique organization in Rochester. It helps  to identify and address citizen concerns and to achieve community goals through collaborative planning and action. SEAC supports grassroots participation from neighborhood associations, committees and coalitions of agencies, businesses, faith-based, educational institutions and individuals."
    },
    {
      "website url": "http://www.seicny.org",
      "phone no.": "(518) 436-8777",
      "contact person": "MONIQUE WAHBA",
      "title": "South End Improvement Corp.",
      "service area": "SOUTH END OF CITY OF ALBANY",
      "address": "38 CATHERINE ST ALBANY, NY 12202",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=227",
      "email": "southendimprovementcorp@gmail.com",
      "description": "The South End Improvement Corporation (SEIC) has been in business since 1978. The mission of SEIC is to aid, assist and foster the planning, development, renewal and improvement of housing conditions in the South End Environs area in the City of Albany, New York;  thereby encouraging city living and the preservation of the residential and commercial character of the area. The service area encompasses approximately 10% of the entire population of Albany, which Albany's population is nearly 95,000 residents. SEIC supports several active neighborhood associations/groups, such as: South End Neighborhood Association (SENA), Delaware Avenue Neighborhood Association (DANA), Lincoln Park, Mt. Hope Townhouse, Krank Park, the Pastures and the Mansion association. These groups conduct regular meetings, organize community activities which promote social interaction, support the improvement of quality of life issues for the South End residents and work in conjunction with SEIC to improve, preserve and stabilize the neighborhoods of its community. SEIC also provides assistance through its Home Maintenance and Security program (\"SHIP aka HMS\"). This assistance is offered to low-moderate income homeowners, as established by HUD income guidelines. The SHIP program affords homeowners up to $1,000 for repairs to their owner occupied houses. In addition, SEIC provides home buyer education and support for tenants with an active interest in purchasing a home as a first time home buyer in the South End. SEIC was the marketing agent for the Frederick Douglass Affordable Housing Program, which was offered through the Albany Housing Authority as the lead agency, and Charles Touhey's company as the developer. Through the collaborative efforts of these two organizations, 15 new homes were built in the South End, placing families of modest means into home ownership for the first time! In addition, SEIC has nearly completed its second RESTORE program. Through RESTORE, 14 Senior owner occupied houses in the community were assisted with emergency repairs. SEIC, through its OUTREACH program provided assistance (and follow-up communication) with its Senior Citizens and other community members. This service includes, but is not limited to, home maintenance assistance, social services support which ensures that senior homeowners, low income homeowners, senior tenants and low income tenants, are receiving all eligible services available to them through programs such as: Home Energy Assistance Program (HEAP), heath care assistance, and the Meals on Wheels  food program. Last, but not least, SEIC has a new homeowner rehabilition program called HARP. Through HARP, SEIC will rehabilitate 13 units for folks of  modest means who own and occupy their homes. The maximum assistance is $19,156.00 per unit. One unit  was completed during this program year."
    },
    {
      "website url": "http://www.swpc.org",
      "phone no.": "(585) 256-1740",
      "contact person": "JOHN PAGE",
      "title": "South Wedge Planning Committee, Inc.",
      "service area": "SOUTH WEDGE",
      "address": "224 MT HOPE AVE ROCHESTER, NY 14620",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=228",
      "email": "jpage@swpc.org",
      "description": "The mission of the South Wedge Planning Committee, Inc. is to build community in the South Wedge by encouraging a full range of housing opportunities, and to promote a diverse, historically significant, and commercially viable urban village. To enhance the quality of life in the South Wedge neighborhood, we work to reduce crime, engage residents in the neighborhood through block clubs, tenant associations, and community events; and to beautify the neighborhood. To meet housing needs, we strive to increase homeownership, improve the housing stock,  and develop affordable housing opportunities. To promote commercial development, we work with new and existing business owners to increase the survival rate of their businesses, decrease the commercial vacancy rate, and improve the appearance of commercial areas. Services we provide include home repair grants to low-income owner-occupants; the acquisition, rehab, and sale of homes to income-qualified first-time homebuyers; business assistance and counseling for potential and existing urban entrepreneurs; community organizing and beautification; neighborhood marketing; and crime prevention."
    },
    {
      "website url": "http://www.laligaonline.com",
      "phone no.": "(315) 475-6153",
      "contact person": "MOISES RIVERA",
      "title": "Spanish Action League Of Onondaga County, Inc.",
      "service area": "NEAR NORTH, NEAR WEST, & NEAR SOUTH OF CITY OF SYRACUSE",
      "address": "700 OSWEGO ST SYRACUSE, NY 13204",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=230",
      "email": "rpaniagva@laligaonline.com",
      "description": "The Spanish Action League of Onondaga County Inc. is a not-for profit, bilingual (Spanish-English) organization incorporated in 1969 to provide comprehensive services to the Latino community and to address the unique needs arising from language and cultural barriers.  The Latino community has grown dramatically in Syracuse, NY and Onondaga County since then (Census Data 2000).  In 1980, the Spanish Action League received funding from the New York State Division of Housing and Community Renewal.  Ever since we have been providing assistance to low and moderate income families and individuals to help them obtain and keep decent, safe, and affordable housing.   Services provided at the Spanish Action League include the full range of social services.  We provide career, domestic violence prevention, Family Support, and Translation and Interpretation services.  The housing unit provides general information and referrals, tenant counseling, negotiations with landlords, relocation assistance, eviction prevention, educational workshops/seminars, and assistance with rent subsidy applications.   Assistance is provided with other housing programs (HEAP, Weatherization).  We help clients with their housing grievance complaints and find support services for discrimination complaints which can include referrals for legal services.  Advocacy assistance is also provided in housing court and small claims court.   Homeowners receive referrals and assistance for home ownership issues, and home repair grants and loans.   Our housing department assists qualified families and individuals apply for and receive emergency financial assistance to prevent eviction and mortgage foreclosure.  In addition, we provide support services for the homeless population and assist them in obtaining permanent housing."
    },
    {
      "website url": "http://www.stryckersbay.org",
      "phone no.": "(212) 874-7272",
      "contact person": "KELLEY WILLIAMS",
      "title": "Strycker'S Bay Neighborhood Council",
      "service area": "UPPER WEST SIDE",
      "address": "105 W 86TH ST NEW YORK, NY 10024",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=234",
      "email": "info@stryckersbay.org",
      "description": "For the past 50 years, the mission of the Strycker's Bay Neighborhood Council, Inc. (SBNC) has been to assist low-income residents of the Upper West Side to solve problems of inadequate housing and other related community services and to help empower them to improve their quality of life. Since our beginning, we have looked beyond housing problems to address the comprehensive range of issues that affect the welfare of our community residents including education, employment, youth development, and open space. Strycker's Bay serves as a door of opportunity for neighborhood people seeking to gain valuable leadership skills by volunteering, becoming a member of our staff, or participating in the development of neighborhood programs and projects."
    },
    {
      "website url": "",
      "phone no.": "(631) 665-2866",
      "contact person": "DAVID N. HILGENDORFF",
      "title": "Suburban Housing Development & Research, Inc.",
      "service area": "BAY SHORE/WEST BRENTWOOD",
      "address": "5012 1377 5TH AVE BAY SHORE, NY 11706",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=235",
      "email": "subpen@optonline.net",
      "description": "Suburban Housing Development & Research, Inc. continues to provide emergency and permanent housing for homeless families in Suffolk County. Suburban Housing seeks to assist neighborhood residents of the lowest income who need housing, need help in keeping their present housing, or need social services. Suburban Housing seeks the cooperation and assistance of those governmental and social institutions who serve the community for the betterment of all citizens.  Efforts to work with, learn from, and hopefully educate those in the local housing sector will be ongoing."
    },
    {
      "website url": "",
      "phone no.": "(315) 476-7475",
      "contact person": "RICHARD PUCHALSKI",
      "title": "Syracuse United Neighbors, Inc.",
      "service area": "SOUTHWEST SYRACUSE",
      "address": "1540 SOUTH SALINA ST SYRACUSE, NY 13205",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=239",
      "email": "rich@sunaction.org",
      "description": "Syracuse United Neighbors, Inc. (SUN) is a membership organization incorporated in 1978 who's mission is to organize people living on the south, southwest and near-westside of the city of Syracuse into a group of active, knowledgeable, and involved citizens who strive for: homes that are affordable and in good repair; access to quality public and private services to improve neighborhood; and a crime and drug-free community.  SUN works to improve the housing stock in low-to-moderate income neighborhoods.  We advocate for better city services, improved code enforcement, well-paved streets, expanded community policing, and removal of unsafe vacant homes. SUN counsels, makes referrals and can complete applications on the following: public and private funds for home improvement, HEAP, Weatherization, State's property tax exemptions, and negotiate settlements with some financial institutions on predatory loans and foreclosures.  SUN works with private and public financial institutions to increase funds for housing rehabilitation, purchase and construction in our service area."
    },
    {
      "website url": "http://www.tapinc.org",
      "phone no.": "(518) 274-3050",
      "contact person": "JOSEPH FAMA",
      "title": "Tap, Inc.",
      "service area": "TROY: SOUTH, CENTRAL, HILLSIDE, COLLAR CITY, MT. IDA, AND NORTH CENTRAL SECTIONS",
      "address": "210 RIVER ST TROY, NY 12180",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=240",
      "email": "famajoe@tapinc.org",
      "description": "TAP, Inc. provides design, architectural, planning and graphic assistance to low- and moderate-income individuals, nonprofit corporations and neighborhood groups. TAP disseminates information on programs instituted for the benefit of the targeted populations and acts as advocate for such persons on planning decisions. TAP regularly receives funding from NYS DHCR, NYSCA, client fees for services, foundation/corporate grants and individual contributions."
    },
    {
      "website url": "",
      "phone no.": "(212) 233-6037",
      "contact person": "JOEL KAPLAN",
      "title": "United Jewish Council Of The East Side, Inc.",
      "service area": "LOWER EASTSIDE",
      "address": "235 E BROADWAY NEW YORK, NY 10002",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=244",
      "email": "joelkujc@aol.com",
      "description": "United Jewish Council of the East Side, Inc. (UJC) is committed to providing a variety of services to a multiethnic community.  Staff is able to make these services available to individuals speaking Spanish, Russian, Chinese, Yiddish, and Hebrew as well as English. Services and programs are provided at 10 sites throughout the Lower East Side and include 300 meals served to seniors daily at three sites, home delivered meals, housing for the high functioning mentally ill, senior, and low income housing.  UJC provides intensive social services including access to food stamps, Medicaid, and housing advocacy.  Through UJC's Home Attendants Corporation, the Council employs 1000 home attendants serving 600 households.  In addition, UJC provides mental health and immigration services.  The Council distributes food vouchers, food packages, weekend meals, and guidance related to Medicaid managed care.  Staff will appear with clients at fair hearings and court hearings and frequently has to provide translation services.  Advocacy is provided in tenant/landlord disputes. UJC runs a 14 passenger van service (wheelchair accessible) and makes it possible for seniors to get to doctors appointments, shop, etc. Through its Pharma program low-income individuals of any age are able to obtain prescription medications at no cost from pharmaceutical manufacturers. The Council, in partnership with the New York City Police Department, 7th Precinct, produces photo identification cards for seniors, a VIN etch program, home safety education, awareness about youth gangs, and child protection advice, among other activities. The Lower East Side VOICE, a 24-page newspaper, is published four times a year and is distributed throughout the neighborhood."
    },
    {
      "website url": "http://www.unitedtenantsalbany.org",
      "phone no.": "(518) 436-8997",
      "contact person": "MARIA MARKOVICS",
      "title": "United Tenants Of Albany, Inc.",
      "service area": "SECTIONS OF ALBANY: SOUTH END, DELAWARE AVE, ARBOR HILL, NORTH ALBANY, WEST HILL, PINE HILLS, CENTER SQUARE, MANSION, HUDSON PARK, PARK SOUTH",
      "address": "33 CLINTON AVE ALBANY, NY 12207",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=245",
      "email": "utalb@verizon.net",
      "description": "For over thirty years, United Tenants of Albany (UTA) has provided housing services to the Albany community.  UTA's crisis hot-line responds annually to over 5,000 requests for information and housing counseling.  The homeless prevention and the mortgage default counseling programs are directed at assisting low- and moderate-income tenants and homeowners remain in their homes through a combination of intensive counseling, advocacy, mediation, and, in some situations, emergency financial assistance to prevent the eviction or mortgage foreclosure.  UTA staff conducts workshops for various human service organizations on such topics as how to look for apartments, landlord/tenants rights and responsibilities, eviction procedures, and other issues of importance to tenancy.  Pre-purchase counseling is provided to tenants interested in becoming homeowners.  United Tenants of Albany works closely with the Albany Community Land Trust, the Capital District Community Loan Fund, Albany Area Housing Opportunities, and the Affordable Housing Partnership in an effort to increase and maintain the availability of low-income housing in the City of Albany."
    },
    {
      "website url": "http://www.unhs.org",
      "phone no.": "(315) 724-4197",
      "contact person": "JANICE A. FORTE",
      "title": "Utica Neighborhood Housing Services, Inc.",
      "service area": "CORN HILL AND EAST UTICA",
      "address": "1611 GENESEE ST UTICA, NY 13501",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=248",
      "email": "jforte@unhs.org",
      "description": "Utica Neighborhood Housing Services, Inc.'s (UNHS) mission is the revitalization and growth of neighborhoods in the Cornhill and East Utica areas of Utica. UNHS utilizes numerous programs and funding sources to accomplish its mission."
    },
    {
      "website url": "",
      "phone no.": "(212) 795-7522",
      "contact person": "DEBORAH HES",
      "title": "Washington Heights Inwood Preservation And Restoration Corp.",
      "service area": "WASHINGTON HEIGHTS/INWOOD",
      "address": "SUITE 11A 121 BENNETT AVE NEW YORK, NY 10033",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=249",
      "email": "dhes@jccwhi.com",
      "description": "Washington Heights Inwood Preservation and Restoration Corporation (WHIPRC) was incorporated in 1977 as a not for profit 501(c)3 agency with a mission to preserve the neighborhood and improve the quality of life for its residents.  WHIPRC responds to the needs of the community by offering services in several languages including Russian, Hebrew, Yiddish, Spanish, German, as well as English.  This agency provides a broad spectrum of housing and social services to its clients, the majority of whom are low income, non-English speaking immigrants, vulnerable elderly, and the working poor.  WHIPRC's housing programs improve housing stock; assist its residents in acquiring and maintaining adequate, affordable, safe housing; help clients to secure and keep entitlements, such as Section 8, SCRIE, DRIE, HEAP, HEAT, etc.; negotiate with tenants and landlords regarding rent arrears and repairs; and prevent homelessness through eviction prevention.  WHIPRC's social services include benefits and entitlements assistance, case assistance and advocacy, crisis intervention, information and referral, friendly visiting, telephone reassurance, food pantry, and food vouchers.  Funding is received from city, state and private-sector sources. For over 30 years, WHIPRC has a proven track record for effective service delivery to the community.  In addition, WHIPRC coordinates multi-ethnic coalitions to address broader neighborhood issues and strengthen intercommunity relations."
    },
    {
      "website url": "http://www.washingtonvillehousing.org",
      "phone no.": "(914) 698-4299",
      "contact person": "RACHEL SPADARO",
      "title": "Washingtonville Housing Alliance, Inc.",
      "service area": "SOUNDSHORE AREA OF MAMARONECK & MAMARONECK CENTRAL BUSINESS DISTRICT",
      "address": "136 LIBRARY LN MAMARONECK, NY 10543",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=250",
      "email": "rachel.spadaro@westhab.org",
      "description": "The Washingtonville Housing Alliance was formed in 1980 to improve the housing conditions of low and moderate-income residents in the Mamaroneck area. The Alliance constructs new housing, improves existing housing and undertakes other supportive activities designed to sustain a community that is culturally diverse, multi-generational and of mixed income.  Our organization is directed by a 17 person volunteer board of local residents who donate time and expertise to assist with public relations, legal, fundraising and other matters."
    },
    {
      "website url": "",
      "phone no.": "(718) 798-0929",
      "contact person": "SALLY BARKER DUNFORD",
      "title": "West Bronx Housing And Neighborhood Resources Center, Inc.",
      "service area": "COMMUNITY DISTRICTS 5 & 7",
      "address": "220 E 204TH ST BRONX, NY 10467",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=251",
      "email": "sdunford15@aol.com",
      "description": "West Bronx Housing and Neighborhood Resource Center (WBHNRC) provides technical assistance to owners and tenants in the north west quadrant of the Bronx.  A small agency, dedicated to making change one tenant or owner at a time, WBHNRC views itself as neither pro-tenant or pro-owner, but rather as a problem-solver.  The agency approaches each situation as unique and consciously tailors solutions to individual problems utilizing a wide menu of proven tactics and strategies, ranging from (and beginning with) a friendly phone call to court action."
    },
    {
      "website url": "",
      "phone no.": "(212) 862-1399",
      "contact person": "DONALD C. NOTICE",
      "title": "West Harlem Group Assistance, Inc.",
      "service area": "WEST HARLEM/HAMILTON HEIGHTS",
      "address": "1652 AMSTERDAM AVE NEW YORK, NY 10031",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=253",
      "email": "dnotice@whgainc.org",
      "description": "West Harlem Group Assistance, Inc. (WHGA) serves the overwhelmingly minority communities of Central and West Harlem, located in Manhattan Community Districts 9 and 10. As more than 34% of the area's population is dependent upon some form of income support, and unemployment among all age groups is significantly higher than the national average, the importance of ensuring the availability of affordable housing, while improving access to economic opportunities, is crucial to the company  mission. The Company's mission builds on community capacities and assets, and engages positive and constructive action. WHGA's  mission is to:"
    },
    {
      "website url": "",
      "phone no.": "(212) 595-8983",
      "contact person": "LAURA R. JERVIS",
      "title": "West Side Federation For Senior And Supportive Housing, Inc.",
      "service area": "UPPER WESTSIDE",
      "address": "2345 BROADWAY NEW YORK, NY 10024",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=255",
      "email": "ljervis@wsfssh.org",
      "description": "West Side Federation for Senior  Housing, Inc. (WSFSH) is a community-based organization responding to the need for low-cost housing.  The mission of WSFSSH is to provide safe, affordable housing with supportive services within a residential setting that enhances the independence and dignity of each person.  WSFSSH develops, manages, and provides social services in housing for low income persons, especially the elderly, homeless, and those with mental illness. WSFSH operates 447 independent apartments; an 80 bed adult care facility for frail elderly persons; 493 Single Room Occupancy (SRO) units;  Valley Lodge, a transitional shelter for 92 homeless elderly, who are helped to move on to permanent housing; and Fleming House, an adult home for 47 mentally ill homeless elderly individuals; the Ben Michalski Residence, which provides 18 units of permanent housing for people with AIDS; and the West 129th Street Residence, an adult residence for 82 homeless individuals, many of whom face the challenges of mental illness and substance use."
    },
    {
      "website url": "http://www.wyandanchcdc.org",
      "phone no.": "(631) 643-4786",
      "contact person": "SONDRA COCHRAN",
      "title": "Wyandanch Community Development Corp.",
      "service area": "TOWN OF BABYLON",
      "address": "59 CUMBERBACH ST WYANDANCH, NY 11798",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=259",
      "email": "sondrawcdc@optonline.net",
      "description": "Wyandanch Community Development Corporation (WCDC) was formed in 1969 by community members concerned with neighborhood revitalization and preservation.  WCDC's mission is to conduct and participate in Community Development Programs designed to preserve the community, protect the health and safety of residents, complement housing rehabilitation programs, and promote self-help programs. Ultimately these efforts promote further economic development in the target area and improve quality of life for residents. WCDC offers comprehensive housing counseling.  WCDC works with the local government to acquire dilapidated units for rehabilitation and vacant property for new construction.  Once completed, these units are a source of safe, affordable, decent housing for income eligible (Section 8 and HOME Guidelines) families who would  be forced to reside in substandard conditions without the program.  In addition to creating  housing, we work with our tenants through our Tenant's Association.  Now we are adding Affordable Homes for income-eligible buyers."
    },
    {
      "website url": "http://www.acrha.org",
      "phone no.": "(518) 765-2425",
      "contact person": "JUDITH A. EISGRUBER",
      "title": "Albany County Rural Housing Alliance, Inc.",
      "service area": "TOWNSHIPS OF NEW SCOTLAND, COEYMANS, KNOX, WESTERLO, BERNE, RENSSELAERVILLE, VILLAGE OF GREEN ISLAND AND CITY OF COHOES",
      "address": "407 24 MARTIN RD VOORHEESVILLE, NY 12186",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=261",
      "email": "jeisgruber@acrha.org",
      "description": "The Albany County Rural Housing Alliance (ACRHA) is a HUD certified housing counseling agency offering education and individual assistance to anyone in need of housing or housing related services.  The main office is located in Voorheesville and our satellite offices are located in Ravena and Cohoes."
    },
    {
      "website url": "",
      "phone no.": "(585) 593-6353",
      "contact person": "ROBERT SOBECK",
      "title": "Alfred Housing Committee, Inc.",
      "service area": "ALFRED/WELLSVILLE/ALLEGANY COUNTY",
      "address": "14 MADISON ST WELLSVILLE, NY 14895",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=262",
      "email": "alfredhousing@verizon.net",
      "description": "The Alfred Housing Committee, Inc. serves the Towns and Villages of Alfred, Almond, and Wellsville.  Small municipalities often cannot afford planning or development staffs, so on many occasions and in many ways rural preservation companies answer the call.  The Alfred Housing Committee offers a full range of housing services including rehabilitation, tenants rights, and new construction, and is the community development arm of the municipalities in their service area.  They have developed infrastructure; prepared documentation for inclusion in the recently expanded Empire Zones in Wellsville and Alfred; upgraded municipal water and sewer systems; and installed new systems, accessing federal and state resources with an eye toward \"affordability.\"  A $300,000 Strategic Initiative grant allowed a water project in the Town of Wellsville to become a reality after 15 years of frustration for municipal officials and low-income residents.  Alfred has secured a land donation for the development of an industrial park, and administers a municipal revolving loan fund that encourages business creation and job development through low interest loans.  Federal funding made possible a joint comprehensive plan for the Town and Village of Wellsville which will be a living document reflecting the changing needs of the municipalities and, more importantly, will be the touchstone for new development in the future.  Alfred Housing Committee has made a significant impact on the substandard housing in all six municipalities in its service area, continuing  the long-standing program of housing rehabilitation through the NYS Affordable Housing Corporation.  The average owner-occupied housing rehabilitation project cost is $12,500.  Sixty percent of this cost is a grant to the homeowner who must provide the remaining 40%, with Alfred assisting them to obtain  the additional funds through loan packaging, usually with USDA/RD's 502/504 Housing Rehabilitation program or other loan and grant programs."
    },
    {
      "website url": "http://www.accordcorp.org",
      "phone no.": "(585) 268-7605",
      "contact person": "LESLEY GOOCH-CHRISTMAN",
      "title": "Allegany County Community Opportunity And Rural Development",
      "service area": "ALLEGANY COUNTY",
      "address": "573 84 SCHUYLER ST BELMONT, NY 14813",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=263",
      "email": "lchristman@accordcorp.org",
      "description": "Allegany County Community Opportunity and Rural Development Corporation (ACCORD) is the county-wide Community Action Agency and Rural Preservation Company serving Allegany County.  Incorporated in 1972 as Housing Action Corp., its original mission was to improve the housing conditions of the county's low-to moderate income residents.  Over the past thirty + years, ACCORDS's services have expanded to include housing development, management and home ownership assistance; economic, business and community development; family development; and child care, youth and infant and child development services.  The Housing Division administers 191 Section 8 Rental Assistance vouchers, including 25 Family Self-Sufficiency and 10 Family Unification Program vouchers.  It manages, through its title-holding affiliate, Genesee Valley Improvement Corporation, 22 low-income, elderly, and handicapped apartments and 12 community/commercial rentals.  Although the main focus over the years has been owner-occupied housing repair and renovation, in recent years several home ownership assistance programs have been developed, including a Federal Home Loan Bank First Home Club for which ACCORD provides a series of home ownership education workshops.  Family development services include an emergency shelter for victims of domestic violence, a food pantry, a 24-hour emergency hotline, homelessness prevention and a Respite Program, which provides short-term residential care for children with emotional or developmental disabilities.  The Friendship Empire Zone has recently expanded and now includes portions of Wellsville and Alfred as well as the original parts of Friendship and Cuba.  ACCORD created the Allegany Community Development Services, Inc. (ACDSI), a small and emerging Community Development Finance Institution (CDFI).  ACDSI is a non-profit corporation which addresses the education, business, and housing credit needs of low-income persons in Allegany and Cattaraugus Counties.  Highlights of the infant, child and youth services include:  Programs aimed at youth who are parenting, pregnant, or at risk of pregnancy; Child Care Resource and Referral; Advantage After School; and Head Start and Early Head Start."
    },
    {
      "website url": "",
      "phone no.": "(607) 478-8009",
      "contact person": "MONICA R. DEAN",
      "title": "Andover Historic Preservation Corp.",
      "service area": "TOWN AND VILLAGE OF ANDOVER AND TOWN OF INDEPENDENCE IN ALLEGANY COUNTY",
      "address": "713 22 E GREENWOOD ST ANDOVER, NY 14806",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=264",
      "email": "andoverhpc@yahoo.com",
      "description": "Andover Historic Preservation Corporation (AHPC), a 501(c)(3) corporation was established May 20, 1980.  AHPC's mission was and still is to assist low to moderate income homeowners with affordable opportunities for housing improvements, stabilization and preservation of the housing stock in our communities and provide affordable opportunities for home ownership.  AHPC's service area covers the Town and Village of Andover and the Town of Independence.  AHPC is a Rural Preservation Company (RPC) and we apply for and receive grants from a variety of state and federal sources, including the HOME program, CDBG grants and New York State Affordable Housing funding.  With these monies were able to assist low income homeowners with the needed repairs to their homes, address health and safety issues and energy-efficiency issues.  With this assistance AHPC is able to give homeowners the ability to stay in their homes as well as keep the housing stock in good repair for these communities.  AHPC will continue to provide equal access to our safe, decent and affordable rental units and the expansion of additional units as necessary.  AHPC currently manages 17 safe and affordable units of tenant housing for low to moderate income residents.  AHPC will support our communities' efforts with infrastructure assistance as needed for the Town and Village of Andover and the Town of Independence.  We will strive to improve the quality of life for our citizens when opportunities present themselves.  We have done well during the first twenty-six (26) years taking care of our service area of the Town and Village of Andover and the Town of Independence and hope we have many more to come."
    },
    {
      "website url": "",
      "phone no.": "(631) 286-9236",
      "contact person": "HELEN MARTIN",
      "title": "Bellport Hagerman East Patchogue Alliance, Inc.",
      "service area": "WEST BELLPORT-HAGERMAN",
      "address": "121 1492 MONTAUK HWY BELLPORT, NY 11713",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=266",
      "email": "bhepalliance@aol.com",
      "description": "The Bellport, Hagerman, East Patchogue Alliance, Inc. was established in 1979 to address housing problems and to improve community conditions and the quality of life for its residents. The Alliance was certified in 1982 to provide comprehensive housing counseling. The counseling includes budgeting, landlord/tenant responsibilities, mortgage and rent default, utility assistance and reverse mortgage counseling for the elderly.  Since 1984, the Alliance has acquired 42 single family units of housing and built 3 new units for the homeless or low- to moderate-income households.  Home Ownership Management Education Seminars - the H.O.M.E.S. Program educates prospective home buyers about the various mortgage products available to qualified first time borrowers and teaches them the responsibility of home ownership."
    },
    {
      "website url": "http://www.betterhousingtc.org",
      "phone no.": "(607) 273-2187",
      "contact person": "SUSAN OTTENWELLER",
      "title": "Better Housing For Tompkins County Inc.",
      "service area": "TOMPKINS CTY, EXCL. ITHACA, LANSING & E. CAYUGA HEIGHTS",
      "address": "SUITE 102 950 DANBY RD ITHACA, NY 14850",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=267",
      "email": "constructc@betterhousingtc.org",
      "description": "Better Housing for Tompkins County's Mission Statement is as follows:  \"To develop and improve housing opportunities for low and moderate income individuals, families, older people and the disabled in rural Tompkins County.\"  Since its inception in 1981, Better Housing has provided housing and community renewal services to the Towns of Tompkins County through its mission and programs which support the mission.  Current programs that fulfill this mission are: (a) moderate rehabilitation of owner occupied housing, (b) financial and technical assistance to first-time homebuyers (which also has a component of home improvement or rehab, for some buyers, and also includes mobile home replacement), (c) minor repair (ie, home improvement) of owner-occupied housing to enable the elderly and disabled to live independently in a healthy and safe environment, and (d) the provision of affordable rental housing for seniors and families.  All of these programs serve low-income families and individuals (households with incomes at 80% or less of median).   The staff also provides a fair amount of technical assistance to local municipalities and other not-for-profit and for-profit groups in the planning of new programs and services, in the development of new rental projects, and in the preparation of grant applications for funding."
    },
    {
      "website url": "http://www.sheenhousing.org",
      "phone no.": "(585) 461-4263",
      "contact person": "ALLYNN SMITH",
      "title": "Bishop Sheen Ecumenical Housing Foundation, Inc.",
      "service area": "13 COUNTIES: ALLEGANY, CAYUGA, CHEMUNG, LIVINGSTON, MONROE, ONTARIO, SCHUYLER, SENECA, STEUBEN, TIOGA, TOMPKINS, WAYNE, YATES",
      "address": "SUITE 300 935 EAST AVE ROCHESTER, NY 14607",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=268",
      "email": "sheen@rochester.rr.com",
      "description": "Bishop Sheen Ecumenical Housing Foundation, Inc. (Sheen Housing) is a not-for -profit corporation that provides safe, decent, affordable housing for very low-to moderate-income families, seniors and persons with disabilities in order to promote their self worth and dignity.  Sheen Housing was founded in 1968 to help low-income families purchase their first homes by providing loans and grants for closing costs.  Over the past years, programs and staff  have been added to address a wider range of urban and rural housing needs.  Today Sheen Housing supports not only families, but also organizations that provide housing for low-income families."
    },
    {
      "website url": "http://cmhdc.org",
      "phone no.": "(518) 943-6700",
      "contact person": "LAWRENCE J. KRAJESKI",
      "title": "Catskill Mountain Housing Development Corp. Inc.",
      "service area": "GREENE COUNTY",
      "address": "473 448 MAIN ST CATSKILL, NY 12414",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=272",
      "email": "larry@cmhdc.org",
      "description": "Catskill Mountain Housing Development Corporation (CMHDC) serves the 13 communities of Greene County, New York.  This small rural county is home to over 45,000 New Yorkers.  CMHDC is the designated Rural Preservation Company for the county and provides housing assistance in three primary program areas - assisting families purchase their first home;  providing affordable senior housing; and helping families and senior citizens repair their homes.   Owning a home strengthens the stability of families, and CMHDC focuses on increasing home ownership through their programs.  They sponsor regular seminars; provide counseling; and administer programs of financial assistance for first time homebuyers.  Greene County is one of a few areas where home ownership is within the financial reach of low- and moderate-income families.  This favorable market coupled with the opportunities provided by CMHDC has had a positive impact on the future of housing in the area.  Greene County also has a disproportionate share of older New Yorkers.  Assisting elderly homeowners by promoting home repair assistance programs and providing funds for a variety of code related repairs keeps them in comfortable, safe and affordable homes.  CMHDC works with other public and private agencies to leverage funds for these needed repairs.  They also provide senior housing for renters.  Three sites make a total of 80 units available to low-income seniors.  Striving to play an even more vital role in the senior community, CMHDC has received funding to add two new residences in their rural mountain communities and continues to seek opportunities to serve this population."
    },
    {
      "website url": "http://www.homsite.org",
      "phone no.": "(315) 253-8451",
      "contact person": "STEPHEN M. SELVEK",
      "title": "Cayuga County Homsite Development Corp.",
      "service area": "CAYUGA COUNTY, EXCLUDING CITY OF AUBURN",
      "address": "60 CLARK ST AUBURN, NY 13021",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=274",
      "email": "info@homsite.org",
      "description": "Cayuga County Homsite Development Corporation is a not-for-profit housing company which has been in existence for 30 years and provides comprehensive housing services.  These services show a strong emphasis on the rehabilitation of Cayuga County's housing stock for income eligible clients.  In addition to rehabilitation, Homsite administers the Section 8 Program for Cayuga County; manages 48 units of housing for senior citizens through the FmHA 515 and NYS DHCR Turnkey Program; and has been involved in  new construction projects.  Homsite provides extensive housing counseling services (landlord/tenant, mortgage default, property maintenance, purchase, pre-purchase) and has helped clients purchase homes through the Housing Trust Fund Mortgage Assistance Program.  Homsite also provides security deposits to eligible clients and conducts various housing workshops both in group sessions and in more individualized meetings."
    },
    {
      "website url": "http://www.chric.org",
      "phone no.": "(716) 753-4650",
      "contact person": "JAMES A. GOODLING",
      "title": "Chautauqua Home Rehabilitation And Improvement Corp.",
      "service area": "CHAUTAUQUA COUNTY, EXCLUDING CITY OF JAMESTOWN",
      "address": "2 ACADEMY ST MAYVILLE, NY 14757",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=275",
      "email": "jim_goodling@chric.org",
      "description": "**Chautauqua Home Rehabilitation and Improvement Corporation (CHRIC) was organized in 1977 to improve the quality and appearance of the housing stock and communities of Chautauqua County, and to improve the living conditions of its low-income residents. By 1994,  the agency had secured funding to develop over 300 units of elderly housing and 19 handicapped-accessible units."
    },
    {
      "website url": "http://www.chautauquaopportunities.com",
      "phone no.": "(716) 366-3333",
      "contact person": "ROBERTA KELLER",
      "title": "Chautauqua Opportunities Inc.",
      "service area": "CHAUTAUQUA COUNTY, EXCLUDING CITY OF JAMESTOWN",
      "address": "17 W COURTNEY ST DUNKIRK, NY 14048",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=276",
      "email": "dfricke@chautopp.org",
      "description": "Chautauqua Opportunities, Inc. (COI) is a community action agency and community development corporation serving Chautauqua County, which is located in the southwest corner of New York State.  COI  was incorporated in 1965 under the auspices of the Economic Opportunity Act of 1964.  The agency has a broad mandate to design and implement programs to address local needs and concerns and serves approximately 20,000 persons each year with an annual budget of $12,000,000.00.  COI offers 50 programs grouped into the following departments:  Housing & Community Services, Economic Development, Health Services, Early Childhood and Youth Services, Organizational Development and Planning and a Core Services component.  Major programs include:  Head Start, WIC, HUD Section 8 rental assistance, Weatherization, HEAP, Homeless Prevention Services, Runaway Youth Shelter (Safe House), Housing Preservation Services, Kids At Home, HUD Housing Counseling Services, Transitional Housing, a small business incubator and a  Micro-Enterprise Loan Fund offering assistance to low-income entrepreneurs.  COI  has adopted the following mission statement: \"COI....Leading the fight against poverty by mobilizing resources and creating partnerships designed to promote empowerment, economic independence and opportunities.  COI....More than promises.\""
    },
    {
      "website url": "http://www.clayton-improvement.com",
      "phone no.": "(315) 686-3212",
      "contact person": "KRISTI P. DIPPEL",
      "title": "Clayton Improvement Association Ltd.",
      "service area": "JEFFERSON COUNTY TOWNS OF ALEXANDRIA, ANTWERP, CAPE VINCENT, CLAYTON, LERAY, ORLEANS, PAMELIA, PHILADELPHIA, TERESA, AND WILNA - 1000 ISLANDS AREA",
      "address": "99 913 STRAWBERRY LN CLAYTON, NY 13624",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=278",
      "email": "kristi@clayton-improvement.com",
      "description": "The Clayton Improvement Association, LTD. (CIA, LTD.) is a Rural Preservation Company based in Clayton serving 10 townships in Northern Jefferson County: Alexandria, Antwerp, Cape Vincent, Clayton, LeRay, Orleans, Pamelia, Philadelphia, Teresa and Wilna.  The CIA LTD. is a community service organization founded for the purpose of improving the viability and vitality of its service area.  The Association's primary goals are:"
    },
    {
      "website url": "",
      "phone no.": "(607) 962-3506",
      "contact person": "JULIE CHEVALIER",
      "title": "Community Progress Inc.",
      "service area": "CHEMUNG, SCHUYLER, SOUTHEASTERN STEUBEN COUNTIES",
      "address": "147 E 2ND ST CORNING, NY 14830",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=280",
      "email": "jachevalier@stny.rr.com",
      "description": "Since 1970, Community Progress, Inc. has been providing critical housing assistance to owner-occupied homes throughout Chemung, Schuyler and Southeastern Steuben Counties.  Local Program partners include, but are not limited to the following: The City of Corning Planning Department, Schuyler County Planning Department, Schuyler County Cornell Cooperative Extension, Arbor Development (formerly - Steuben Churchpeople Against Poverty), Tri-County Housing, Bishop Sheen Ecumenical Housing, Economic Opportunity Program (EOP) of Chemung County, Pro Action of Steuben County, Offices for the Aging in Chemung and Scuyler Counties, U.S.D.A, and the United Way of the Southern Tier."
    },
    {
      "website url": "http://www.cortlandhousing.org",
      "phone no.": "(607) 753-8271",
      "contact person": "GARY L. THOMAS",
      "title": "Cortland Housing Assistance Council Inc.",
      "service area": "CORTLAND COUNTY",
      "address": "36 TAYLOR ST CORTLAND, NY 13045",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=284",
      "email": "gthomas@cortlandhousing.org",
      "description": "The Cortland Housing Assistance Council (CHAC), Inc. is a not-for-profit Rural Preservation Company which addresses and monitors the housing needs of Cortland County.  The agency provides home improvement assistance to eligible applicants by utilizing funding under the Cortland County Area Agency on Aging's Handyman Program, Ramp Program and Weatherization Referral Assistance Program.  Housing assessments are conducted; work write-ups and estimates created;  and work performed by CHAC, Inc. or contracted out.  Moderate rehab assistance is provided to income eligible homeowners under the HOME Program in the form of a no-interest, deferred payment loan.  First time home buyers receive moderate rehab assistance under the NYS AHC Program.  This program offers funds for closing costs as well as rehab after purchase.  CHAC, Inc.  also owns and manages 50 units of affordable housing within the City of Cortland.  As a HUD approved housing counseling agency CHAC, Inc.  counsels clients about owner-occupied housing issues.  These services include, but are not limited to, pre- and post-purchase counseling,  mortgage default, energy conservation, money management and home equity conversion mortgages."
    },
    {
      "website url": "",
      "phone no.": "(585) 973-3900",
      "contact person": "LISA R. TROWBRIDGE",
      "title": "Cuba Community Development Corporation",
      "service area": "TOWNS OF BELFAST, CLARKSVILLE, CUBA, FRIENDSHIP, NEW HUDSON",
      "address": "194 FRIENDSHIP, NY 14739",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=285",
      "email": "cubacom@verizon.net",
      "description": "Cuba Community Development Corporation (CCDC) is a 501(c)(3) corporation established in 1981 for the purpose of improving housing conditions for low income homeowners throughout its five-town service area in Allegany County, NY, which includes the Towns of Cuba, Belfast, Friendship, Clarksville and New Hudson.  We are a Rural Preservation Company (RPC) and apply for and receive grants from a variety of state and federal sources including, the HOME program, RESTORE program, CDBG grants, and Affordable Housing Corporation (AHC) funds. These funds are then used to provide 100% grants to eligible homeowners for needed repairs to their sub-standard homes, thereby addressing health and safety issues and energy-efficiency problems. This then enables the homeowners to improve their quality of life and in many cases, retain occupancy of their homes. CCDC operates with a full-time staff of three persons:  an executive director, an administrative assistant, and a rehab specialist.  Over the course of a typical fiscal year, we administer in excess of $1M in funds to make repairs to more than 180 housing units and to assist over 470 persons."
    },
    {
      "website url": "http://www.delawareopportunities.org",
      "phone no.": "(607) 746-1600",
      "contact person": "JOHN M. EBERHARD",
      "title": "Delaware Opportunities Inc.",
      "service area": "DELAWARE COUNTY",
      "address": "35430 STATE HIGHWAY 10 HAMDEN, NY 13782",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=286",
      "email": "housing@delawareopportunities.org",
      "description": "Delaware Opportunities Inc. is a multi-service not-for-profit corporation serving all of Delaware County.  Services range from assisting pregnant women with adequate nutrition (WIC) to Head Start, to Senior Dining.  Within the range of services are the following which specifically relate to housing and community renewal: 1) HEAP outreach and application preparation; 2) Weatherization; 3) FEMA emergency housing assistance; 4) Homeownership Counseling; 5) Rental Assistance; 6) Needs Assessment Planning and Grant Development; 7) housing rehabilitation; 8) downtown revitalization;  9) Domestic Violence Shelter and services; 10) Foster Homes; 11) Homeless Intervention and Prevention"
    },
    {
      "website url": "",
      "phone no.": "(518) 483-5934",
      "contact person": "EILEEN GILLEN",
      "title": "Franklin County Community Housing Council, Inc.",
      "service area": "FRANKLIN COUNTY EXCEPT ST. REGIS INDIAN RESERVATION",
      "address": "337 W MAIN ST MALONE, NY 12953",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=289",
      "email": "fcchc1@yahoo.com",
      "description": "The Franklin County Community Housing Council Inc. was established in l980 and began activities in all housing areas related to low and moderate income families/individuals in Franklin County.  We are the Local Administrator for the Housing Choice Voucher Rental Assistance and Homebuyers Program.  We also have a First Time Homebuyers Program funded under HOME.  FCCHC is a certified HUD Counseling Agency that provides counseling for Mortgage default, credit problems and all areas of housing needs.  Other Programs that the agency administers are:  Continuum of Care - help for the homeless in finding and leasing affordable units and in depth case management, property maintenance seminars, Home Buyer Education Classes to qualify for different programs.  We also act as the facilitator for the local unit of the Salvation Army."
    },
    {
      "website url": "",
      "phone no.": "(518) 834-9606",
      "contact person": "SCOTT CAMPBELL",
      "title": "Friends Of The North Country, Inc.",
      "service area": "TOWN CHESTERFIELD/AUSABLE/JAY/BLACK BROOK/VIL. KEESEVILLE",
      "address": "446 1 MILL ST KEESEVILLE, NY 12944",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=290",
      "email": "scampbell@friendsofthenorthcountry.org",
      "description": "Friends of the North Country, Inc. (formerly Friends of Keeseville) was incorporated in 1981. Friends four point mission is to assist with the provision of decent, affordable housing with emphasis on the needs of the poor, to undertake economic development that supports community revitalization, to identify and save historic structures, and to generally act as facilitators in the process of stabilization, growth and development.  Friends assists local governments and organizations in implementing their plans for community revitalization. Friends provides technical assistance across a wide range of functional areas including housing rehabilitation/development, economic development, infrastructure improvement, and historic preservation intended to stabilize and revitalize communities throughout the North Country and the Adirondack region. Friends is a HUD certified housing counseling agency offering housing counseling services including but not limited to pre- and post-purchase counseling, foreclosure prevention, budgeting, and household maintenance."
    },
    {
      "website url": "",
      "phone no.": "(315) 639-3940",
      "contact person": "JILL E. EVANS",
      "title": "Frontier Housing Corporation",
      "service area": "TOWN OF BROWNVILLE",
      "address": "56 321 LAKEVIEW DR DEXTER, NY 13634",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=291",
      "email": "frontierhousing@centralny.twcbc.com",
      "description": "Frontier Housing Corporation was established in 1975 for the following purposes:  to acquire, construct, maintain and/or operate low to moderate income housing and related facilities suited to the special needs and living requirements of those having low to moderate incomes and needing living facilities, without regard to race, color, creed or natural origin; to promote, advance and stimulate civic, business, commercial, industrial and agricultural interest and the general welfare of and in the Town of Brownville, including the Villages of Dexter, Brownville, and Glen Park; to plan, promote, develop, construct, operate and maintain new or improved public facilities of all types; to develop new housing, rehabilitate existing stock, and/or manage housing stock including renting and/or selling such units to provide decent housing that is affordable to low and moderate income persons; and to encourage, foster and stimulate trade, tourism, business and professional interest in the Town of Brownville. Thus far, Frontier has developed and manages 62 units of low-income rental housing in the Village of Dexter; has provided assistance for the rehabilitation of 40 homes in the Town of Brownville; has provided down payment assistance to 10 families for the purchase of new modular homes; has developed and manages the Dexter Industrial Center, which houses four businesses employing over 120 people; and has assisted the Town of Brownville and its Villages with applying for and securing funds for infrastructure improvements, recreational improvements, and other community development projects."
    },
    {
      "website url": "http://www.gvrpc.com",
      "phone no.": "(585) 658-4860",
      "contact person": "JILL A. ALCORN",
      "title": "Genesee Valley Rural Preservation Council, Inc.",
      "service area": "LIVINGSTON COUNTY, WYOMING CO.",
      "address": "5861 GROVELAND STATION RD MT. MORRIS, NY 14510",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=292",
      "email": "jalcorn@gvrpc.com",
      "description": "Genesee Valley Rural Preservation Council, Inc. (GVRPC) was formed in 1982 to improve the housing stock and provide housing for very low to moderate income people in a two county service area of New York State.  GVRPC has worked extensively in the areas of multi-family housing as developer, owner and manager and now owns and manages over 300 units in Western New York.  In addition, the organization assists other organizations and municipalities with project specific development and community improvement. GVRPC also provides housing and services for special needs populations, including the disabled, elderly and homeless families."
    },
    {
      "website url": "http://www.hapec.org",
      "phone no.": "(518) 873-6888",
      "contact person": "ALAN S. HIPPS",
      "title": "Housing Assistance Program Of Essex County, Inc.",
      "service area": "ESSEX COUNTY",
      "address": "157 103 HAND AVE ELIZABETHTOWN, NY 12932",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=294",
      "email": "alan@hapec.org",
      "description": "The Housing Assistance Program of Essex County, Inc. (HAPEC) was founded in 1976 with the mission of recognizing community development and housing needs, advocating change, and responding to opportunities.  HAPEC's efforts to respond to this challenge encompasses a broad array of housing services including: rehabilitating over 1,300 homes occupied by lower-income families; administering 580 units of subsidized rental housing; constructing dozens of new homes; and developing numerous multi-family rental properties throughout Essex County.  HAPEC has a 15 person staff, an administrative budget of over $750,000, and a program budget of over $4,000,000.  During the past state fiscal year, the corporation performed the following RPC activities: owner-occupied housing assistance, community preservation and renewal, and tenant housing assistance."
    },
    {
      "website url": "",
      "phone no.": "(518) 822-0707",
      "contact person": "STEPHANIE LANE",
      "title": "Housing Resources Of Columbia County, Inc.",
      "service area": "COLUMBIA COUNTY",
      "address": "252 COLUMBIA ST HUDSON, NY 12534",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=296",
      "email": "slane@housingresources.org",
      "description": "Housing Resources of Columbia County, Inc. (HRCC) is a private not-for-profit organization that has been assisting low to moderate-income residents of Columbia County with their housing needs since 1984. Housing Resources of Columbia County was first organized as Hudson Housing Services Corp. by a group of concerned residents and the Neighborhood Reinvestment Corp. in 1983-84 to serve the City of Hudson. The agency expanded to a county wide service area in 1995, and Housing Resources of Columbia County, Inc. was chartered as a Neighbor Works Organization in 1996. HRCC is also affiliated with the New York State Division of Housing and Community Renewal's (DHCR) Rural Preservation Program. As the Rural Preservation Company for Columbia County, Housing Resources contracts with DHCR to address the housing needs of the county's low-income populations. The agency is also certified as a Community Housing Development Organization (CHDO) with DHCR. Housing Resources joined the Neighbor Works Campaign for Home Ownership in February 1997 and was certified as a Neighbor Works Full-Cycle Lender in May 1998.  In April 2000, Housing Resources received its most recent certification as a \"Community Development Financial Institution (CDFI) with the U.S. Department of Treasury. The agency offers a variety of housing related services including home ownership assistance, affordable apartment rentals, home improvement grant and loan programs, and residential and mixed-use commercial real estate development. In recent years, the agency's main focus has been the promotion of home ownership opportunities for low and moderate income residents of Columbia County. Housing Resources of Columbia County, Inc. is committed to improving housing conditions and increasing housing choice throughout Columbia County."
    },
    {
      "website url": "http://www.keukahousingcouncil.org",
      "phone no.": "(315) 536-8707",
      "contact person": "RENEE BLOOM",
      "title": "Keuka Housing Council, Inc.",
      "service area": "YATES COUNTY",
      "address": "160 MAIN ST PENN YAN, NY 14527",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=297",
      "email": "reneebloom@keukahousing.org",
      "description": "Keuka Housing Council, Inc. (KHC) continues to work on increasing the quanity and quality of affordable housing in Yates County.  This includes rental and owner-occupied property, with special  attention given to the unique needs of low -income residents.  KHC strives to increase public awareness of housing needs and works with government and private housing interests to create opportunities to address such needs.  KHC provides information and technical  assistance to groups and individuals interested in improving the supply and condition of housing.  KHC receives and manages funds for the construction and rehabilitation of housing.  KHC advocates for the development of and enforcement of proper land use regulations, building codes, and policies that will encourage the development of safe, quality housing. KHC currently operates First-Time Homebuyer programs for Yates County.  KHC provides home improvement programs for existing low-income home owners. The Council will continue its efforts to apply for funds to assist the low-income population of Yates County.  The funds will come from NYS Affordable Housing Program, NYS  Housing Trust Fund, HUD-CDBG, HOME Program, HHAP, Daisy Marquis Jones Foundation, and the private sector."
    },
    {
      "website url": "http://markproject.org",
      "phone no.": "(845) 586-3500",
      "contact person": "PEG ELLSWORTH",
      "title": "M-Ark Project, Inc.",
      "service area": "DELAWARE COUNTY. TOWNS: MIDDLETOWN, ROXBURY. VILLAGES: MARGARETVILLE, FLEISCHMANNS, ARKVILLE",
      "address": "516 ARKVILLE, NY 12406",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=298",
      "email": "peg@markproject.org",
      "description": "The M-ARK Project is a private, not-for-profit 501 (c) (3) social and economic development agency that serves as a Rural Preservation Company for the Townships of Middletown and Roxbury and the Villages of Fleischmanns,  Arkville and Margaretville. It has served the community since 1978 and was incorporated in 1983. (NYS Charity # 03-27-73) M-ARK's mission is to unite efforts and secure resources to build and revitalize our communities."
    },
    {
      "website url": "http://www.niagaracap.org",
      "phone no.": "(716) 285-9681",
      "contact person": "SUZANNE C. SHEARS",
      "title": "Niagara Community Action Program, Inc.",
      "service area": "NIAGARA COUNTY, EXCLUDING CITIES",
      "address": "1521 MAIN ST NIAGARA FALLS, NY 14305",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=301",
      "email": "sshears@prodigy.net",
      "description": "Niagara Community Action Program, Inc. (Niagara CAP) is a private, not-for-profit charitable organization that provides programs and services to the needy and disadvantaged population of Niagara County.  Niagara CAP is a community action agency that receives both federal and state grant funds on a county-wide basis.  Programs and services include home repair, new home construction, food pantries, clothes closets, budget counseling, weatherization, fair housing, food stamp application, child care referrals, child care training, and a play lending center for children with disabilities."
    },
    {
      "website url": "http://www.northcountryaffordablehousing.com",
      "phone no.": "(315) 785-8684",
      "contact person": "GARY BEASLEY",
      "title": "North Country Affordable Housing, Inc.",
      "service area": "FORT DRUM IMPACT AREA OF JEFFERSON, ST. LAWRENCE AND LEWIS COUNTIES",
      "address": "118 FRANKLIN ST WATERTOWN, NY 13601",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=302",
      "email": "gary@northcountryaffordablehousing.com",
      "description": "North Country Affordable Housing, Inc. provides home ownership assistance through its Mobile Home Replacement/ New Construction Program, home accessibility modifications for the disabled or elderly, and owner occupied housing rehabilitation. In addition the Corporation owns and manages two 32-unit apartment complexes."
    },
    {
      "website url": "http://www.mvcaa.com",
      "phone no.": "(315) 624-9930",
      "contact person": "RALUCA STEINBACH",
      "title": "Mohawk Valley Community Action Agency, Inc.",
      "service area": "HERKIMER/ONEIDA COS. EXCLUDE UTICA/ROME/NEWHARTFORD/KIRKLAND",
      "address": "9882 RIVER RD UTICA, NY 13502",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=304",
      "email": "rsteinbach@mvcaa.com",
      "description": "Mohawk Valley Community Action Agency, Inc. (MVCAA)  is a private, non-profit agency that provides a range of human services programs to low income families in Oneida and Herkimer Counties.  MVCAA received its charter in 1966 and expanded its service area to include Herkimer County in 1987.  The agency serves approximately 10,000 families and individuals annually across the two-county region.  Services are provided through four divisions:  Child Development; Family Resource; Housing; and Youth Services.  The Child Development Division operates a HeadStart Program with 12 locations and serving  450 families as well as a childcare center.  The Family Resource Division administers emergency assistance and foster Grandparent. The Housing Division oversees the Rural Preservation, Weatherization Assistance, and HUD Section 8 Rental Assistance Programs. The Youth Services Division operates a Runaway and Homeless Youth Program, and this year launched a very successful teen internet site for youth to ask questions and share information."
    },
    {
      "website url": "",
      "phone no.": "(315) 625-4520",
      "contact person": "MARION A. NARAMORE",
      "title": "Oswego Housing Development Council, Inc.",
      "service area": "OSWEGO COUNTY",
      "address": "147 2944 E MAIN ST PARISH, NY 13131",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=306",
      "email": "oswegohousingdevelopmentcouncil@yahoo.com",
      "description": "The Oswego Housing Development Council, Inc. (OHDC) was incorporated in 1979 as a private not-for-profit corporation for the purpose of providing for and encouraging the development of a broad range of housing resources for persons of very low to moderate income in Oswego County.  OHDC seeks to meet the housing needs of Oswego County by developing, building, and/or renovating local housing, acting as an administrator or manager of affordable housing, and forging partnerships with social service provider, contractors, local lenders, real estate professionals, and local government.  OHDC currently provides a comprehensive housing program including:  housing management, home ownership counseling from pre-purchase to mortgage default, program assistance to other organizations, and housing development activities.  The Council has been recognized by HUD as a certified housing counseling agency since. 1997 and provides all aspects of the HUD Counseling Program. The Council has a Memorandum of Understanding with USDA Rural Development to package 502 and 504 loan applications.  During the last program year, OHDC helped 10 families purchase homes in Oswego County bringing to over 166 families assisted in securing housing and leveraging approximately 8.96 million in federal, state, and private funds.  During this program year OHDC administered the following programs:  HOME Mortgage Assistance Program for first time home buyers and Owner Occupied Rehabilitation Program, Affordable Housing Corporation Acquisition / Rehabilitation  / Resale Program, Affordable Housing Owner Occupied Rehabilitation Program and Access to Home Program. During the current program year the Council also began working with the Villages of Mexico and  Pulaski on their Main Street programs.  Additionally the Council manages a 20 unit 515 project, Creekside Apartments located in Sandy Creek and owns a small mixed use residential/ commercial building located in Redfield that has 6 units and the Post Office."
    },
    {
      "website url": "",
      "phone no.": "(607) 286-7244",
      "contact person": "ANTHONY J. SCALICI",
      "title": "Otsego Rural Housing Assistance, Inc.",
      "service area": "OTSEGO COUNTY",
      "address": "189 50 W. MAIN ST MILFORD, NY 13807",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=307",
      "email": "orha2@stny.rr.com",
      "description": "Otsego Rural Housing Assistance, Inc. is the sole housing preservation company in Otsego County. As such, the major focus of its housing assistance and community development work is directed toward county-wide programs and initiatives. Four ongoing types of capital programs have remained consistent over the past ten years - Home Buyer Purchase and Purchase with Rehabilitation Grant Assistance, Accessibility and Independent Living Rehabilitation, Targeted area Owner Occupied Home Rehabilitation, and emergency repairs for elderly low income homeowners. A second form of county-wide service is the organization's ongoing relationship with the County of Otsego. In this capacity, the preservation company carries out grant writing and administration of the municipality's HUD/CDBG initiatives and provides housing consultation and work specification writing of disability modifications for Public Nursing/Medicaid households. A third county-wide program is administration of a HUD Section 8 rental assistance program through a contract with DHCR. Lastly, consultation services for individuals regarding home buying, tenant/landlord dispute, home construction and rehabilitation planning, and development entrepreneurship are available. Management of revolving loans, oversight of low-income housing management, HUD/CDBG grant writing and administration, and development planning are also made available to towns, villages, and organizations in the county."
    },
    {
      "website url": "http://www.putnamhousing.com",
      "phone no.": "(845) 225-8493",
      "contact person": "not listed",
      "title": "Putnam County Housing Corp.",
      "service area": "PUTNAM COUNTY, EXCLUDING TOWN OF CARMEL",
      "address": "11 SEMINARY HILL RD CARMEL, NY 10512",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=311",
      "email": "puthousing@aol.com",
      "description": "Putnam County Housing Corporation (PCHC)  was founded in 1982 to fulfill a mission to provide safe, decent, and affordable housing  for every Putnam County resident. PCHC's services include: management and construction of affordable, transitional, and homeless housing; HUD Section 8 Rental Subsidy Program for 460 units; HUD designated Housing Counseling agency assisting residents with reverse mortgages, foreclosure, eviction prevention, home improvement, rehabilitation, pre-purchase, and pre-rental; Rural Homeownership Assistance Program; administers First Home Club in conjunction with Mahopac National Bank; administering $200, 000 Home Improvement Program to assist approximately 30 homeowners with repairs; RESTORE program; housing rehab; administers Welcome Home, providing housewares and furniture to low income families from community donations; administers Family Self-Sufficiency Program to assist Section 8 participants in becoming self-sufficient; administers Rescue providing \"financial safety net\" for renters and homeowners in the form of cash assistance."
    },
    {
      "website url": "http://www.triponline.org",
      "phone no.": "(518) 272-8289",
      "contact person": "GAIL D. PADALINO",
      "title": "Rensselaer County Housing Resources",
      "service area": "RENSSELAER COUNTY, EXCLUDING TROY",
      "address": "415 RIVER ST TROY, NY 12180",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=313",
      "email": "gail@triponline.org",
      "description": "Rensselaer County Community Housing Resource Board is a community-based, not-for-profit affordable housing agency serving Rensselaer County.  Currently, the organization offers the following programs: pre-purchase and default counseling, down-payment and closing cost assistance, minor home repair, and individual development accounts."
    },
    {
      "website url": "",
      "phone no.": "(845) 794-0348",
      "contact person": "SHARI TRUST",
      "title": "Rural Sullivan Housing Corporation",
      "service area": "SULLIVAN COUNTY",
      "address": "1497 33 LAKEWOOD AVE MONTICELLO, NY 12701",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=317",
      "email": "ruralsullivanhousing@hvc.rr.com",
      "description": "Rural Sullivan Housing Corporation was established in 1981 to preserve and improve housing opportunities for low- to moderate-income residents of Sullivan County. The company's activities include: development of new housing, rehabilitation of existing housing, property management, and assistance to households applying for available loans and grant funds.  Rural Sullivan also runs a comprehensive housing counseling program which assists persons through home ownership counseling, loan default remediation, and tenant/landlord issues."
    },
    {
      "website url": "http://www.rupco.org",
      "phone no.": "(845) 331-2140",
      "contact person": "KEVIN O'CONNOR",
      "title": "Rupco, Inc.",
      "service area": "ULSTER COUNTY",
      "address": "289 FAIR ST KINGSTON, NY 12401",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=318",
      "email": "koconnor@rupco.org",
      "description": "Rural Ulster Preservation Company, Inc. (RUPCO)  was organized in 1981 for the purpose of creating housing opportunities fo low and moderate income households in Ulster County.  RUPCO has responded to the housing needs in the community by providing an array of services, programs, and projects such as rental assistance, rehabilitation, counseling,  homeownership, first-home club, new construction, housing management, and HIV/AIDS support."
    },
    {
      "website url": "http://www.vethome.org",
      "phone no.": "(518) 885-0091",
      "contact person": "CHERYL HAGE-PEREZ",
      "title": "Saratoga County Rural Preservation Co.",
      "service area": "SARATOGA CO., EXCLUDING CITY OF SARATOGA & CLIFTON PARK",
      "address": "563 1214 SARATOGA RD BALLSTON SPA, NY 12020",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=319",
      "email": "ceo@saratogarpc.org",
      "description": "The Saratoga County Rural Preservation company was designated a 501(c)(3) and began its first day of operation in January 1983.  Its mission is to maintain, improve, rehabilitate, and develop affordable housing in Saratoga County.  A further mission is to provide sober, safe and supportive housing in both our transitional facility and permanent housing."
    },
    {
      "website url": "",
      "phone no.": "(518) 234-7604",
      "contact person": "RONALD S. FILMER, JR.",
      "title": "Schoharie County Rural Preservation Corp.",
      "service area": "SCHOHARIE CTY., EXCL. TOWNS OF GILBOA, CONEVILLE, JEFFERSON",
      "address": "349 MINERAL SPRINGS RD COBLESKILL, NY 12043",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=320",
      "email": "rfscrpc@nycap.rr.com",
      "description": "Schoharie County Rural Preservation Corp. (SCRPC) is a private non-profit organized as a 501c3 corporation.  SCRPC has concentrated on providing housing services to households with an income range of very low to moderate.  These housing services include technical assistance for individuals seeking home mortgages, home financial assistance, rental assistance, homeowner repairs, etc.  In addition to helping area residents with housing questions and homeownership issues, SCRPC also administers a 165-unit,  Section 8 rental subsidy program, manages two Rural Development senior housing sites (24 units each), and owns a four unit rental dwelling."
    },
    {
      "website url": "http://www.seppinc.com",
      "phone no.": "(607) 723-8989",
      "contact person": "ANNE KINNEY",
      "title": "Sepp, Inc.",
      "service area": "BROOME COUNTY, RURAL TOWNS AND VILLAGES",
      "address": "53 FRONT ST BINGHAMTON, NY 13905",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=321",
      "email": "akinney@seppinc.com",
      "description": "SEPP, Inc.'s mission is to provide elderly persons and handicapped persons with low-income housing facilities and services designed to meet their physical, social and psychological needs and to promote their health, security and happiness.  To accomplish this goal, SEPP currently owns seven low-income elderly housing facilities, four of which are located in SEPP's Rural Preservation Program Service Area.  SEPP offers many services such as assistance with HEAP and Food Stamp applications as well as seminars on elderly health-related issues and referrals for housing and services availability in Broome County."
    },
    {
      "website url": "http://www.snowbelt.org",
      "phone no.": "(315) 376-2639",
      "contact person": "CHERYL L. SHENKLE-O'NEILL",
      "title": "Snow Belt Housing Company, Inc.",
      "service area": "LEWIS COUNTY",
      "address": "7500 S STATE ST LOWVILLE, NY 13367",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=322",
      "email": "cheryl@snowbelt.org",
      "description": "Snow Belt Housing Company, Inc. is a not-for-profit company founded in 1982 to provide safe, decent, and affordable housing for low to moderate income families throughout Lewis County. Funding comes primarily from federal sources in the form of CDBG and HOME dollars.  Snow Belt provides a full range of housing services including management of rental properties, loan/grant packaging for homeowners for rehabilitation, first-time homebuyer programs, and program assistance to municipalities throughout Lewis County.  Currently, fifty rehabilitation projects have been completed or are in progress totaling almost $875,000. Fifteen first time homebuyer grants totaling $297,400  have been awarded, and 46 rental housing units are being managed.  Six grant applications were submitted and approved for funding in the year 2000, totaling $1.3 million."
    },
    {
      "website url": "http://www.southernhillspc.org",
      "phone no.": "(315) 677-3863",
      "contact person": "BARBARA A. LOCKE",
      "title": "Southern Hills Preservation Corp.",
      "service area": "SOUTHERN ONONDAGA COUNTY TOWNS OF: FABIUS; LAFAYETTE; MARCELLUS; OTISCO; POMPEY; SKANEATELES; SPAFFORD; AND TULLY",
      "address": "2383 ROUTE 11 SOUTH LAFAYETTE, NY 13084",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=323",
      "email": "blocke@southernhillspc.org",
      "description": "The Southern Hills Preservation Corporation (SHPC) was founded in 1986 by local residents of southern Onondaga County who were concerned about the area's lack of resources for affordable housing and community development. The overall mission of  SHPC is to promote affordable housing, community revitalization, and economic development by means of construction and rehabilitation, lending, counseling, education, and advocacy. The organization focuses on meeting the needs of low-income homeowners; meeting the needs of low-income tenants and assisting first-time home buyers. These goals are achieved by such programs and projects as the Home Improvement Program that provides grants to home owners for necessary repairs and rehab; a Revolving Loan Fund that lends money at low-interest to home owners for repairs and to tenants for security deposits; constructing and managing subsidized apartments for the low-income elderly and disabled and offering classes and individual counseling to potential home buyers. Funding for these programs comes from a mix of state, federal, local, and private sources. A staff of four full-time employees operates out of offices in the Town of LaFayette, NY. An additional two full-time and one part-time staff members are located in the apartments in the Village of Tully and the Village of Marcellus."
    },
    {
      "website url": "",
      "phone no.": "(716) 941-5787",
      "contact person": "KAREN M. DIEMUNSCH",
      "title": "Southtowns Rural Preservation Company, Inc.",
      "service area": "SOUTH ERIE COUNTY",
      "address": "153 9441 BOSTON STATE RD BOSTON, NY 14025",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=324",
      "email": "southtownsrpc@aol.com",
      "description": "Southtowns Rural Preservation Company, Inc. is a local, non-profit community development corporation serving the rural towns and villages of Southern Erie County.  The SRPC has established a core of basic services available to eligible residents within the service area.  These services include loan and grant application assistance, housing rehabilitation, and housing counseling and referral services. The long term goals of the corporation are to effect a stabilizing influence in the communities served through the rehabilitation of individual housing units and the coordination and/or delivery of supporting services."
    },
    {
      "website url": "http://www.nocohousing.org",
      "phone no.": "(315) 386-8576",
      "contact person": "ALAN S. HIPPS",
      "title": "St Lawrence County Housing Council, Inc.",
      "service area": "ST. LAWRENCE COUNTY",
      "address": "19 MAIN ST CANTON, NY 13617",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=325",
      "email": "ahipps@slchc.org",
      "description": "The St. Lawrence County Housing Council, Inc. (SLCHC) serves St. Lawrence County, New York, a rural county the size of the state of Delaware with a population of approximately 111,000 that has one of the lowest median incomes in New York State.  Incorporated in 1981, SLCHC, as part of the Rural Preservation Program, has brought grants in excess of $41 million to bear on housing and revitalization needs.  In August of 1999, SLCHC became a chartered member of the NeighborWorks Network."
    },
    {
      "website url": "http://www.stoneleighhousing.com",
      "phone no.": "(315) 697-3737",
      "contact person": "ROBERT NAPOLI",
      "title": "Stoneleigh Housing, Inc.",
      "service area": "MADISON COUNTY",
      "address": "120 E CENTER ST CANASTOTA, NY 13032",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=326",
      "email": "ston@twcny.rr.com",
      "description": "Stoneleigh Housing, Inc. is a private, not -for-profit corporation. Stoneleigh was incorporated in 1978 for the purpose of providing decent and safe housing to low income families and individuals in Madison County in coordination with services specifically designed to meet the physical, social, and physiological needs of these families and individuals. Stoneleigh Housing continues the operation of an Enriched Housing program serving over 45 frail elderly county residents. The program allows frail elderly residents to remain in their homes at a minimum cost. Stoneleigh continues its ongoing program of housing rehab assistance to low income county residents using CDBG, HOME, WAP and RESTORE funds."
    },
    {
      "website url": "",
      "phone no.": "(845) 297-2004",
      "contact person": "MARGARET T. O'LEARY",
      "title": "Community Services Programs Inc.",
      "service area": "SOUTHERN DUTCHESS COUNTY",
      "address": "5 GIVANS AVE NE WAPPINGERS FALLS, NY 12590",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=328",
      "email": "csphvhdfinc@aol.com",
      "description": "Community Services Programs, Inc. has celebrated its 30th year of service to the Dutchess County Community and its 21st year as a Rural Preservation Company. Since its initial designation in the Rural Preservation Program, Community Services Programs, Inc. has secured $55 million dollars of funding and financing from both public and private sources. The organization's most recent accomplishment is the development of a 52 unit senior citizen complex, financed as a standalone NYS Low Income housing project (SLIC)."
    },
    {
      "website url": "http://www.westerncatskills.org",
      "phone no.": "(607) 652-2823",
      "contact person": "VELGA KUNDZINS",
      "title": "Western Catskills Community Revitalization Council, Inc.",
      "service area": "EASTERN DELAWARE, WESTERN GREENE & SOUTHERN SCHOHARIE COUNTIES",
      "address": "125 MAIN ST STAMFORD, NY 12167",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=330",
      "email": "info@westerncatskills.org",
      "description": "Western Catskills Community Revitalization Council, Inc. was founded in 1981 and has concentrated its efforts on the creation of new housing and the improvement of existing housing and mixed use commercial buildings. Western Catskills targets housing programs that will best serve the needs of the low and moderate income residents of their service area. Toward that end, Western Catskills has developed, owns, and manages two 24 unit low/moderate-income senior housing projects, one in the Hamlet of Grand Gorge and one in the Village of Stamford. Western Catskills administers grants to first-time home buyers through the Affordable Housing and HOME Programs to assist families with the purchase of their first homes and grant funds to assist low/mod income families with much needed repairs and renovations to their homes with funding provided by The New York State Affordable Housing Corporation, The New York State Housing Trust Fund Corporation (HOME), and the CDBG program. Western Catskills has provided assistance to various townships, villages, and hamlets with water and sewer projects, storm water control projects, and applications for funding from local foundations and government agencies. Western Catskills administers Main Street programs which revitalize the Main Streets in hamlets and villages in an effort to create economic development opportunities."
    },
    {
      "website url": "http://www.tiogaopp.org",
      "phone no.": "(607) 687-0707",
      "contact person": "JOHN CHANECKA",
      "title": "Tioga Opportunities, Inc.",
      "service area": "TIOGA COUNTY",
      "address": "9 SHELDON GUILE BLVD OWEGO, NY 13827",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=354",
      "email": "jchanecka@tiogaopp.org",
      "description": "Tioga Opportunities, Inc. is a Community Action Agency that provides a multitude of services to Tioga County, New York. Administration, Aging Services, Community Services, Family Health Services, Head Start, and Housing Services are the components of the agency."
    },
    {
      "website url": "http://www.mohawkhousing.org",
      "phone no.": "(518) 358-4860",
      "contact person": "MARY JO J. TERRANCE",
      "title": "Mohawk Indian Housing Corp.",
      "service area": "ST REGIS INDIAN RES/ROOSEVELTOWN/MASSENA",
      "address": "402 ROOSEVELTOWN, NY 13683",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=361",
      "email": "mohawkhousing@yahoo.com",
      "description": "The Mohawk Indian Housing Corporation (MIHC ) was formed on 06/23/72.  In 1981 MIHC became a Rural Preservation Company.  Decent, sanitary, and safe rental housing construction was the priority.  A total of  24 units of apartments were completed under Rural Development 515 program.  A 5-year Master Plan was developed.  Indian Health Services provided funds through the St. Regis Mohawk Tribe to extend the waterline and construct a waste water treatment plant. The Rural Area Revitalization Program provided funds to lay a sewer main connecting all the projects to the new  waste water treatment plant.  A 30 unit rental program was sponsored by MIHC to construct a 202/Section 8 in 1889 for the elderly and handicapped.  An Enriched Housing Program was designed to complement the 202/Sec. 8 rental program by assisting residents with day-to-day care. Starting in 1985 to present, MIHC provides rental management and has 82 units under management.  From 1991 until present, a Summer Youth Program and an After School Tutor and Recreation program has been sponsored under the Community Services Block Grant.  The CSBG program funds a driver under the DOT Section 5310 Program for the elderly and handicapped transportation. The NYS-DHCR awarded a HOME award of $400,000 to enable 25 owner occupied renovations from 1997-99. The DHCR-RPP Incentive Award allowed our office to hire two part-time employees to assist with the many new programs that have been funded for this year."
    },
    {
      "website url": "",
      "phone no.": "(631) 477-1070",
      "contact person": "TANYA J. PALMORE",
      "title": "North Fork Housing Alliance, Inc.",
      "service area": "TOWNS OF GREENPORT AND SOUTHOLD",
      "address": "116 SOUTH ST GREENPORT, NY 11944",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=366",
      "email": "nfha@aol.com",
      "description": "The purpose of the North Fork Housing Alliance, Inc. is to assist low-income residents in acquiring affordable housing by operating programs that will combat gentrification and discrimination; continue rehabilitation and construction of low-cost housing; secure subsidies which could reduce shelter costs; increase the number of low-cost units for target population; utilize trainees in the rehabilitation program; provide decent, affordable housing specifically designed to meet the needs and requirements of low-income families; plan, construct, operate, maintain, and improve rental housing for low-income families; apply for, obtain, and contract with federal, state, and local government for loans or grants or other financial aid for the provision of housing for low-income families; and enter into joint ventures with individuals, groups, corporations, municipalities, and other agencies for the purpose of providing low-income housing."
    },
    {
      "website url": "http://www.arbordevelopment.org",
      "phone no.": "(607) 654-7487",
      "contact person": "JEFFREY E. EATON",
      "title": "Scap D/B/A Arbor Development",
      "service area": "STEUBEN COUNTY",
      "address": "26 BRIDGE ST CORNING, NY 14830",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=412",
      "email": "jeaton@arbordevelopment.org",
      "description": "Steuben Churchpeople Against Poverty (SCAP), now doing business as Arbor Development, has been providing housing services to low income residents of Steuben, Allegany and Livingston Counties for over 40 years. SCAP continues to serve low income homeowners with home improvement and moderate rehabilitation assistance and affordable rental units. This includes 32 units for elderly and handicapped in Hornell, NY. In addition, we continue to operate the domestic violence shelter and community residences for the mentally ill in Hornell, Corning and Bath, NY. Over the last several years we have expanded these services to include supported housing, including the homeless, and respite bed services for adults with mental illness and support services for those leaving the domestic violence shelter."
    },
    {
      "website url": "http://www.nwhomeresources.org",
      "phone no.": "(716) 373-4100",
      "contact person": "DAVID TRENT",
      "title": "Neighborworks Home Resources",
      "service area": "ALL CATTARAUGUS CO., SOUTHERN ERIE, SOUTHWESTERN WYOMING",
      "address": "209 NORTH UNION ST OLEAN, NY 14760",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=413",
      "email": "dgtrent@nwhomeresources.org",
      "description": "Rural Revitalization Corporation is a community-based not for profit dedicated to the mission of providing clean, safe, affordable housing for the residents of Cattaraugus County and the Towns of Collins, Concord, and Sardinia in Erie County and the Towns of Java and Arcade in Wyoming County. Rural Revitalization Corp. offers programs in home buyer education, homeownership counseling, affordable rental units, low-interest home rehabilitation loans, and mortgage assistance through a network of lenders and our Revolving Loan Fund."
    },
    {
      "website url": "",
      "phone no.": "(212) 234-4661",
      "contact person": "PATRICIA WILSON",
      "title": "Wilson Major Morris Community Center, Inc.",
      "service area": "HAMILTON HEIGHTS",
      "address": "459 W 152ND ST NEW YORK, NY 10031",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=415",
      "email": "wmmcc152@twcmetrobiz.com",
      "description": "The Wilson Major Morris Community Center (WMMCC) is a non-profit organization founded in 1970 to provide social and housing services for the residents of the Hamilton Heights and Community 9 & 12 Board Districts.  WMMCC, Inc. has 34 years of experience providing these  services to families, seniors and youth residents of Harlem.  WMMCC has provided congregate meals for senior citizens residents of Harlem and Northern Manhattan Neighborhoods for over 20 years; (16,000 meals were provided during the FY 2003 - 2004).  The Manhattan service catchment area for WMMCC is bound by West 155th Street to the North, West 133rd Street to the South, Edgecombe Avenue to the East and the Hudson River to the West.  WMMCC established a Neighborhood Preservation Program (NPP) in 1982, through funding support from the New York State Division of Housing and Community Renewal (DHCR).  The NPP is designed to stabilize, preserve and revitalize the housing, retail/commercial and community facilities in the Hamilton Heights Neighborhood.  It also provides assistance to community residents with housing and housing related problems including housing code enforcement, regulations and assistance with filling out applications for housing programs.  The NPP provides direct assistance to seniors with completing applications for the Senior-Citizen Rent Increase Exemption Program (SCRIE), the Home Energy Assistance Program (HEAP), the IT-214 and the  NYC - 210 applications.  WMMCC, Inc. works closely with owners of apartment buildings that house senior residents in the Hamilton Heights Neighborhood to provide the array of Housing Assistance, Repair & Rehabilitation Technical Assistance and Homeowners Assistance Services.  It also provides technical assistance to tenant associations through the HPD Tenant Interim Lease Program."
    },
    {
      "website url": "http://www.neighborsofwatertown.com",
      "phone no.": "(315) 782-8497",
      "contact person": "GARY BEASLEY",
      "title": "Neighbors Of Watertown, Inc.",
      "service area": "WATERTOWN",
      "address": "112 FRANKLIN ST WATERTOWN, NY 13601",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=428",
      "email": "gary@neighborsofwatertown.com",
      "description": "Neighbors of Watertown, Inc., is a not-for-profit corporation formed in 1967 to provide safe, decent affordable housing; to rehabilitate and return blighted property to productive use; and to aid others with similar purposes. Neighbors Of Watertown (NOWI), a Neighborhood Preservation Company since 1981, administers a wide array of housing and community development services throughout the City of Watertown."
    },
    {
      "website url": "",
      "phone no.": "(315) 475-8437",
      "contact person": "THOMAS A. FRANCIS",
      "title": "Syracuse Model Neighborhood Corporation",
      "service area": "SOUTHWEST SYRACUSE/BRIGHTON",
      "address": "1721 S SALINA ST SYRACUSE, NY 13205",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=430",
      "email": "tom@syracusemnc.org",
      "description": "Syracuse Model Neighborhood Corporation (SMNC) is a non-profit, non-sectarian partnership of Syracuse city government, private business, and Syracuse residents.  Our mission is to improve blighted neighborhoods in various ways, primarily by providing good housing affordable to low and middle-income people in the City of Syracuse.  We build new houses for sale to owner-occupants and restore deteriorated buildings to manage as rental units or sell to owner-occupants. SMNC owns and manages 326 rental units (127 buildings).  Over the next three years, (including NPP  contract year 2000), we plan to renovate 50 units.  Households below 50% of area median income will occupy all units. This project supports the City of Syracuse Consolidated Plan, by providing necessary affordable rental units in two of the city's designated Revitalization Areas. SMNC's goal is to preserve demographic diversity in our neighborhoods and foster self-sufficiency.  Additionally, we cooperate with other  neighborhood organizations and encourage resident-owned businesses that employ and serve neighborhood residents."
    },
    {
      "website url": "http://www.cashinc.org",
      "phone no.": "(315) 946-6992",
      "contact person": "EILEEN LUTZ",
      "title": "Community Action In Self-Help, Inc.",
      "service area": "WAYNE COUNTY, NORTHERN ONTARIO, TOWNSHIPS OF PHELPS AND MANCHESTER",
      "address": "48 WATER ST LYONS, NY 14489",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=441",
      "email": "elutz@rochester.rr.com",
      "description": "Community Action in Self Help, Inc is a private non-for-profit housing agency formed in 1972 whose mission and vision is dedicated to the principal that everyone is entitles to safe, decent and affordable housing regardless of race, color, creed or personal circumstances.  In pursuit of that goal the Agency has undertaken many different tasks, projects, and programs.  Currently  we manage 47 units of affordable housing.  We also act as the Local Administer for the Wayne County Housing Choice Voucher Section 8 Program.  We will assist lower income households in obtaining home ownership by offering home buyer education, credit counseling, educational materials, and referrals for service.  Community Action in Self Help, Inc is a Housing and Urban Development (HUD) Housing Counseling Agency, enabling the staff to assist homeowners in foreclosure prevention, loan modifications, forbearance plans and reverse mortgage education and counseling. The Agency also provides services to persons with general housing needs such as relocation assistance, landlord/tenant issues, DSS Advocacy, emergency services and general education.  We also provide lead based paint testing as a service to local landlords and tenants.  Agency disseminates information on local housing issues and specific rights, responsibilities and governmental regulations affecting rental housing units.  We also house a community Technology Center giving assistance to local residence with job searches, resume writing, computer skills and individual trainings."
    },
    {
      "website url": "http://www.codeinc.org",
      "phone no.": "(716) 664-2044",
      "contact person": "PATRICK MORRIS",
      "title": "Citizens Opportunity For Development & Equality Inc.",
      "service area": "NORTHEAST AND NORTH RIVER",
      "address": "3311 411 WINSOR ST JAMESTOWN, NY 14702",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=443",
      "email": "pmorris@codeinc.org",
      "description": "Citizen's Opportunity for Development & Equality, Inc. (CODE) is a 501-c-3 not-for-profit corporation founded in 1981 to promote revitalization activities in the City of Jamestown, Cattaraugus County, Chautauqua County, and Western NY. CODE's primary activities concentrate on reviving structures on the major arterial leading into the city and its manufacturing base. Long term planning with phases in construction has allowed CODE, Inc. to effectively create low- and very low-income housing which is attractive, clean, safe and affordable. These projects are designed to promote private sector investment back into the neighborhood as funding includes both government and private sources. CODE, Inc. also works closely with foundations, businesses and government in fostering community and economic development projects which promote growth in employment and revitalization of underutilized land and structures. CODE's mission is to promote revitalization activities in designated neighborhoods in Western New York by:"
    },
    {
      "website url": "http://www.homsite.org",
      "phone no.": "(315) 253-8451",
      "contact person": "THOMAS HIGGINS",
      "title": "Homsite Fund, Inc.",
      "service area": "AUBURN",
      "address": "60 CLARK ST AUBURN, NY 13021",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=444",
      "email": "stephen.selvek@homsite.org",
      "description": "Homsite Fund, Inc. is a comprehensive not-for-profit housing agency.  Homsite Fund, Inc. conducts and administers many rehabilitation programs in the City of Auburn, New York.  This year Homsite Fund, Inc. did  over 1.5 million dollars in rehabilitation efforts.  In addition to this, our agency does new construction, housing management, Section 8 administration, and all types of housing counseling (prepurchase, post purchase, mortgage default, landlord-tenant counseling, etc.).  In addition, our agency has a revolving fund security deposit program and helps clients to purchase new and existing homes.  This year, Homsite Fund, Inc. revitalized an entire two block neighborhood in Auburn."
    },
    {
      "website url": "http://www.group14621.com",
      "phone no.": "(585) 266-4693",
      "contact person": "GEORGE MOSES",
      "title": "Group 14621 Community Association, Inc.",
      "service area": "14621 ZIP CODE AREA",
      "address": "1171 N CLINTON AVE ROCHESTER, NY 14621",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=452",
      "email": "group14621@group14621.com",
      "description": "Group 14621 Community Association is an advocacy agency  working to involve our community members in collective efforts to improve the quality of life in our neighborhoods.  By so doing, we enhance education, employment, housing and recreation opportunities for residents and foster personal responsibility, understanding and appreciation of our diversity and similarities.  Group 14621 is a membership organization open to those who live work, worship, volunteer, or own property in the neighborhood generally bounded by the 14621 zip code.  Among our activities, Group 14621 administers home improvement grants, rehabilitates vacant homes for first-time owners as a Community Housing Development Organization (CHDO), and works with residents to address quality of life concerns such as property conditions, public safety, noise and neighborhood appearance.  Group 14621 actively works to engage residents in planning for neighborhood development, identify problems and solutions, and educate community members regarding property codes, ordinances, and zoning requirements.  Focus areas for the current year include:"
    },
    {
      "website url": "",
      "phone no.": "(914) 699-1114",
      "contact person": "DENNIS HANRATTY",
      "title": "Mount Vernon United Tenants",
      "service area": "SOUTH MOUNT VERNON",
      "address": "2107 40 SOUTH 4TH AVE MT VERNON, NY 10550",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=485",
      "email": "mvut@erols.com",
      "description": "MVUT is a city-wide, membership organization whose program efforts fall primarily under five (5) categories:"
    },
    {
      "website url": "http://www.hudsonriverhousing.org",
      "phone no.": "(845) 454-5176",
      "contact person": "EDMONG G. MURPHY",
      "title": "Hudson River Housing, Inc.",
      "service area": "POUGHKEEPSIE",
      "address": "313 MILL ST POUGHKEEPSIE, NY 12601",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=523",
      "email": "emurphy@hudsonriverhousing.org",
      "description": "Hudson River Housing, Inc. (HRH) is a Neighborhood Preservation Company (NPC), Community Housing Development Organization (CHDO), and NeighborWorks America Organization which develops, rehabilitates and operates emergency, transitional and permanent housing for low-income and homeless families and individuals in Dutchess County."
    },
    {
      "website url": "http://www.ecdo.org",
      "phone no.": "(212) 678-0037",
      "contact person": "JANICE C. BERTHOUD",
      "title": "Ecumenical Community Development Organization",
      "service area": "WEST AND CENTRAL HARLEM",
      "address": "443 W 125TH ST NEW YORK, NY 10027",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=537",
      "email": "jberthoud@ecdo.org",
      "description": "Recently, we reached the 3nd year anniversary of the opening a new state of art educational center for children. The  development of the ECDO Headstart/Early Childhood Development Day Care Center at 249 W. 144th Street is offering the highest quality of early childhood educational activities to low to moderate income residents of the community. The ECDO/Headstart Early Childhood Development Center provides full day care to infants, toddlers and preschoolers."
    },
    {
      "website url": "",
      "phone no.": "(516) 759-0788",
      "contact person": "PASCUAL BLANCO",
      "title": "La Fuerza Unida, Inc",
      "service area": "GLEN COVE",
      "address": "SUITE 302 1 SCHOOL ST GLEN COVE, NY 11542",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=538",
      "email": "lafuerza@lfuinc.org",
      "description": "La Fuerza Unida de Glen Cove, Inc. was incorporated in December 1978 as a 501(c) (3) not-for-profit organization  to enhance  the social, literary, educational, cultural, and economic condition of the Hispanic Americans and the low to moderate income population at large. As such it provides a  gamut of social,  youth,  human, educational, immigration,  housing, and community economic development services to the  residents of the City of Glen Cove and the County of Nassau.  La Fuerza is the official designated Neighborhood Preservation Company by New York State and the official Community Housing Development Organization under the Federal Department of Housing and Urban Development.  To that effect, La Fuerza seeks to retain and increase the availability of low and moderated income housing units by stimulating housing development and housing related programs to benefit the targeted low and moderate income population."
    },
    {
      "website url": "http://www.nwrochester.org",
      "phone no.": "(585) 325-4170",
      "contact person": "KIMBERLY A. BRUMBER",
      "title": "Nhs Of Rochester Dba Neighborworks Rochester",
      "service area": "NORTHEAST INNER LOOP",
      "address": "570 SOUTH AVE ROCHESTER, NY 14620",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=539",
      "email": "kbrumber@nwrochester.org",
      "description": "Service Profile:  Neighborhood Housing Services of Rochester, Inc. d/b/a NeighborWorks Rochester is an organization dedicated to helping people achieve the benefits of homeownership and is committed to revitalizing and sustaining Rochester city neighborhoods.  To Support this goal, NeighborWorks Rochester offers financial, educational, and technical assistance in working with people to reach their goals.  NeighborWorks Rochester has education curriculum for both pre- and post- purchase homeowners with an emphasis on home purchase preparation, budgeting, and home maintenance.  NeighborWorks Rochester's lending programs offer low-interest loans for home purchase and owner-occupied home rehabilitation.  NeighborWorks Rochester also organizes an intensive community revitalization effort, led by residents, with several areas targeted for substantial, sustained improvement."
    },
    {
      "website url": "",
      "phone no.": "(716) 856-8613",
      "contact person": "LAURA KELLY LAWTON",
      "title": "Old 1St Ward Community Association, Inc.",
      "service area": "OLD FIRST WARD",
      "address": "62 REPUBLIC ST BUFFALO, NY 14204",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=541",
      "email": "lkelly@old1stward.org",
      "description": "The Old 1st Ward Community Association offers the following:  owner occupied rehab, first time homebuyer assistance, acquisition/rehab/resale, new single family construction, senior rental units at the Buffalo River Apartments, commercial/economic development activities, Housing Court Assistance, drug/crime prevention programs, neighborhood beautification programs, ongoing strategic planning initiatives."
    },
    {
      "website url": "",
      "phone no.": "(718) 816-1811",
      "contact person": "BEVERLY V. NEUHAUS",
      "title": "Richmond Senior Services, Inc.",
      "service area": "NORTH SHORE",
      "address": "729 DELAFIELD AVE STATEN ISLAND, NY 10310",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=545",
      "email": "rss500@con2.com",
      "description": "Richmond Senior Services, Inc. promotes and provides housing and housing-related services for older persons, persons with physical disabilities,  and developmentally disabled adults.  Project S.H.A.R.E. (Senior Housing at Reduced Expense) has provided safe and affordable shared housing opportunities for over 28 years for low-income seniors and disabled persons.  This program includes both agency-managed apartments in which three to four persons live cooperatively  in a residence maintained by Richmond Senior Services, and housing in the homes of senior homeowners who are willing to share their homes for the benefits of companionship and financial contribution to the household.  Both these opportunities are viable options in the ever-increasing costs of the rental market.  The Access to Home program provides home modifications  to low-income disabled persons to allow them safe access in, out and throughout their homes.  The addition of ramps, lifts, visual acuity and other modifications assures their full access to their community and needed services, and helps them to remain at home rather than in an institution.  The Senior Repair Program is a  home repair service that offers minor health and safety related home repairs for seniors and disabled persons.  This program covers the small, but otherwise costly, repairs that seniors cannot complete themselves due to lack of income or physical capabilities.    Hundreds of repairs are completed each year.  Our advocacy, information and referral,  entitlement counseling and application assistance also assist seniors and disabled persons in maintaining their independence in the community by accessing all possible services, including housing, adult education, emergency food supplies, and other housing repair services.  A senior food pantry provides emergency food to seniors and disabled persons each month who are experiencing difficulty in meeting household expenses.  Recipients of the food supplies also receive pre-screening for food stamps, entitlement screenings, housing and  job counseling, case assistance and information and referral.  The program encourages a nutritionally sound diet, while also alleviating some demands upon their financial resources."
    },
    {
      "website url": "",
      "phone no.": "(516) 292-0007",
      "contact person": "GUADALUPE RODRIGUEZ",
      "title": "Hempstead Hispanic Civic Association, Inc.",
      "service area": "HEMPSTEAD",
      "address": "236 MAIN ST HEMPSTEAD, NY 11550",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=546",
      "email": "hhca_guadalupe@optonline.net",
      "description": "Hempstead Hispanic Civic Association, Inc. (HHCA) was organized in 1977 and incorporated in 1978 for the purpose of serving the minority community at three different levels: housing, education, and civic activities. A community-based organization working to promote the welfare of those resident in the Village of Hempstead by creating positive change in neighborhoods struggling with disinvestment, poverty, and neglect. Over the years, HHCA has developed 90 units of housing for rental and homeownership purposes and has converted a number of tenants into landlords. HHCA has utilized the Community Developments Block Grant, AHC, HUD 203K, and private capital to fund these developments. We will be using Federal Home Loan Bank, and we will submit Housing Trust Fund application to expand our program and the funding track record of our organization. The improvement and preservation of our traditional neighborhood will be accomplished by providing the following activities and services: educational homeownership counseling, loan pre-qualification, mortgage counseling, and loan/grant assistance to lower closing cost. We also organize tenants, assist tenant associations, and hold seminars and workshops on tenant rights and responsibilities, housing court, filing complaint forms, and procedures of the Rent Administration Office."
    },
    {
      "website url": "http://www.niagarafallsnhs.org",
      "phone no.": "(716) 285-7778",
      "contact person": "KATHLEEN L. STEINMAN",
      "title": "Niagara Falls Neighborhood Housing Services, Inc.",
      "service area": "NIAGARA FALLS",
      "address": "479 16TH ST NIAGARA FALLS, NY 14303",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=548",
      "email": "ksteinman@roadrunner.com",
      "description": "Niagara Falls Neighborhood Housing Service, Inc. (NFNHS)  was founded in 1979 by residents and city government officials who wanted a change in their neighborhood.  Our mission is to foster residential, commercial, and economic development in a defined geographic area.  NFNHS continues to create programs needed to continue our revitalization efforts in economically declining neighborhoods such as counseling for the first-time homebuyers and existing owners experiencing financial difficulties, first-time home ownership opportunities for first-time home buyers, and a 50/50 loan/grant rehab loans.  Most recently, this past year, NFNHS created safe, decent, and affordable rental housing units using CDBG and HOME funds."
    },
    {
      "website url": "",
      "phone no.": "(845) 713-4568",
      "contact person": "FAITH PIATT",
      "title": "Orange County Rural Development Advisory Corp.",
      "service area": "RURAL ORANGE COUNTY",
      "address": "2 S MONTGOMERY ST WALDEN, NY 12586",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=564",
      "email": "faithpiatt@ocrdac.org",
      "description": "Orange County Rural Development Advisory Corporation (RDAC) has been providing housing and related services to Orange County since 1983.  During this time, the group has rehabilitated or constructed more than 750 housing units and has been instrumental in assisting hundreds to obtain financing, mortgage restructuring, and services to remain in existing homes or apartments.  RDAC has particularly targeted locally-employed households and senior citizens."
    },
    {
      "website url": "",
      "phone no.": "(718) 453-9490",
      "contact person": "JEFFREY DUNSTON",
      "title": "Northeast Brooklyn Housing Development Corp.",
      "service area": "OCEANHILL/BROWNSVILLE/CROWN HEIGHTS/BEDFORD STUYVESANT",
      "address": "132 RALPH AVE BROOKLYN, NY 11233",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=593",
      "email": "jdunston@nebhdco.org",
      "description": "Northeast Brooklyn Housing Development Corporation is a not-for-profit preservation company located in the Stuyvesant Heights Neighborhood of Bedford-Stuyvesant, Brooklyn, New York , serving three Community Boards: 3, 16, and part of 8.  The service's provided are: seminars for homebuyers, tenant/client counseling, tenant organizing, housing and mortgage counseling, vacant lots and garden clean-up, and after-school tutorial programs funded by Banker's Trust and The Enterprise Foundation."
    },
    {
      "website url": "",
      "phone no.": "(718) 922-2229",
      "contact person": "ROMEO LAZARRO",
      "title": "East New York Urban Youth Corps Inc.",
      "service area": "EAST NEW YORK",
      "address": "539 ALABAMA AVE BROOKLYN, NY 11207",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=602",
      "email": "romeolazarro@usa.com",
      "description": "East New York Urban Youth Corps, Inc. ( ENYUYC ) was established in 1987 to promote and facilitate neighborhood controlled revitalization, growth, development, and empowerment in East New York. ENYUYC is involved in construction, development, and management of affordable housing, youth programs,  crime prevention programs, social services programs, and ENYUYC acts as a springboard for employment capacitation and training for under-served residents( i.e the youth and very low income head of households). ENYUYC  has completed 12 construction development projects resulting in the creation of 583 units of affordable housing.  Currently ENYUYC manages over 650 units of affordable housing in 70 buildings, including a Tier II shelter. In addition, ENYUYC has a resident advocacy and tenant organizing component. The Youth Development Program consists of after-school programs, the PACT - ( Police and Community Together ) truancy program, and summer camp program.  Our major sources of funding are: NYS - DHS, Department of Justice, DHCR, Development Fees, other government agencies, and private fund raising."
    },
    {
      "website url": "http://www.communityheritagecorp.org",
      "phone no.": "(518) 725-2114",
      "contact person": "DAVID O. HENDERSON",
      "title": "Fulton County Community Heritage Corp.",
      "service area": "FULTON COUNTY",
      "address": "646 73 N MAIN ST GLOVERSVILLE, NY 12078",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=615",
      "email": "fcchc@frontiernet.net",
      "description": "The Fulton County Community Heritage Corporation (FCCHC)  is committed to improving housing conditions and the quality of life for area residents with particular attention to the needs of low and moderate income individuals and families.  FCCHC looks to assess local community development and housing needs and to identify resources to address those needs both directly and in cooperation  with local municipalities. FCCHC has been successful in securing funding and administering a variety of  housing rehabilitation and home repair programs since 1988.  In addition, FCCHC has provided assistance to first-time home buyers and has developed and now manages 64 units of housing for lower income elderly households."
    },
    {
      "website url": "http://www.arborhilldc.org",
      "phone no.": "(518) 463-9993",
      "contact person": "ARLENE C. WAY",
      "title": "Arbor Hill Development Corp.",
      "service area": "ARBOR HILL/NORTH ALBANY",
      "address": "241 CLINTON AVE ALBANY, NY 12210",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=648",
      "email": "away@arborhilldc.org",
      "description": "Arbor Hill Development Corporation (AHDC), a community-based not-for-profit organization, was founded in 1981 to promote neighborhood revitalization through individual grants and technical assistance.   Covering two distinct areas of Albany, AHDC assists residents with  home maintenance, home ownership counseling and grants,  rental subsidies, community streetscape efforts, neighborhood association support, referrals and general technical assistance.   AHDC also manages rental units and non-profit office space, leveraging over 2 million dollars of  state, federal, and private dollars annually."
    },
    {
      "website url": "http://www.mounthopehousing.org",
      "phone no.": "(718) 299-2051",
      "contact person": "JEAN FRITZ",
      "title": "Mount Hope Housing Co, Inc.",
      "service area": "MOUNT HOPE",
      "address": "2003-05 WALTON AVE BRONX, NY 10453",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=741",
      "email": "fritz_jean@mounthopehousing.org",
      "description": "Mount Hope Housing Company is a community development corporation with affordable housing expertise at its beginnings and a strong track record of multifaceted service delivery.  The mission of the Mount Hope Housing Company, Inc. is to revitalize the communities served by providing safe, decent, affordable housing, economic development, youth, human and educational services.   Since 1986, Mount Hope has been in the \"business\" of community development stemming from a commitment to the South Bronx that has generated sustainable structures for physical space, personal development, and economic regeneration that nurture and grow with community need.  Created, led, and driven by community interests, Mount Hope has responded to the needs of a challenged community through a $100 million investment in real estate development, program management, and initiatives for area families.  For 19 years, Mount Hope has operated with the conviction that quality, safe housing lends to household stability; stable households with opportunities for employment, financial management and wealth building tools are less prone to incidence of family crisis; household strife kept at bay lends to a sense of possibility beyond a family's current circumstance - for both adult caregivers and their children.  Multifaceted in its programs for low-income residents, Mount Hope offers a number of opportunities for families with one integrated objective - to bring high-level resources where they are needed most.  This objective is among the organization's highest priorities."
    },
    {
      "website url": "http://www.nehda.org",
      "phone no.": "(315) 425-1032",
      "contact person": "MICHAEL LA FLAIR",
      "title": "Nehda, Inc.",
      "service area": "NORTHEAST SYRACUSE",
      "address": "101 GERTRUDE ST SYRACUSE, NY 13203",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=747",
      "email": "nehda@cnymail.com",
      "description": "The Northeast Hawley Development Association, Inc. (NEHDA) is a community housing development organization in the City of Syracuse. The organizations efforts are focused on the northeast side of the city. The fundamental mission at NEHDA is neighborhood revitalization through enhanced homeownership opportunities for low to moderate income individuals and families. In addition to targeted acquisition and redevelopment of unutilized and problematic residential properties, NEHDA offers additional support services meant to stabilize and improve neighborhoods in decline. Those services include housing counseling, asset protection counseling, and community organizing. NEHDA currently has five full-time staff members and operates on an administrative budget of approximately $200,000.00 per year. Operating funds are made available through grants from the New York State Division of Housing and Community Renewal; the City of Syracuse as participating jurisdiction for United States Department of Housing and Urban Development; Community Development Block Grant and HOME programs; United Way of Central New York; local lending institutions; donations through membership and fundraising drives; and sale of assets. The primary source of programmatic funding is the City of Syracuse, Department of Community Development. NEHDA is actively engaged in an effort to identify and pursue additional sources of funding with which to expand programmatic efforts. NEHDA recently submitted one proposal for consideration as a recipient of funding to be distributed through the Syracuse Neighborhood Initiative, (SNI) Phase II. This initiative aims to invest $15,000,000.00 in neighborhood revitalization throughout the city and if successful, NEHDA could receive upwards of $1,600,000.00 for the construction of single family homes in its target area. NEHDA has recently developed and adopted a strategic plan that identifies and prioritizes areas and properties targeted for development. The board of directors has chosen a vision for the future of the organization that includes closer collaborations with other similar agencies. Through awareness of assistance opportunities, knowledge of current market circumstances and local housing needs, NEHDA endeavors to continually enhance its capacity as a housing development organization."
    },
    {
      "website url": "http://www.triponline.org",
      "phone no.": "(518) 272-8289",
      "contact person": "PATRICK MADDEN",
      "title": "Troy Rehabilitation And Improvement Program",
      "service area": "HILLSIDE NEIGHBORHOOD",
      "address": "1249 415 RIVER ST TROY, NY 12180",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=781",
      "email": "info@triponline.org",
      "description": "The Troy Rehabilitation and Improvement Program (TRIP) is a 35 year-old community development corporation engaged in a variety of programs intended to enhance the quality of life in Troy's neighborhoods.  A mainstay of TRIP's work since its inception has been the development and promotion of home ownership opportunities.  In furtherance of that goal TRIP operates a NeighborWorks Home Ownership Center.  The Center provides a \"one stop shop\" through which current and prospective home owners can access any of a number of resources available in the City to promote the acquisition and retention of owner occupied housing.  The Center offers extensive pre- and post-purchase education, down payment and closing cost assistance, and home repair/improvement technical assistance and financing.  Both the Russell Sage College and RPI home buyer incentive programs are administered out of the Center as are a variety of City sponsored programs."
    },
    {
      "website url": "http://www.wsnhs.org",
      "phone no.": "(716) 885-2344",
      "contact person": "LINDA CHIARENZA",
      "title": "West Side Neighborhood Housing Services, Inc.",
      "service area": "WEST SIDE",
      "address": "359 CONNECTICUT ST BUFFALO, NY 14213",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=796",
      "email": "lchiarenza@wsnhs.org",
      "description": "West Side Neighborhood Housing Services, Inc. is a non-profit lender dedicated to promoting home ownership, improving the housing stock, and addressing quality of life issues in the City of Buffalo, west of Main Street through our agency and various collaborations.  Due to the increased demand for our services, we have signed Memorandum of Understanding (MOU) with housing agencies outside of our immediate area.  They include but are not limited to Heart of the City and Hispanics United of Buffalo.  Under this agreement, their staff does the application intake and we underwrite and fund the loan. WSNHS is also administering a $485,000.00 grant from the Federal Home Loan Bank for exterior repairs thru out the City.  We have received numerous requests for partner loans to complete projects. For example, if a roof needs repair and the maximum grant is $4,850.00, but the cost of the repair is $8,000.00, we are funding the difference from our NeighborWorks America revolving loan fund. These loans have been extended throughout the City limits. West Side Neighborhood Housing Services, Inc. is a HUD certified counseling agency, and we are the only agency certified to give secondary financing to FHA mortgages. Our homeownership education prepares potential first-time home buyers with classes explaining the process of obtaining a mortgage and how to avoid predatory lenders. We offer credit counseling to correct outstanding financial issues that may hinder their getting a conventional mortgage. We also provide technical advice and rehabilitation loans to encourage families to stay in their homes. West Side Neighborhood Housing Services, Inc. does this by inspecting the property and then processing a loan application. The loan would cover any and all City of Buffalo building code violations. On a smaller scale, we have instituted a Minor Home Repair program. The guidelines for this program are that the homeowner purchases the supplies and we pay a repair person to do the labor. West Side Neighborhood Housing Services, Inc. also has an Emergency Program to address an immediate need such as a broken furnace or water line. Due to a lack of funding, we no longer offer a security program. We are aggressive in offering first mortgages to families that are working to become homeowners, but their credit scores are too low, or the value of the house is not enough to go to a regular lending institution. Our Executive Director is still an active member of the Save Our Streets Committee to help rid absentee landlord properties of drug activity."
    },
    {
      "website url": "",
      "phone no.": "not listed",
      "contact person": "not listed",
      "title": "Neighborhood Preservation Coalition Of Nys, Inc.",
      "service area": "not listed",
      "address": "SUITE 710 100 STATE ST ALBANY, NY 12207",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=840",
      "email": "not listed",
      "description": ""
    },
    {
      "website url": "http://www.ccaction.org",
      "phone no.": "(716) 945-1041",
      "contact person": "TINA G. ZERBIAN",
      "title": "Cattaraugus Community Action, Inc.",
      "service area": "CATTARAUGUS COUNTY",
      "address": "25 JEFFERSON ST SALAMANCA, NY 14779",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=858",
      "email": "tzerbian@ccaction.org",
      "description": "ENERGY AND HOUSING SERVICES DEPARTMENT:  ENERGY: Operates the Weatherization Assistance Program (WAP), Fuel Assistance (HEAP), Niagara Mohawk Low-Income Customer Assistance Program.  All of these services focus on assisting low-income people to improve the quality of their home in Cattaraugus and Allegany counties. Also, CCA was one of ten grantees awarded funding under NYSERDA's first Community Based Organization Initiative. As such, CCA has been the Regional Implementer of these services in a six-county area, subcontracting with four other entities: Chautauqua Opportunities, New Buffalo Impact, Niagara Community Action, and Wyoming Community Action. Programs available through NYSERDA at CCA are: Assisted Home Performance with Energy Star, Home Performance with Energy Star, WNY Environmental Projects (Mitigation Funds), EmPower, Expanded EmPower,"
    },
    {
      "website url": "http://www.nmic.org",
      "phone no.": "(212) 822-8300",
      "contact person": "MARIA LIZARDO",
      "title": "Northern Manhattan Improvement Corp.",
      "service area": "WASHINGTON HEIGHTS/INWOOD",
      "address": "4TH FLOOR 76 WADSWORTH AVE NEW YORK, NY 10033",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=887",
      "email": "marializardo@nmic.org",
      "description": "Northern Manhattan Improvement Corporation is a not-for-profit community based housing organization established in 1979 and serving the Washington Heights/Inwood section of Upper Manhattan. The agency's client population is comprised mostly of very low income immigrants from the Dominican Republic. In addition to its housing activities, which include anti-eviction services, community tenant and block organizing, and housing development, the agency offers social services (including domestic violence prevention) and a range of workforce development services for low income residents, including English classes. There is a great demand in the community for all of NMIC's services, especially those related to housing."
    },
    {
      "website url": "",
      "phone no.": "(718) 773-4116",
      "contact person": "YAHYA O. RAJI",
      "title": "Brooklyn Neighborhood Improvement Association Inc.",
      "service area": "CROWN HEIGHTS/PROSPECT HEIGHTS",
      "address": "ROOM #1F 1482 ST JOHNS PL BROOKLYN, NY 11213",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=925",
      "email": "raj162@juno.com",
      "description": "Brooklyn Neighborhood Improvement Association, Inc. (BNIA) is a 501 (c) (3) neighborhood preservation organization dedicated to serving the housing and community development needs of residents and businesses in Central Brooklyn and East New York.  The organization was founded in 1978 by community residents, merchants and church leaders in an effort to save the neighborhood from decay and destruction.  BNIA is a certified United States Department of Housing and Urban Development (HUD) counseling agency and promotes home ownership in Community Boards #8 and #16.  The need for safe, decent affordable housing is critical for the community area which BNIA serves.  BNIA currently provides housing counseling, housing development and other community development services for residents of Central Brooklyn.   Most of the clients served have household incomes below 60 percent of the area median household income.  BNIA brings together public and private sectors to produce efficient management systems for this large resource of publicly-owned housing."
    },
    {
      "website url": "",
      "phone no.": "(845) 352-1400",
      "contact person": "EVA ENGLARD",
      "title": "Rcdc Housing, Inc.",
      "service area": "VILLAGES IN ROCKLAND COUNTY",
      "address": "22 MAIN ST MONSEY, NY 10952",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=928",
      "email": "rcdchousing@aol.com",
      "description": "Since 1978 the Rockland Community Development Council (RCDC) has been committed to improving the lives of low income local residents in Rockland County. RCDC specifically targets low to moderate income, disabled, frail, and elderly residents, offering a wide array of assistance programs in the areas of housing, human services, senior citizen programs, employment, and quality medical care. The shortage of suitable, affordable housing is a major concern in the community. RCDC helps residents locate appropriate housing and upgrade the condition of such housing through home improvement programs, weatherization, maintenance, and training. RCDC's social workers assist clients with applying for various government benefits, while providing training for families to become self sufficient through job placement and training. Senior centers are operated offering not just a reprieve from isolation, but health screening, educational lectures, recreation, and physical activity. Daily contact is maintained with homebound seniors, and visitation, meals, and medical care are provided. In summary, RCDC's aim is to improve life in the community by matching needs with available services."
    },
    {
      "website url": "http://www.prideofticonderoga.org",
      "phone no.": "(518) 585-6366",
      "contact person": "SHARON M. REYNOLDS",
      "title": "Pride Of Ticonderoga, Inc.",
      "service area": "TOWN OF TICONDEROGA & NORTH WASHINGTON COUNTY",
      "address": "348 111 MONTCALM ST TICONDEROGA, NY 12883",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=946",
      "email": "sreynolds@prideofticonderoga.org",
      "description": "PRIDE of Ticonderoga is a non-profit Rural Preservation Company established in 1984 for the purpose of Preserving, Revitalizing, Implementing, Directing, and Effecting community development through the securing of public and private funds for housing rehabilitation, economic development, historic preservation, community planning, and educational programs."
    },
    {
      "website url": "http://www.mbdhousing.org",
      "phone no.": "(718) 842-0256",
      "contact person": "DERRICK A. LOVETT",
      "title": "Mbd Community Housing Corporation",
      "service area": "CROTONA PARK EAST",
      "address": "1762 BOSTON RD BRONX, NY 10460",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=1036",
      "email": "dlovett@mbdhousing.org",
      "description": "MBD COMMUNITY HOUSING CORPORATION is a not-for-profit entity located in the South Bronx and has a long history dating back to the mid-seventies.  MBD COMMUNITY HOUSING CORP is dedicated to the advancement and encouragement of those residing in its catchment area.  The types of services rendered by MBD are as follows: Affordable Housing, Property Management, Human Services, MBD Family Medical Practice, Comprehensive Case Management, Crime Prevention, Safe At Home Program, Tenant Associations, Tenant Patrols, Community Health Screenings, Comprehensive Senior Services, Senior Health Workshops, Senior Social Events, Fresh Air Fund, Farmer's Market, Clothing Drive, Youth Services, Individual & Family Counseling.  Lastly, Referrals and Outreach were conducted."
    },
    {
      "website url": "http://www.rdrc.org",
      "phone no.": "(718) 327-5300",
      "contact person": "KEVIN W. ALEXANDER",
      "title": "Rockaway Development & Revitalization Corp.",
      "service area": "ROCKAWAY PENINSULA AND BROAD CHANNEL",
      "address": "SUITE 2 1920 MOTT AVE FAR ROCKAWAY, NY 11691",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=1168",
      "email": "kalexander@rdrc.org",
      "description": "Rockaway Development and Revitalization Corporation is a not-for-profit economic development organization serving the Rockaway Peninsula in Queens, NY. Our mission is to improve the quality of life within the community through the following divisions: business, housing, employment and training, and Youth Services-Beacon Program. The business division primarily focuses upon the recruitment and retention of businesses within the NYS Economic Development Zone (EDZ). Certain types of businesses that open within the EDZ are entitled to tax breaks, attractive financing packages, and discounts on utility expenses. Businesses already in the EDZ that are currently expanding are entitled to similar financial benefits. The housing division is engaged in the creation of rental and owner-occupied housing, improvement to the existing housing stock, the education of potential first-time homeowners, and financial assistance and counseling to homeowners and renters. The division is currently involved with acquiring vacant land and developing it into two-family homes that will be sold at prices affordable to households earning 80% of median area income or less. The Housing Division also educates and packages loans for individuals interested in purchasing, refinancing, and building residential housing in the area. The employment and training division trains, prepares, and places individuals seeking employment. This is done through the Youth Employment Program, which places 14 to 18 year olds. The S.T.R.I.V.E. program prepares adults who have been unsuccessful in holding onto gainful employment by addressing attitudes and providing  basic skills. The Beacon program provides after-school activities and tutoring to junior high school and high school-aged youths."
    },
    {
      "website url": "http://www.stnicksalliance.org",
      "phone no.": "(718) 388-5454",
      "contact person": "MICHAEL F. ROCHFORD",
      "title": "St. Nicks Alliance Corp.",
      "service area": "CENTRAL WILLIAMSBURG/GREEN POINT",
      "address": "2 KINGSLAND AVE BROOKLYN, NY 11211",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=1176",
      "email": "mrochford@stnicksalliance.org",
      "description": "St. Nicholas Neighborhood Preservation Company was founded in the Spring of 1975 by residents and business people of Williamsburg and Greenpoint, Brooklyn. Our founders wanted to develop an organization to help stem the accelerating deterioration and housing abandonment in this poor and working class community. Since 1975, it has fulfilled this mission by building a comprehensive array of community based services and programs in housing, economic development and human services to confront the area's problems. Now it is confronting new challenges of preserving and creating affordable housing for low and moderate income people, in one of the City's hottest housing markets."
    },
    {
      "website url": "",
      "phone no.": "(716) 856-7110",
      "contact person": "MAGALIE LOMAX",
      "title": "Hispanos Unidos De Buffalo, Inc.",
      "service area": "LOWER WESTSIDE",
      "address": "254 VIRGINIA ST BUFFALO, NY 14201",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=1195",
      "email": "liglesias@hispunited.org",
      "description": "Hispanics United of Buffalo is a non-profit organization servicing the residents of Buffalo's West Side and the Hispanic Communities of Buffalo and Erie County."
    },
    {
      "website url": "",
      "phone no.": "(718) 728-7820",
      "contact person": "MARIE TORNIALI",
      "title": "Central Astoria Local Development Coalition, Inc.",
      "service area": "CENTRAL ASTORIA",
      "address": "SUITE 1C 25-69 38TH ST ASTORIA, NY 11103",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=1226",
      "email": "centralastoria@aol.com",
      "description": "Since 1979, the mission of the Central Astoria Local Development Coalition has been to conduct activities designed to combat neighborhood deterioration.  Acting in the public interest of both the business and residential community, Central Astoria has undertaken programs which stimulate private reinvestment and contribute to economic development, quality of life, and housing preservation goals.  Central Astoria has been the leading provider of soft cost housing services for the residents of its service area.  These services have been targeted towards individuals with fixed, low, or moderate income as well as seniors and immigrants that make up a large percentage of the service area's population.  During the 05-06 period, the organization performed the following NPC activities: tenant/client assistance (including but not limited to obtaining and reviewing lease renewals), preventing unlawful eviction, counseling on housing court, adjusting rent overcharges, restoring basic services, calculating  MBR & MCR rent increases, mediating landlord and tenant disputes, and loan/grant applications assistance including but not limited to: SCRIE (new/renewal applications),DRIE applications,  HEAP (new/renewal applications), and Lifeline (new/renewal applications)."
    },
    {
      "website url": "http://www.allencatherdal.org",
      "phone no.": "(718) 658-6660",
      "contact person": "PATRICIA A. RUBENS",
      "title": "Allen Ame Neighborhood Preservation And Development Corp.",
      "service area": "JAMAICA",
      "address": "114-02 GUY R BREWER BLVD JAMAICA, NY 11434",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=1695",
      "email": "prubens@optonline.net",
      "description": "Allen AME Neighborhood Preservation & Development Corp. (NP&D;) provides housing services and community services and community services to the Southeast Queens community in Jamaica, NY.  We provide housing services in the area of new development of affordable housing, marketing homes, property rehabilitation and housing referral.  We provide educational services for those in danger of losing their homes to foreclosure as well as for those in need of minor to major repairs of their homes.  Supportive services include collaboration with banks and other lending institutions to offer home buying seminars for those interested in purchasing property and assistance to persons seeking home improvement loans by helping them to complete applications and acting as liaisons with local banks."
    },
    {
      "website url": "http://www.westhab.org",
      "phone no.": "(914) 345-2800",
      "contact person": "KENNETH BELFER",
      "title": "Westhab In Yonkers, Inc.",
      "service area": "SOUTHWEST YONKERS",
      "address": "8 BASHFORD ST YONKERS, NY 10701",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=1696",
      "email": "ken.belfer@westhab.org",
      "description": "Westhab in Yonkers (WIY) develops affordable housing in Southwest Yonkers.  Among the many activities undertaken by WIY, are the development of work force family housing, housing for disabled veterans and supportive housing for single adults.  WIY also is involved in a comprehensive plan to assist in the transformation of  Nodine Hill neighborhood.  The initial phase of this work was funded by the NYS Main Street program and will now continue with the development of home ownership and rental housing. Since 2003, Westhab in Yonkers has completed six projects leveraging $26,000,000 in new housing resources for the service area."
    },
    {
      "website url": "http://www.housingvisions.org",
      "phone no.": "(315) 472-3820",
      "contact person": "KENYON M. CRAIG",
      "title": "Housing Visions Unlimited, Inc.",
      "service area": "SALT SPRINGS AREA OF THE CITY OF SYRACUSE",
      "address": "SUITE 26 1201 E FAYETTE ST SYRACUSE, NY 13210",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=1826",
      "email": "kcraig@housingvisions.org",
      "description": "Housing Visions Unlimited, Inc. was incorporated in 1990 to significantly improve the quality of housing and the quality of life in the Greater East Genesee Street neighborhood in the City of Syracuse. A successful neighborhood revitalization model was created and with its affiliates Housing Visions has expanded its boundaries throughout New York State. Housing Visions purchases substandard multifamily buildings in \"critical mass\" groupings and substantially renovates the properties or newly constructs buildings, providing quality housing to low-income families who, in turn, accept responsibility for their surroundings and become involved in neighborhood revitalization efforts. Housing Visions has successfully renovated and placed into operation 67 buildings in the City of Syracuse providing a total of 185 housing units to eligible persons of low-income, 38 buildings in the City of Utica for 113 units of housing, 8 buildings in the City of Binghamton totaling 22 units, and 3 buildings in the City of Auburn for 12 units of quality affordable housing. Operations include: obtaining project financing, purchasing properties, managing the construction, leasing to and assisting residents, maintaining and eventually selling the buildings to qualified residents."
    },
    {
      "website url": "",
      "phone no.": "(716) 823-5124",
      "contact person": "PHIL LOWREY",
      "title": "Lackawanna Housing Development Corporation",
      "service area": "FIRST AND SECOND WARDS",
      "address": "640 RIDGE RD LACKAWANNA, NY 14218",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=1961",
      "email": "lhdcorp@aol.com",
      "description": "The Lackawanna Housing Development Corporation (LHDC), a not-for-profit housing corporation, was founded in 1990 as an associated corporation of the Lackawanna Community Development Corporation (LCDC). LHDC is designed to improve the quality of life through the restoration of deteriorated housing stock, creating  new housing, and encouraging residential growth for low to moderate income households in the First and Second Wards in the City of Lackawanna."
    },
    {
      "website url": "",
      "phone no.": "(518) 293-7569",
      "contact person": "MARY E. MATTILA",
      "title": "Rpc Of Clinton County, Inc",
      "service area": "CLINTON COUNTY",
      "address": "128 48 GANONG DR SARANAC, NY 12981",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=1978",
      "email": "rpc@clintonrpc.org",
      "description": "The Rural Preservation Company of Clinton County, Inc. has been in existence since 1986.  Our missing as a housing agency is to improve the living conditions of low-income homeowners within our Clinton County service area."
    },
    {
      "website url": "http://www.cltofschdy.org",
      "phone no.": "(518) 372-7616",
      "contact person": "BEVERLY BURNETT",
      "title": "Community Land Trust Of Schenectady, Inc.",
      "service area": "MT.PLEASANT, BELLVUE, NORTH SCHENECTADY, GOOSE HILL, & THE STOCKADE",
      "address": "1677 VAN VRANKEN AVE SCHENECTADY, NY 12308",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2006",
      "email": "info@cltofschdy.org",
      "description": "Community Land Trust of Schenectady, Inc., AKA Hill and Vale Affordable Housing, a non-profit Corporation, was formed in 1991 to offer affordable housing opportunities in the Hamilton Hill and Vale neighborhoods of Schenectady.  Their  mission:  \"We seek to revitalize neighborhoods and to improve the quality of life in the City of Schenectady by providing home ownership opportunities using the Community Land Trust model.  We rehabilitate housing for low- and moderate-income families, recruit and educate homeowners and advocate for housing issues.\"  In December 2000, the designation as a \"Neighborhood Preservation Company\" brought additional funding and expanded the service area into the Mont Pleasant, Bellevue, North Schenectady and Stockade neighborhoods in Schenectady."
    },
    {
      "website url": "",
      "phone no.": "(212) 678-4700",
      "contact person": "YESENIA ESTRELLA",
      "title": "Sinergia, Inc.",
      "service area": "MANHATTAN VALLEY/CENTRAL AND EAST HARLEM",
      "address": "902 AMSTERDAM AVE NEW YORK, NY 10025",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2009",
      "email": "yestrella@sinergiany.org",
      "description": "Founded in 1977, Sinergia, Inc. was developed to link low-income underserved or unserved families with individuals with disabilities to culturally and linguistically  appropriate services. As the agency grew, it pioneered services that were non-existent or unavailable to low-income, minority families. These services include: housing advocacy; parent training and education for parents of children with disabilities; transitional housing for homeless families of persons with disabilities; supportive housing for developmentally disabled parents living with their children; foster care (family Care) for children with disabilities; home care;  various models of residential services  for individuals with developmental disabilities and day habilitation services."
    },
    {
      "website url": "http://www.nhnhome.org",
      "phone no.": "(718) 686-7946",
      "contact person": "RON ZAK",
      "title": "Neighbors Helping Neighbors, Inc.",
      "service area": "SUNSET PARK/SOUTH SLOPE",
      "address": "SUITE 202 443 39TH ST BROOKLYN, NY 11232",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2011",
      "email": "rzak@fifthave.org",
      "description": "Neighbors Helping Neighbors (NHN)  is a non-profit organization located in Sunset Park, Brooklyn whose mission is to empower low and moderate-income residents to secure quality housing and build assets.  NHN serves low- and moderate-income tenants, homeowners, and potential home buyers.  All services are available in English or Spanish."
    },
    {
      "website url": "",
      "phone no.": "(718) 604-0020",
      "contact person": "CAPLE G. SPENCE",
      "title": "Ldc Of Crown Heights",
      "service area": "CROWN HEIGHTS",
      "address": "230 KINGSTON AVE BROOKLYN, NY 11213",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2014",
      "email": "ldcch@ldcch.org",
      "description": "The Local Development Corporation of Crown Heights, Inc. (LDDCH) is a non-profit community based organization funded in 1987. It was created in the same spirit as the empowerment zones and Strategic Planning Communities in New York State, to provide assistance to individuals who are least able to help themselves, to attract financial resources to the housing stock and commercial sector of Crown Heights. Our mission is to improve the neighborhood's physical housing conditions while increasing the quality of life of community residents.  LDCCH provides housing, loans to Minority and Women owned businesses, Educational Training in Computer Technology, social services to low and moderate income individuals, the elderly, families and those people with special needs. Our purpose is to improve the living conditions, financial strength, communication technology, and social services status of our community."
    },
    {
      "website url": "",
      "phone no.": "(716) 597-0262",
      "contact person": "CORNELIUS JOHNSON JR.",
      "title": "Citizens Alliance, Inc.",
      "service area": "DELEVAN-GRIDER",
      "address": "836 E DELAVAN AVE BUFFALO, NY 14215",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2023",
      "email": "cornelius_johnsonjr@yahoo.com",
      "description": "Citizens' Alliance Inc. is a non profit community based organization serving the Delavan-Grider neighborhood of the City of Buffalo. Citizens' Alliance provides direct housing assistance to property owners and advocates for the availability of safe and affordable housing. An agency that works to ensure access to decent housing for low to moderate income residents, Citizens' Alliance mission focuses on strengthening the community through collaborative initiatives with other groups and organizations."
    },
    {
      "website url": "http://www.homefrontdevcorp.com",
      "phone no.": "(518) 747-8250",
      "contact person": "SHARON M. REYNOLDS",
      "title": "Homefront Development Corp.",
      "service area": "WASHINGTON COUNTY EXCLUDING TOWNS OF PUTNAM, DRESDEN, AND WHITEHALL",
      "address": "568 LOWER ALLEN ST HUDSON FALLS, NY 12839",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2043",
      "email": "homefrontdev@albany.twcbc.com",
      "description": "HomeFront Development Corporation was founded in 1989.  Our mission is to help very low, low and moderate income households with affordable housing options.  The services we provide are:  Low income senior housing, home buyer assistance programs, housing rehabilitation programs, home buyer education, foreclosure prevention counseling, pre and post purchase counseling, emergency grant assistance for eminent danger, RD 515 multi-family housing rental management, technical assistance to other agencies and organizations, grant writing, clearing house for housing/rehabilitation related issues, administration of Housing Choice Voucher Program for home purchase.  Our services are to provide for stabilization and improvement and to provide affordable and safe housing in our communities throughout the county."
    },
    {
      "website url": "http://www.pathstone.org",
      "phone no.": "(585) 340-3346",
      "contact person": "JOHN T. WILTSE",
      "title": "Rural Housing Opportunities Corporation",
      "service area": "GENESEE ORLEANS ONTARIO SENECA WAYNE & YATES COUNTIES",
      "address": "400 EAST AVE ROCHESTER, NY 14607",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2151",
      "email": "jwiltse@pathstone.org",
      "description": "Rural Housing Opportunities Corporation, Inc. (RHOC) offers housing assistance programs to low-income families and works to develop multi-family affordable housing opportunities.  The service area includes Genesee, Orleans, Ontario, Seneca, Wayne and Yates Counties.  RHOC is an affiliate corporation of Rural Opportunities, Inc. established to improve housing conditions in the service area.  RHOC's mission is to expand housing choices and improve affordability through the creation of new housing, the improvement of existing housing, and the enhancement of housing options for low-income and otherwise disenfranchised residents of rural communities through a variety of financial assistance and asset building strategies.  RHOC is governed by a twelve member Board of Directors, seven of whom reside in the service area.  RHOC currently provides a variety of services, including homeownership assistance, financial education, housing rehabilitation and energy services and low cost loan or grant assistance to help low-income residents with housing improvement or acquisition.  (1.)  Homeownership assistance is provided in Genesee, Orleans, Ontario and Wayne Counties.  These services include homebuyer education, financial education, credit counseling, mortgage application assistance, and post-purchase counseling and training. Homeownership services are provided by personnel certified in homebuyer counseling and trained in residential mortgage lending.  Other financial enhancements may also be available to low-income customers.  (2.)  Owner occupied housing rehabilitation services are offered in Genesee, Orleans, Ontario and Wayne Counties.  (3.)  Loans for home energy related improvements are also available to residents throughout the region through a program called Assisted Home Performance.  (4.)  RHOC provides community development assistance to municipalities through technical assessment of property improvement needs in downtown districts, including mixed use buildings and offers contract operation of publicly funded programs such as NY Main Street and Community Development Block Grant (CDBG) programs.  (5.)  RHOC also offers affordable rental opportunities for families and seniors in Genesee, Orleans, Wayne and Ontario Counties."
    },
    {
      "website url": "",
      "phone no.": "(585) 544-3486",
      "contact person": "SONIA NUNEZ",
      "title": "Isla Housing And Development Corporation",
      "service area": "NORTHEAST/CENTRAL ROCHESTER",
      "address": "1164 N CLINTON AVE ROCHESTER, NY 14621",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2179",
      "email": "sonia@proway.com",
      "description": "Isla Housing and Development Corporation provides a variety of services to families in the Northeast area of Rochester. Our services include the typical loan and grant packaging, advocacy and other services.  Isla  Housing is also a CHDO Developer in this area providing rehabilitated homes to First Time home buyers at a lower price as well as providing subsidy to the income qualified buyer.  Isla has developed St Michael's I Senior Apartments that houses 28 elderly and disabled persons and  Phase II to St. Michael's  II Senior  Apartments that has 32 apartments for Seniors.  Isla also manages St. Michael's I as well as St Michaels II .  Isla continues to own/manage the  Pride House  that houses the Catholic Family Center whom provides services to the neighborhood residents ."
    },
    {
      "website url": "",
      "phone no.": "(518) 843-7137",
      "contact person": "JEFFREY L. LAZAROU",
      "title": "The Valley Rural Housing Corporation",
      "service area": "MONTGOMERY COUNTY, EXCLUDING THE TOWN OF AMSTERDAM",
      "address": "41 MARKET ST AMSTERDAM, NY 12010",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2355",
      "email": "jeff@lazarouinsurance.com",
      "description": "The Valley Rural Housing Corporation was formed in 1993 and currently has 2 full-time and 1 part-time staff and works through a contract-for-service with over 5 different agencies, including the City of Amsterdam.  They have a strong tenant advocacy program with over 130 cases per year.  A prevailing community need and top priority for the Board is rehabilitating the current housing stock (98% of units were constructed prior to 1978.)  Amsterdam has the oldest-per-capita population in the State of New York.  Rehabilitation efforts are focused on the elderly population's homes.  In early years, 1994 and 1995, two small RESTORE grants assisted over 18 elderly homeowners with emergency repairs.  With the first HOME grant, 35 homes were rehabilitated for elderly homeowners, at an average of only $9,857 per home.  The second HOME grant rehabilitated a total of 37 units - more than the original estimate because active networking and community development made it possible to join forces with other agencies to rehabilitate additional homes with limited funding."
    },
    {
      "website url": "http://www.wccainc.org",
      "phone no.": "(585) 237-2600",
      "contact person": "MICHAEL T. WEISS",
      "title": "Wyoming County Community Action, Inc.",
      "service area": "WYOMING, GENESEE, AND ORLEANS COUNTIES",
      "address": "6470 ROUTE 20A PERRY, NY 14530",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2583",
      "email": "mweiss@wccainc.org",
      "description": "Service Profile: Wyoming County Community Action, Inc. (WCCA) is a not-for-profit cap agency serving the counties of Wyoming, Genesee and Orleans in rural western New York State.  WCCA is a OneStop Agency as designated by the Department of Labor.  We provide services to individuals and other human service agencies through three divisions:  Housing Programs, Employment & Training and Angels in Action.  The Board of Directors for WCCA is made up of individuals from all three counties that are served.  WCCA operates a NYS Certified Pre-School Day Care in Wyoming County."
    },
    {
      "website url": "http://www.rouserpc.com",
      "phone no.": "(518) 283-3435",
      "contact person": "PAUL TAZBIR",
      "title": "Rouse Rpc, Inc.",
      "service area": "RENSSELAER COUNTY, EXCLUDING TROY",
      "address": "99 BLOOMING GROVE DR TROY, NY 12180",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2683",
      "email": "rrouse@nycapp.rr.com",
      "description": "R.O.U.S.E., RPC was funded in l994 to meet the increasing housing needs of the senior population in Rensselaer County.  There was a large demand for safe, affordable senior housing in the rural areas.  Future residents did not want to leave their communities, with friends and family within a few miles, and move to housing in the Cities of Troy and Rensselaer.  R.O.U.S.E., RPC brought the housing to the senior population."
    },
    {
      "website url": "http://www.nhsnyc.org",
      "phone no.": "(718) 457-1017",
      "contact person": "YGMAR WIEL",
      "title": "Neighborhood Housing Services Of Northern Queens",
      "service area": "CORONA, ELMHURST, & JACKSON HEIGHTS",
      "address": "2ND FLOOR 60-20 WOODSIDE AVE WOODSIDE, NY 11377",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=2764",
      "email": "ygmar_wiel@nhsnyc.org",
      "description": "Neighborhood Housing Services of Northern Queens (NHSNQ) is a not-for-profit housing organization whose primary goal is to serve the housing needs of residents in Community Boards 1,2, 3 and 4. The organization's mission is to increase and protect investment in the neighborhoods it serves by creating, promoting and preserving affordable housing, educating residents, and supporting neighborhood self-reliance. NHSNQ was established in 1994 and is governed by a Board of Directors comprised of community residents, leaders, government and financial representatives."
    },
    {
      "website url": "http://www.hrhcare.org/preservation/pchome.html",
      "phone no.": "(914) 734-8795",
      "contact person": "KAREN GORDON",
      "title": "The Preservation Company, Inc.",
      "service area": "CITY OF PEEKSKILL",
      "address": "1037 MAIN ST PEEKSKILL, NY 10566",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=3103",
      "email": "kgordon@hrhcare.org",
      "description": "The Preservation Company, Inc. (the \"Preservation Company\") is a housing and community development organization serving Peekskill.  Its mission is to increase and improve the supply of housing for low and moderate income households and to contribute to community development and revitalization efforts.  Our store front office is easily accessed by public transportation.  We maintain an \"open-door-policy\" that welcomes everyone on a walk-in basis.  We are open regularly from 9 a.m. to 5 p.m.  on weekdays and during evenings and weekends by appointment.  The Preservation Company is staffed by trained professionals experienced in administration, housing development and management, and tenant and homeowner services.  We have been part of Peekskill for many years.  We know our community and its social, charitable and housing resources by experience.  We are proud of our excellent working relationship with neighboring agencies and service providers.  A variety of services and programs are administered here that can meet the needs of families at many different levels.  Along with workshops and assistance with the purchase and mortgaging of a home, we also provide rental housing and look for opportunities to expand the supply of affordable rental and home ownership housing.  In addition, we provide tenant services, including mediation services and referrals to organizations for rent assistance, security deposits, etc.  The Preservation Company runs both a Home Improvement Program and a Rental Rehab Program, assisting in necessary improvements for income-eligible homeowners and landlords in the City of Peekskill."
    },
    {
      "website url": "http://www.sheltersofsaratoga.org",
      "phone no.": "(518) 581-5955",
      "contact person": "MICHAEL FINOCCHI",
      "title": "Shelters Of Saratoga, Inc.",
      "service area": "CITY OF SARATOGA SPRINGS EXCLUDING GEYSER CREST AND NORTH OF I-87",
      "address": "3089 14 WALWORTH ST SARATOGA SPRINGS, NY 12866",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=3305",
      "email": "sosed@nycapp.rr.com",
      "description": "Shelters of Saratoga (SOS)'s mission, as a Neighborhood Preservation Company, is to create healthy, thriving neighborhoods that retain the architecture of the past while providing affordable housing for existing and new residents of Saratoga Springs. To accomplish this, they conduct a number of ongoing programs supplemented by a continuous effort to identify the needs of the community and establish feasible solutions."
    },
    {
      "website url": "http://www.hocn.org",
      "phone no.": "(716) 882-7661",
      "contact person": "STEPHANIE J. SIMEON",
      "title": "Heart Of The City Neighborhoods, Inc.",
      "service area": "DOWNTOWN AREA, NEAR EAST SIDE, & LOWER WEST SIDE OF BUFFALO",
      "address": "SUITE A 251 VIRGINIA ST BUFFALO, NY 14201",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=3421",
      "email": "s.simeon@hocn.org",
      "description": "Heart of the City Neighborhoods, Inc. (HCN) mission is to create, facilitate and support housing and neighborhood development of the central core in the City of Buffalo.  This will be achieved through creating programs to improve residential units, assisting private developers, neighborhood leaders, the City and other not-for-profit organizations in developing sustainable projects to improve downtown neighborhoods.  HCN's prime operations include the acquisition, rehabilitation, and resale of blighted properties, using public and private funding to make housing available to low-moderate income households.  Additionally, HCN provides a number of other housing-related services, including technical assistance and referrals."
    },
    {
      "website url": "",
      "phone no.": "(845) 569-0770",
      "contact person": "EILEEN CLIFFORD",
      "title": "Pathstone Community Improvement Of Newburgh",
      "service area": "CITY OF NEWBURGH (EXCLUDING CENSUS TRACT 2)",
      "address": "1086 NEWBURGH, NY 12551",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=3992",
      "email": "eclifford@pathstone.org",
      "description": "The Newburgh Community Improvement Corporation (NCIC) is the designated Neighborhood Preservation Corporation serving the City of Newburgh.  NCIC is a NeighborWorks America organization (NWO) and a Community Housing Development Organization (CHDO).  NCIC provides Home Ownership Education and Counseling services, using counselors certified by NeighborWorks America, by HUD and by Fannie Mae.  NCIC also develops affordable housing for both the home ownership and rental markets.  NCIC is developing the last six units of an acquisition/rehabilitation/resale project, and has just finished 20 affordable rental units as Phase III of the Historic Lander Street Apartments.  NCIC also operates a Permanent Housing Program for the Disabled, with HUD support.  This project has been 100% occupied since its inception in 2002.  In 2003, NCIC and an array of community partner agencies received designation from the U.S. Department of Justice as a Weed and Seed site, working on crime prevention and reduction, and development of opportunities for residents of Census Tract 4."
    },
    {
      "website url": "http://www.adelantesc.org",
      "phone no.": "(631) 234-1049",
      "contact person": "MIRIAM M.E. GARCIA",
      "title": "Adelante Of Suffolk County, Inc.",
      "service area": "PART OF BRENTWOOD - CONTACT FOR DETAILS",
      "address": "83 CARLETON AVE CENTRAL ISLIP, NY 11722",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=4337",
      "email": "adelante2@juno.com",
      "description": "Adelante of Suffolk County, Inc., a non-profit multi-service community based organization, founded in 1966, has successfully provided services to the culturally diverse community of Suffolk County in the areas of health, education, employment, supported housing, youth leadership programs, volunteerism, and cultural awareness.  Adelante strives to eliminate the social stigma and economic barriers that prevent the effective functioning and assimilation of its community members. This goal is achieved by assisting the most vulnerable: children and youth, persons with disabilities, low-income families, recent immigrants and senior citizens."
    },
    {
      "website url": "",
      "phone no.": "(716) 285-5650",
      "contact person": "CHARLETTA TYSON",
      "title": "Highland Community Revitilization Committee, Inc",
      "service area": "PART OF NIAGARA FALLS - CONTACT FOR DETAILS",
      "address": "SUITE 101 2616 HIGHLAND ST NIAGARA FALLS, NY 14305",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=4339",
      "email": "ctyson116@yahoo.com",
      "description": "The Highland Community Revitalization Committee, Inc. (HCRC) is a cooperative of concerned citizens and residents seeking to serve as a catalyst for the resurgence and redevelopment of the Highland community and surrounding area. Through its leadership and by its example HCRC will bring vitality back into the community. Its beautification efforts will make the area a more desirable place to live. HCRC will work to improve the quality of life for residents by upgrading housing and removing blight and will work with the community and in partnership with civic, business and other sources to rebuild and restore the Highland area. HCRC will advocate on behalf of area residents and businesses to appropriate agencies which will attract needed help and resources. Promoting pride in the Highland area will bring the community together with the common purpose and goal of advancement for all."
    },
    {
      "website url": "http://www.aafe.org",
      "phone no.": "(212) 477-7077",
      "contact person": "THOMAS YU",
      "title": "Downtown Manhattan Community Development Corp.",
      "service area": "CHINATOWN/LOWER EASTSIDE",
      "address": "GROUND FLOOR 141 NORFOLK ST NEW YORK, NY 10002",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=4412",
      "email": "thomas_yu@aafe.org",
      "description": "Downtown Manhattan Community Development Corporation (DMCDC) was founded in 1995 to provide affordable housing planning and implementation for downtown Manhattan.  With a Board comprised primarily of local residents and business owners, DMCDC responds to local needs with appropriate quality development.  DMCDC  promotes and protects the housing rights of  low-income families through advocacy  for and access to housing resources, such as affordable housing and government subsidies.  DMCDC links with local  social service programs, home ownership, small business and other initiatives, while targeting planning and real estate development in the Lower East Side and Chinatown to revitalize of these important neighborhoods."
    },
    {
      "website url": "",
      "phone no.": "(718) 435-1300",
      "contact person": "TOM BAUER",
      "title": "Community Organization Of Southern Brooklyn, Inc.",
      "service area": "BOROUGH PARK",
      "address": "4006 18TH AVE BROOKLYN, NY 11218",
      "hcr_data_url": "https://www1.dhcr.state.ny.us/LocalHousingOrgLists/Profile.aspx?applid=5045",
      "email": "tbauer@sbcony.org",
      "description": "No profile found for this organization"
    }
  ]
}